{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed May 04 2016 09:02:12 GMT-0400",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Greater Visibility Through PowerShell Logging",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "766f66fd-e9aa-4b58-8418-53341d253480",
    "author": "Matthew Dunwoody ",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "lynda.hall@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "1b2c72b8-68d3-434f-b60b-6b50ed5fd59a"
    ],
    "jcr:created": "Fri Jun 03 2016 19:49:14 GMT-0400",
    "cq:lastReplicated": "Fri Jun 03 2016 19:49:14 GMT-0400",
    "cq:lastModified": "Wed Mar 09 2016 13:41:34 GMT-0500",
    "cq:distribute": true,
    "jcr:description": "Mandiant is continuously investigating attacks that leverage Powershell throughout all phases of the attack. A common issue we experience is a lack of available logging that adequately shows what actions the attacker performed using PowerShell. In those investigations, Mandiant routinely offers guidance on increasing PowerShell logging to provide investigators a detection mechanism for malicious activity and a historical record of how PowerShell was used on systems. This blog post details various PowerShell logging options and how they can help you obtain the visibility needed to better respond, investigate, and remediate attacks involving PowerShell.",
    "jcr:baseVersion": "1b2c72b8-68d3-434f-b60b-6b50ed5fd59a",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-tags:scripting",
      "fireeye-blog-threat-research:threat-research\/vulnerabilities",
      "fireeye-doctypes:blog",
      "fireeye-blog-tags:windows-malware",
      "fireeye-blog-authors:matthew-dunwoody",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:powershell-attacks"
    ],
    "jcr:uuid": "05cce478-3995-402f-afd1-0246763a1ed7",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Feb 11 2016 04:53:00 GMT-0800",
    "_charset_": "UTF-8",
    "cq:lastModifiedBy": "lynda.hall@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "lynn.thorne@fireeye.com",
        "text": "\u003Cp\u003E\u003Ci\u003EUPDATE (Feb. 29): This post has been updated with new configuration recommendations due to the Feb. 24 rerelease of PowerShell 5, and now includes a link to a parsing script that users may find valuable.\u003C\/i\u003E\u003C\/p\u003E\n\u003Ch2\u003EIntroduction\u003C\/h2\u003E\n\u003Cp\u003EMandiant is continuously investigating attacks that leverage PowerShell throughout all phases of the attack. A common issue we experience is a lack of available logging that adequately shows what actions the attacker performed using PowerShell. In those investigations, Mandiant routinely offers guidance on increasing PowerShell logging to provide investigators a detection mechanism for malicious activity and a historical record of how PowerShell was used on systems. This blog post details various PowerShell logging options and how they can help you obtain the visibility needed to better respond, investigate, and remediate attacks involving PowerShell. \u0026nbsp;\u003C\/p\u003E\n\u003Ch2\u003EBackground\u003C\/h2\u003E\n\u003Cp\u003EAttackers and developers of penetration-testing frameworks are increasingly leveraging Windows PowerShell to conduct their operations. PowerShell is an extremely powerful command environment and scripting language that is built in to Microsoft Windows. By default, PowerShell does not leave many artifacts of its execution in most Windows environments. The combination of impressive functionality and stealth has made attacks leveraging PowerShell a nightmare for enterprise security teams\u003Ca name=\u0022_ftnref1\u0022\u003E\u003C\/a\u003E[1].\u003C\/p\u003E\n\u003Cp\u003EPowerShell 2.0, which comes installed on all Windows 7\/2008 systems, provides very little evidence of attacker activity. The Windows event logs show that PowerShell executed, the start and end times of sessions, and whether the session executed locally or remotely (ConsoleHost or ServerRemoteHost). However, they reveal nothing about what was executed with PowerShell. Figure 1 shows an example of the event log messages recorded in the PowerShell 2.0 log Windows PowerShell.evtx.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dunwoody%20powershell\/figure_1.png\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: PowerShell Session Start in PowerShell 2.0\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EMicrosoft has been taking steps to improve the security transparency of PowerShell in recent versions. The most significant improvements, such as enhanced logging, were released in PowerShell version 5.0. This enhanced logging records executed PowerShell commands and scripts, de-obfuscated code, output, and transcripts of attacker activity. Enhanced PowerShell logging is an invaluable resource, both for enterprise monitoring and incident response.\u003C\/p\u003E\n\u003Cp\u003EPowerShell 5.0 is the current release for Windows 7\/2008 R2 and above. Though many of the enhanced logging features of PowerShell 5.0 were backported to version 4.0, Mandiant recommends installing PowerShell 5.0 on all Windows platforms. PowerShell 5.0 includes features not available in 4.0, including suspicious script block logging.\u003C\/p\u003E\n\u003Ch2\u003EInstallation\u003C\/h2\u003E\n\u003Cp\u003EWindows 10 does not require any software updates to support enhanced PowerShell logging.\u003C\/p\u003E\n\u003Cp\u003EFor Windows 7\/8.1\/2008\/2012, upgrading PowerShell to enable enhanced logging in PowerShell 5.0 (recommended) requires:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E.NET 4.5\u003C\/li\u003E\n\u003Cli\u003EWindows Management Framework (WMF) 4.0 (Windows 7\/2008 only)\u003C\/li\u003E\n\u003Cli\u003EWindows Management Framework (WMF) 5.0\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EWindows 7 and 2008 R2 must be upgraded to Windows Management Framework (WMF) 4.0 prior to installing WMF 5.0.\u003C\/p\u003E\n\u003Cp\u003EEnabling enhanced logging in PowerShell 4.0 for Windows 7\/8.1\/2008\/2012 requires:\u003C\/p\u003E\n\u003Cp\u003E»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; .NET 4.5\u003Cbr\u003E\n»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Windows Management Framework (WMF) 4.0\u003Cbr\u003E\n»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; The appropriate WMF 4.0 update\u003Cbr\u003E\n\u0026nbsp;\u0026nbsp;\u0026nbsp; \u0026nbsp;\u0026nbsp;\u0026nbsp; - \u0026nbsp;\u0026nbsp;\u0026nbsp; 8.1\/2012 R2 – KB3000850\u003Cbr\u003E\n\u0026nbsp;\u0026nbsp;\u0026nbsp; \u0026nbsp;\u0026nbsp;\u0026nbsp; -\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 2012 – KB3119938\u003Cbr\u003E\n\u0026nbsp;\u0026nbsp;\u0026nbsp; \u0026nbsp;\u0026nbsp;\u0026nbsp; -\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 7\/2008 R2 SP1 – KB3109118\u003C\/p\u003E\n\u003Cp\u003EDownloading these updates from Microsoft may require the completion of an automated request process.\u003C\/p\u003E\n\u003Ch2\u003ELogging Configuration\u003C\/h2\u003E\n\u003Cp\u003ELogging must be configured through Group Policy as follows:\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EAdministrative Templates → Windows Components → Windows PowerShell\u003C\/b\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dunwoody%20powershell\/figure_2.png\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: PowerShell configuration options\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EPowerShell supports three types of logging: module logging, script block logging, and transcription. PowerShell events are written to the PowerShell operational log Microsoft-Windows-PowerShell%4Operational.evtx.\u003C\/p\u003E\n\u003Ch2\u003EModule Logging\u003C\/h2\u003E\n\u003Cp\u003EModule logging records pipeline execution details as PowerShell executes, including variable initialization and command invocations. Module logging will record portions of scripts, some de-obfuscated code, and some data formatted for output. This logging will capture some details missed by other PowerShell logging sources, though it may not reliably capture the commands executed. Module logging has been available since PowerShell 3.0. Module logging events are written to Event ID (EID) 4103.\u003C\/p\u003E\n\u003Cp\u003EWhile module logging generates a large volume of events (the execution of the popular Invoke-Mimikatz script generated 2,285 events resulting in 7 MB of logs during testing), these events record valuable output not captured in other sources.\u003C\/p\u003E\n\u003Cp\u003ETo enable module logging:\u003C\/p\u003E\n\u003Cp\u003E1.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; In the “Windows PowerShell” GPO settings, set “Turn on Module Logging” to enabled.\u003Cbr\u003E\n2.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; In the “Options” pane, click the button to show Module Name.\u003Cbr\u003E\n3.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; In the Module Names window, enter \u003Cb\u003E*\u003C\/b\u003E to record all modules.\u003Cbr\u003E\n\u0026nbsp;\u0026nbsp;\u0026nbsp; a.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Optional: To log only specific modules, specify them here. (Note: this is not recommended.)\u003Cbr\u003E\n4.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Click “OK” in the “Module Names” Window.\u003Cbr\u003E\n5.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Click “OK” in the “Module Logging” Window.\u003C\/p\u003E\n\u003Cp\u003EAlternately, setting the following registry values will have the same effect:\u003C\/p\u003E\n\u003Cp\u003E»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; HKLM\\SOFTWARE\\Wow6432Node\\Policies\\Microsoft\\Windows\\PowerShell\\ModuleLogging → EnableModuleLogging = 1\u003Cbr\u003E\n»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; HKLM\\SOFTWARE\\Wow6432Node\\Policies\\Microsoft\\Windows\\PowerShell\\ModuleLogging \\ModuleNames → * = *\u003C\/p\u003E\n\u003Ch2\u003EScript Block Logging\u003C\/h2\u003E\n\u003Cp\u003EScript block logging records blocks of code as they are executed by the PowerShell engine, thereby capturing the full contents of code executed by an attacker, including scripts and commands. Due to the nature of script block logging, it also records de-obfuscated code as it is executed. For example, in addition to recording the original obfuscated code, script block logging records the decoded commands passed with PowerShell’s -EncodedCommand argument, as well as those obfuscated with XOR, Base64, ROT13, encryption, etc., in addition to the original obfuscated code. Script block logging will not record output from the executed code. Script block logging events are recorded in EID 4104.\u0026nbsp;Script blocks exceeding the maximum length of an event log message are fragmented into multiple entries. A script is available to parse script block logs and reassemble fragmented blocks (see reference 5).\u003C\/p\u003E\n\u003Cp\u003EWhile not available in PowerShell 4.0, PowerShell 5.0 will automatically log code blocks if the block’s contents match on a list of suspicious commands or scripting techniques, even if script block logging is not enabled. These suspicious blocks are logged at the “warning” level in EID 4104, unless script block logging is explicitly disabled. This feature ensures that some forensic data is logged for known-suspicious activity, even if logging is not enabled, but it is not considered to be a security feature by Microsoft. Enabling script block logging will capture all activity, not just blocks considered suspicious by the PowerShell process. This allows investigators to identify the full scope of attacker activity. The blocks that are not considered suspicious will also be logged to EID 4104, but with “verbose” or “information” levels.\u003C\/p\u003E\n\u003Cp\u003EScript block logging generates fewer events than module logging (Invoke-Mimikatz generated 116 events totaling 5 MB) and records valuable indicators for alerting in a SIEM or log monitoring platform.\u003C\/p\u003E\n\u003Cp\u003EGroup Policy also offers an option to “Log script block execution start \/ stop events”. This option records the start and stop of script blocks, by script block ID, in EIDs 4105 and 4106. This option may provide additional forensic information, as in the case of a PowerShell script executing over a long period, but it generates a prohibitively large number of events (96,458 events totaling 50 MB per execution of Invoke-Mimikatz) and is not recommended for most environments.\u003C\/p\u003E\n\u003Cp\u003ETo enable script block logging:\u003C\/p\u003E\n\u003Cp\u003E1.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; In the “Windows PowerShell” GPO settings, set “Turn on PowerShell Script Block Logging” to enabled.\u003C\/p\u003E\n\u003Cp\u003EAlternately, setting the following registry value will enable logging:\u003C\/p\u003E\n\u003Cp\u003E»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; HKLM\\SOFTWARE\\Wow6432Node\\Policies\\Microsoft\\Windows\\PowerShell\\ScriptBlockLogging → EnableScriptBlockLogging = 1\u003C\/p\u003E\n\u003Ch2\u003ETranscription\u003C\/h2\u003E\n\u003Cp\u003ETranscription creates a unique record of every PowerShell session, including all input and output, exactly as it appears in the session. Transcripts are written to text files, broken out by user and session. Transcripts also contain timestamps and metadata for each command in order to aid analysis. However, transcription records only what appears in the PowerShell terminal, which will not include the contents of executed scripts or output written to other destinations such as the file system.\u003C\/p\u003E\n\u003Cp\u003EPowerShell transcripts are automatically named to prevent collisions, with names beginning with “PowerShell_transcript”. By default, transcripts are written to the user’s documents folder, but can be configured to any accessible location on the local system or on the network. The best practice is to write transcripts to a remote, write-only network share, where defenders can easily review the data and attackers cannot easily delete them (see reference 2 below). Transcripts are very storage-efficient (less than 6 KB per execution of Invoke-Mimikatz), easily compressed, and can be reviewed using standard tools like grep.\u003C\/p\u003E\n\u003Cp\u003ETo enable transcription:\u003C\/p\u003E\n\u003Cp\u003E1.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; In the “Windows PowerShell” GPO settings, set “Turn on PowerShell Transcription” to enabled.\u003Cbr\u003E\n2.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Check the “Include invocation headers” box, in order to record a timestamp for each command executed.\u003Cbr\u003E\n3.\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Optionally, set a centralized transcript output directory.\u003C\/p\u003E\n\u003Cp\u003EThis directory should be a write-only, restricted network share that security personnel can access. If no output directory is specified, the transcript files will be created under the user’s documents directory.\u003C\/p\u003E\n\u003Cp\u003EAlternately, setting the following registry values will enable logging:\u003C\/p\u003E\n\u003Cp\u003E\u003Cbr\u003E\n»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; HKLM\\SOFTWARE\\Wow6432Node\\Policies\\Microsoft\\Windows\\PowerShell\\Transcription → EnableTranscripting = 1\u003Cbr\u003E\n»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u0026nbsp;HKLM\\SOFTWARE\\Wow6432Node\\Policies\\Microsoft\\Windows\\PowerShell\\Transcription → EnableInvocationHeader = 1\u003Cbr\u003E\n»\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; HKLM\\SOFTWARE\\Wow6432Node\\Policies\\Microsoft\\Windows\\PowerShell\\Transcription → OutputDirectory = “” (Enter path. Empty = default)\u003C\/p\u003E\n\u003Ch2\u003ELog Settings\u003C\/h2\u003E\n\u003Cp\u003EWhere possible, Mandiant recommends enabling all three log sources: module logging, script block logging and transcription. Each of these sources records unique data valuable to analyzing PowerShell activity. In environments where log sizes cannot be significantly increased, enabling script block logging and transcription will record most activity, while minimizing the amount of log data generated. At a minimum, script block logging should be enabled, in order to identify attacker commands and code execution.\u003C\/p\u003E\n\u003Cp\u003EIdeally, the size of the PowerShell event log Microsoft-Windows-PowerShell%4Operational.evtx should be increased to 1 GB (or as large as your organization will allow) in order to ensure that data is preserved for a reasonable period. PowerShell logging generates large volumes of data that quickly rolls the log (up to 1 MB per minute has been observed during typical admin or attacker activity).\u003C\/p\u003E\n\u003Cp\u003EThe Windows Remote Management (WinRM) log, Microsoft-Windows-WinRM%4Operational.evtx, records inbound and outbound WinRM connections, including PowerShell remoting connections. The log captures the source (inbound connections) or destination (outbound connections), along with the username used to authenticate. This connection data can be valuable in tracking lateral movement using PowerShell remoting. Ideally, the WinRM log should be set to a sufficient size to store at least one year of data.\u003C\/p\u003E\n\u003Cp\u003EDue to the large number of events generated by PowerShell logging, organizations should carefully consider which events to forward to a log aggregator. In environments with PowerShell 5.0, organizations should consider, at a minimum, aggregating and monitoring suspicious script block logging events, EID 4104 with level “warning”, in a SIEM or other log monitoring tool. These events provide the best opportunity to identify evidence of compromise while maintaining a minimal dataset.\u003C\/p\u003E\n\u003Ch2\u003EAppendices\u003C\/h2\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca target=\u0022_blank\u0022 href=\u0022\/content\/dam\/fireeye-www\/blog\/pdfs\/powershell-logging-appendix-a.pdf\u0022 adhocenable=\u0022false\u0022\u003EAppendix A: Module Logging\u003C\/a\u003E displays the contents of one module logging event generated during the execution of the \u003Cspan class=\u0022code\u0022\u003EInvoke-Mimikatz\u003C\/span\u003E PowerShell script.\u003C\/li\u003E\n\u003Cli\u003E\u003Ca target=\u0022_blank\u0022 href=\u0022\/content\/dam\/fireeye-www\/blog\/pdfs\/powershell-logging-appendix-b.pdf\u0022 adhocenable=\u0022false\u0022\u003EAppendix B: Script Block Logging\u003C\/a\u003E displays the contents of one script block logging event generated during the execution of the \u003Cspan class=\u0022code\u0022\u003EInvoke-Mimikatz\u003C\/span\u003E script.\u003C\/li\u003E\n\u003Cli\u003E\u003Ca target=\u0022_blank\u0022 href=\u0022\/content\/dam\/fireeye-www\/blog\/pdfs\/powershell-logging-appendix-c.pdf\u0022 adhocenable=\u0022false\u0022\u003EAppendix C: PowerShell Transcription\u003C\/a\u003E contains a sample transcript generated when executing \u003Cspan class=\u0022code\u0022\u003EInvoke-Mimikatz\u003C\/span\u003E.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch2\u003EReferences\u003C\/h2\u003E\n\u003Col\u003E\n\u003Cli\u003E\u003Ca href=\u0022http:\/\/blogs.msdn.com\/b\/powershell\/archive\/2016\/01\/19\/windows-management-framework-wmf-4-0-update-now-available-for-windows-server-2012-windows-server-2008-r2-sp1-and-windows-7-sp1.aspx\u0022\u003Ehttp:\/\/blogs.msdn.com\/b\/powershell\/archive\/2016\/01\/19\/windows-management-framework-wmf-4-0-update-now-available-for-windows-server-2012-windows-server-2008-r2-sp1-and-windows-7-sp1.aspx\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022http:\/\/blogs.msdn.com\/b\/powershell\/archive\/2015\/06\/09\/powershell-the-blue-team.aspx\u0022\u003Ehttp:\/\/blogs.msdn.com\/b\/powershell\/archive\/2015\/06\/09\/powershell-the-blue-team.aspx\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/global\/en\/solutions\/pdfs\/wp-lazanciyan-investigating-powershell-attacks.pdf\u0022\u003Ehttps:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/global\/en\/solutions\/pdfs\/wp-lazanciyan-investigating-powershell-attacks.pdf\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/blogs.msdn.microsoft.com\/powershell\/2016\/02\/24\/windows-management-framework-wmf-5-0-rtm-packages-has-been-republished\/\u0022\u003Ehttps:\/\/blogs.msdn.microsoft.com\/powershell\/2016\/02\/24\/windows-management-framework-wmf-5-0-rtm-packages-has-been-republished\/\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/github.com\/matthewdunwoody\/block-parser\u0022\u003Ehttps:\/\/github.com\/matthewdunwoody\/block-parser\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003ESpecial thanks to Lee Holmes and the Microsoft PowerShell team.\u003C\/p\u003E\n\u003Cp\u003E[1] See the Shmoocon 2016 presentation “No Easy Breach” by Mandiant consultants Matthew Dunwoody and Nick Carr for some additional context of our experience analyzing PowerShell attacks: https:\/\/archive.org\/details\/No_Easy_Breach.\u003C\/p\u003E\n",
        "jcr:lastModified": "Wed Mar 09 2016 12:22:03 GMT-0500",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "alt": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "comments": {
        "jcr:primaryType": "nt:unstructured",
        "sling:resourceType": "social\/commons\/components\/comments"
      },
      "trackback": {
        "jcr:primaryType": "nt:unstructured",
        "sling:resourceType": "social\/blog\/components\/trackback"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "lynn.thorne@fireeye.com",
      "text": "\u003Cp\u003EMandiant is continuously investigating attacks that leverage Powershell throughout all phases of the attack. A common issue we experience is a lack of available logging that adequately shows what actions the attacker performed using PowerShell. In those investigations, Mandiant routinely offers guidance on increasing PowerShell logging to provide investigators a detection mechanism for malicious activity and a historical record of how PowerShell was used on systems. This blog post details various PowerShell logging options and how they can help you obtain the visibility needed to better respond, investigate, and remediate attacks involving PowerShell.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu Feb 11 2016 07:59:28 GMT-0500",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    }
  }
}
