{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Thu Apr 09 2020 22:02:28 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "Opération de désinformation pro-Téhéran \u0022Distinguished Impersonator\u0022 : après les pseudo-journalistes, place à la fausse indignation sur les réseaux sociaux",
    "jcr:versionHistory": "b1044639-06b7-43ed-8aa6-9653f2a73370",
    "author": "Alice Revelli",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
    "jcr:language": "fr",
    "jcr:predecessors": [
      "e427814d-2a50-4f26-9acb-80a491b42cb7"
    ],
    "jcr:created": "Thu Apr 09 2020 22:09:37 GMT+0000",
    "cq:lastModified": "Thu Apr 09 2020 22:09:31 GMT+0000",
    "jcr:baseVersion": "e427814d-2a50-4f26-9acb-80a491b42cb7",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:alice-revelli",
      "fireeye-blog-authors:lee-foster",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:iran",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:social-media",
      "fireeye-blog-tags:facebook",
      "fireeye-blog-tags:twitter"
    ],
    "jcr:lastModified": "Wed Apr 01 2020 19:57:56 GMT+0000",
    "jcr:uuid": "0b7f5c4f-9246-4c60-a8cf-f405fd1598ab",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Wed Feb 12 2020 04:30:00 GMT-0800",
    "cq:lastModifiedBy": "lynda.hall@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
        "text": "\u003Cp\u003EDans un article publié en mai 2019, FireEye Threat Intelligence révélait l\u0027existence d\u0027un \u0026nbsp;groupe d\u0027utilisateurs de réseaux sociaux impliqués dans \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/05\/social-media-network-impersonates-us-political-candidates-supports-iranian-interests.html\u0022\u003Edes activités de désinformation\u003C\/a\u003E qui, d\u0027après nos hypothèses prudentes à l\u0027époque, étaient menées au profit de l\u0027Iran. Les acteurs de ce réseau avaient alors usurpé l\u0027identité de plusieurs candidats à la Chambre des représentants lors des élections de mi-mandat de 2018. Au cours de cette même campagne, ils avaient créé de toutes pièces des profils de pseudo-journalistes pour solliciter des entretiens avec des personnalités publiques (vrais journalistes, politiciens, etc.). L\u0027objectif\u0026nbsp;? Manipuler les opinions pour servir leurs intérêts politiques. Depuis la publication de cet article, nous avons poursuivi et approfondi notre étude de ces activités qui s\u0027inscrivent selon toute vraisemblance dans le cadre d\u0027une opération de plus grande envergure. Nos conclusions ont fait l\u0027objet d\u0027un rapport intitulé \u0026quot;Distinguished Impersonator\u0026quot;.\u003C\/p\u003E\n\u003Cp\u003EAujourd\u0027hui, le groupe Facebook \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/about.fb.com\/news\/2020\/02\/removing-coordinated-inauthentic-behavior\/\u0022\u003Ea pris des mesures à l\u0027encontre de onze utilisateurs\u003C\/a\u003E de comptes Facebook et Instagram dont il nous a communiqué l\u0027identité. Une analyse de ces comptes nous a amené à conclure que leurs utilisateurs étaient tous impliqués dans l\u0027opération Distinguished Impersonator dont nous suivons les agissements depuis l\u0027an passé. Parallèlement, nous avons identifié près d\u0027une quarantaine de comptes Twitter associés à cette tentative de manipulation, et contre lesquels le réseau social à l\u0027oiseau bleu a également engagé des actions. Dans cet article, nous nous pencherons sur les activités de certains individus associés au réseau Distinguished Impersonator afin de mettre en lumière les artifices utilisés pour manipuler les opinions publiques et créer une caisse de résonance autour de thèmes à caractère politique. \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003C\/p\u003E\n\u003Ch4\u003EAperçu de l\u0027activité\u003C\/h4\u003E\n\u003Cp\u003ECommentaires postés sur les comptes de réseaux sociaux de politiciens et journalistes, propositions d\u0027interviews envoyées à des personnalités reconnues (intellectuels, journalistes, activistes, etc.), vidéos de fausses interviews postées sur les réseaux sociaux... les opérations actuelles du réseau Distinguished Impersonator s\u0027inscrivent résolument dans la continuité des activités dont nous avions déjà esquissé les contours en mai 2019. Dans cette guerre de l\u0027opinion publique, les acteurs de Distinguished Impersonator se sont également appuyés sur des informations authentiques pour mener des campagnes de désinformation, notamment à travers la diffusion d\u0027articles et de vidéos de journalistes occidentaux favorables aux thèses iraniennes et la mise en avant sur les réseaux sociaux de commentaires authentiques allant dans ce sens.\u003C\/p\u003E\n\u003Cp\u003ESi certains individus se sont fait passer pour des personnalités publiques telles que des journalistes, d\u0027autres se sont présentés comme des libéraux américains, au sens politique du terme. En ajoutant leurs voix à celles de comptes authentiques, ces imposteurs ont ainsi cherché à amplifier les réactions partisanes sur les réseaux sociaux, mais aussi des contenus servant les intérêts de Téhéran. On citera notamment des vidéos d\u0027une rencontre amicale entre le président Trump et le prince héritier d\u0027Arabie saoudite Mohammed Ben Salmane accompagnées de commentaires pro-Démocrates, des vidéos dans lesquelles des candidats démocrates à la Présidentielle américaine critiquent le rôle de Riyad dans le conflit au Yémen ou d\u0027autres contenus anti-saoudiens, anti-israéliens et anti-Trump. Certains de ces messages s\u0027adressaient même directement aux comptes de réseaux sociaux de politiciens et de journalistes américains (figure\u0026nbsp;1).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/iraninfoops\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;1\u0026nbsp;: Comptes Twitter du réseau Distinguished Impersonator postant des contenus anti-saoudiens, anti-israéliens et anti-Trump\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ENous avons observé des recoupements directs entre six individus opérant à la fois sur Facebook et sur Twitter. Dans l\u0027un de ces cas, le pseudo \u0026quot;Ryan Jensen\u0026quot; a posté sur Twitter et sur Instagram une vidéo montrant des manifestations de pacifistes américains après la mort du général Qassem Soleimani, commandant de la force al-Qods des Gardiens de la Révolution, tué lors d\u0027une frappe aérienne de l\u0027U.S. Air Force à Bagdad, en janvier 2020 (figure\u0026nbsp;2). Bien que ce raid n\u0027ait entraîné que peu de réactions des acteurs du réseau pro-Téhéran, l\u0027opération Distinguished Impersonator était active bien avant l\u0027incident.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/iraninfoops\/Picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;2\u0026nbsp;: Messages du pseudo \u0026quot;Ryan Jensen\u0026quot; sur Twitter et Instagram montrant une vidéo de manifestations anti-guerre aux États-Unis après l\u0027assassinat du général Qassem Soleimani.\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ERéponses concertées à des personnalités influentes sur Twitter et demandes d\u0027interviews de pseudo-journalistes\u003C\/h4\u003E\n\u003Cp\u003ELes comptes Twitter que nous avons identifiés comme faisant partie de l\u0027opération Distinguished Impersonator ont envoyé des réponses concertées à des tweets de personnalités et d\u0027organisations influentes (membres du Congrès américain, politiciens, journalistes, etc.). Leurs réactions, souvent ponctuées de hashtags identiques, allaient toutes dans le sens des intérêts politiques de l\u0027Iran, ce alors même que le tweet initial n\u0027avait aucun lien direct avec les positions de la république islamique. Un tweet relatif à une mission de la NASA a ainsi entraîné plusieurs réactions se rapportant à la saisie d\u0027un navire pétrolier britannique par Téhéran, en juillet 2019. D\u0027autres réponses ont porté sur les sanctions américaines contre l\u0027Iran ou la procédure d\u0027impeachment à l\u0027encontre du président Trump (figure\u0026nbsp;3). En agissant ainsi, ces comptes factices ont probablement cherché à susciter une réponse des personnalités ou des organisations auxquelles elles s\u0027adressaient. De même, leurs réactions en chaîne sur des thèmes sans rapport avec le message initial peut également indiquer une volonté de toucher un public plus large de followers.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/iraninfoops\/Picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;3\u0026nbsp;: Messages Twitter portant sur les sanctions américaines imposées à Téhéran (à gauche) et sur la procédure d\u0027impeachment contre Donald Trump (à droite).\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ELes comptes Instagram que nous pensons être rattachés au réseau Distinguished Impersonator ont ensuite repris ce fil Twitter en publiant des enregistrements d\u0027écran dans lesquels un internaute non identifié fait défiler les réponses au tweet d\u0027une personnalité publique, mêlant des comptes fictifs associés au réseau à des utilisateurs authentiques de Twitter. Le compte Instagram @ryanjensen7722 a ainsi publié une vidéo montrant le fil de réponses à un tweet du sénateur américain Cory Gardner portant sur la thématique \u0026quot;censure et oppression\u0026quot;. Cette vidéo intègre un commentaire de @EmilyAn1996, un compte Twitter lié selon nous à l\u0027opération Distinguished Impersonator, évoquant la possible culpabilité du président Trump dans son procès en destitution.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/iraninfoops\/Picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;4\u0026nbsp;: Enregistrement d\u0027écran d\u0027une vidéo publiée par @ryanjensen7722 sur Instagram et faisant défiler les réponses à un tweet du sénateur américain Cory Gardner\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EComme nous avons pu l\u0027observer, au moins deux pseudo-journalistes prétendant travailler dans des organes de presse légitimes ont contacté par Twitter des personnalités influentes de pays occidentaux (intellectuels, activistes, journalistes, conseillers politiques, etc.) afin de les inviter à répondre à des interviews (figure\u0026nbsp;5). Parmi celles-ci\u0026nbsp;: des représentants de think tanks tels que le Washington Institute for Near East Policy et le Foreign Policy Research Institute, des conservateurs américains opposés au président Trump et un député britannique. Les personnes sollicitées étaient invitées à s\u0027exprimer sur des sujets associés aux intérêts politiques iraniens, comme la prochaine campagne présidentielle de Trump, les relations de l\u0027Administration Trump avec l\u0027Arabie saoudite, le \u0026quot;Deal du siècle\u0026quot; impulsé par cette même Administration et censé mettre un terme au conflit israélo-palestinien, ou encore un tweet du locataire de la Maison-Blanche sur l\u0027ancienne Première ministre britannique Theresa May.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/iraninfoops\/Picture5.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;5\u0026nbsp;: Demande d\u0027interview adressée sur Twitter à des intellectuels et des journalistes par le pseudo \u0026quot;James Walker\u0026quot;.\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EDes sondages d\u0027opinion sur Twitter visant à faire réagir la twittosphère sur des sujets en lien avec les intérêts de Téhéran\u003C\/h4\u003E\n\u003Cp\u003ECertains comptes Twitter ont également publié des sondages d\u0027opinion visant à provoquer le débat sur certains sujets politiques et, très probablement, de gonfler au passage leur base de followers. Le pseudo @CavenessJim a ainsi posé la question suivante\u0026nbsp;: \u0026quot;La politique étrangère de Donald Trump, notamment pour ce qui concerne le \u0026quot;Deal du siècle\u0026quot; en Israël, vous inspire-t-elle confiance\u0026nbsp;?\u0026quot; (Les sondés avaient le choix entre\u0026nbsp;: \u0026quot;Oui\u0026quot; et \u0026quot;Non, car la politique de Trump est dictée par ses intérêts personnels\u0026quot;. Au final, la réponse négative a recueilli 99\u0026nbsp;% des 2\u0026nbsp;241\u0026nbsp;\u0026quot;votes\u0026quot;, dont l\u0027authenticité demeure impossible à confirmer). Un autre pseudo, @AshleyJones524, a répondu à un tweet du sénateur républicain Lindsey Graham en publiant les résultats d\u0027un autre sondage dans lequel les 24 participants avaient répondu par l\u0027affirmative que le politicien était \u0026quot;le toutou de Trump\u0026quot;, en indexant sept figures politiques nationales et un célèbre humoriste américain. Les comptes du réseau Distinguished Impersonator ont également repris sur Instagram les résultats des sondages publiés sur Twitter en réponse aux tweets de personnalités publiques (figure 6).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/iraninfoops\/Picture6.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;6\u0026nbsp;: Le pseudo @CavenessJim publie un sondage sur Twitter (à gauche). Le pseudo @ryanjensen7722 reprend sur Instagram une vidéo montrant les résultats du sondage de @CavenessJim\u0027s sur Twitter (à droite)\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EDes vidéos d\u0027interviews de personnalités américaines, britanniques et israéliennes publiées sur \u003Ci\u003ETehran Times\u003C\/i\u003E\u003C\/h4\u003E\n\u003Cp\u003EDans le prolongement de ce que nous observions déjà en mai 2019, des pseudos associés à Distinguished Impersonator ont récemment mis sur leurs comptes Facebook, Instagram et Twitter des vidéos d\u0027interviews donnant la parole à des personnalités américaines, britanniques et israéliennes (universitaires, politiciens, activistes, etc.) dont les opinions vont dans le sens des intérêts du régime des mollahs (figure 7). S\u0027il nous a été jusqu\u0027à présent impossible de déterminer la provenance de ces entretiens, il s\u0027avère que, contrairement à ce que nous avions pu observer en 2019, les auteurs de ces posts récents ne prétendent pas avoir mené eux-mêmes les entretiens qu\u0027ils mettent en avant sur les réseaux sociaux. Les vidéos exposent les points de vue des personnes interrogées sur des sujets aussi variés que la politique moyen-orientale des États-Unis ou les relations de Washington avec ses alliés. Fait intéressant, certaines de ces vidéos ont été reprises sur le site web du journal de langue anglaise \u003Ci\u003ETehran Times\u003C\/i\u003E après, mais parfois même avant leur publication sur les réseaux sociaux. \u003Ci\u003E\u003C\/i\u003ELe quotidien d\u0027État iranien a également publié des vidéos de ce qui semble être différentes séquences des mêmes interviews mises en ligne par des acteurs de Distinguished Impersonator. Pour mémoire, \u003Ci\u003ETehran Times\u003C\/i\u003E appartient à l\u0027Organisation de la propagation islamique, une entité qui relève de l\u0027autorité directe du Guide suprême de la Révolution islamique Ali Khamenei.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/iraninfoops\/Picture7.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 7\u0026nbsp;: Interviews vidéo d\u0027un activiste et d\u0027une universitaire, publiées sur les comptes Facebook et Instagram d\u0027individus associés à Distinguished Impersonator\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EConclusion\u003C\/h4\u003E\n\u003Cp\u003ELes activités que nous décrivons dans cet article ne sont pas nouvelles en soi. Elles s\u0027inscrivent dans la continuité d\u0027une opération que nous surveillons depuis l\u0027an passé et qui vise très probablement à promouvoir les intérêts politiques de l\u0027Iran. Ce type d\u0027activité illustre bien la manière dont ses acteurs se renouvellent en permanence pour détourner les commentaires politiques de personnalités reconnues au profit de Téhéran. Les impostures de pseudo-journalistes et l\u0027exploitation d\u0027interviews politiques de personnalités importantes fournissent également de nouveaux exemples de ce que nous appelons en interne \u0026quot;Media-IO nexus\u0026quot;. Cette technique malveillante a pour objectif de manipuler l\u0027opinion publique en s\u0027appuyant sur un environnement médiatique légitime, que ce soit par le biais de la mise en ligne de \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2018\/08\/suspected-iranian-influence-operation.html\u0022\u003Efaux sites d\u0027informations plus vrais que nature\u003C\/a\u003E, le \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/05\/social-media-network-impersonates-us-political-candidates-supports-iranian-interests.html\u0022\u003Edétournement de médias légitimes pour promouvoir des idées partisanes\u003C\/a\u003E, des campagnes de désinformation reposant sur la défiguration des sites web de certains médias, l\u0027usurpation des sites d\u0027information légitimes ou, comme dans le cas présent, la sollicitation de commentaires orientés de personnalités publiques par des pseudos factices ou de faux journalistes.\u003C\/p\u003E\n",
        "jcr:lastModified": "Thu Apr 09 2020 22:09:16 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EDétails d\u0027une opération de longue haleine soupçonnée de promouvoir les intérêts politiques de l\u0027Iran.\u003C\/p\u003E\n",
      "jcr:lastModified": "Wed Feb 12 2020 06:39:09 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
      "jcr:lastModified": "Thu Apr 09 2020 22:09:31 GMT+0000",
      "imageRotate": "0"
    }
  }
}
