{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed Jan 09 2019 22:50:09 GMT-0500",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Global DNS Hijacking Campaign: DNS Record Manipulation at Scale",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "b3bce85e-aac5-4d39-8d7c-99e1d342d022",
    "author": "Muks Hirani",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "adam.greenberg@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "fbda8693-7722-4bd9-b0c5-da593d0118c2"
    ],
    "jcr:created": "Thu Jan 10 2019 14:52:59 GMT-0500",
    "cq:lastReplicated": "Thu Jan 10 2019 14:52:58 GMT-0500",
    "cq:lastModified": "Thu Jan 10 2019 14:52:45 GMT-0500",
    "jcr:baseVersion": "fbda8693-7722-4bd9-b0c5-da593d0118c2",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:muks-hirani",
      "fireeye-blog-authors:sarah-jones",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:dns",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:iran",
      "fireeye-blog-tags:latest",
      "fireeye-blog-authors:ben-read"
    ],
    "jcr:uuid": "44f6ca89-edfd-4868-982f-17d36f4900e2",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Wed Jan 09 2019 22:45:00 GMT-0500",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Ch4\u003EIntroduction\u003C\/h4\u003E\n\u003Cp\u003EFireEye’s Mandiant Incident Response and Intelligence teams have identified a wave of DNS hijacking that has affected dozens of domains belonging to government, telecommunications and internet infrastructure entities across the Middle East and North Africa, Europe and North America.\u0026nbsp;While we do not currently link this activity to any tracked group, initial research suggests the actor or actors responsible have a nexus to Iran. This campaign has targeted victims across the globe on an almost unprecedented scale, with a high degree of success. We have been tracking this activity for several months, mapping and understanding the innovative tactics, techniques and procedures (TTPs) deployed by the attacker. We have also worked closely with victims, security organizations, and law enforcement agencies where possible to reduce the impact of the attacks and\/or prevent further compromises.\u003C\/p\u003E\n\u003Cp\u003EWhile this campaign employs some traditional tactics, it is differentiated from other Iranian activity we have seen by leveraging DNS hijacking at scale. The attacker uses this technique for their initial foothold, which can then be exploited in a variety of ways. In this blog post, we detail the three different ways we have seen DNS records be manipulated to enable victim compromises.\u0026nbsp;Technique 1, involving the creation of a Let\u0027s Encrypt certificate and changing the A record, was \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/blog.talosintelligence.com\/2018\/11\/dnspionage-campaign-targets-middle-east.html\u0022\u003Epreviously documented by Cisco’s TALOS team\u003C\/a\u003E. The activity described in their blog post is a subset of the activity we have observed.\u003C\/p\u003E\n\u003Ch4\u003EInitial Research Suggests Iranian Sponsorship\u003C\/h4\u003E\n\u003Cp\u003EAttribution analysis for this activity is ongoing. While the DNS record manipulations described in this post are noteworthy and sophisticated, they may not be exclusive to a single threat actor as the activity spans disparate timeframes, infrastructure, and service providers.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EMultiple clusters of this activity have been active from January 2017 to January 2019.\u003C\/li\u003E\n\u003Cli\u003EThere are multiple, nonoverlapping clusters of actor-controlled domains and IPs used in this activity.\u003C\/li\u003E\n\u003Cli\u003EA wide range of providers were chosen for encryption certificates and VPS hosts.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EPreliminary technical evidence allows us to assess with moderate confidence that this activity is conducted by persons based in Iran and that the activity aligns with Iranian government interests.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EFireEye Intelligence identified access from Iranian IPs to machines used to intercept, record and forward network traffic. While geolocation of an IP address is a weak indicator, these IP addresses were previously observed during the response to an intrusion attributed to Iranian cyber espionage actors.\u003C\/li\u003E\n\u003Cli\u003EThe entities targeted by this group include Middle Eastern governments whose confidential information would be of interest to the Iranian government and have relatively little financial value.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EDetails\u003C\/h4\u003E\n\u003Cp\u003E\u003Ci\u003EThe following examples use victim[.]com to stand in for the victim domain, and private IP addresses to stand in for the actor controlled IP addresses.\u003C\/i\u003E\u003C\/p\u003E\n\u003Ch5\u003ETechnique 1 – DNS A Records\u003C\/h5\u003E\n\u003Cp\u003EThe first method exploited by the attacker is altering DNS A Records, as seen in Figure 1.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/DNSjacking\/Figure1b.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: DNS A Record\u003C\/span\u003E\u003C\/p\u003E\n\u003Col style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EThe attacker logs into \u003Cspan class=\u0022code\u0022\u003EPXY1\u003C\/span\u003E, a Proxy box used to conduct non-attributed browsing and as a jumpbox to other infrastructure.\u003C\/li\u003E\n\u003Cli\u003EThe attacker logs into the DNS provider’s administration panel, utilising previously compromised credentials.\u003C\/li\u003E\n\u003Cli\u003EThe A record (e.g. \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E) is currently pointing to \u003Cspan class=\u0022code\u0022\u003E192.168.100.100\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003EThe attacker changes the A record and points it to \u003Cspan class=\u0022code\u0022\u003E10.20.30.40 (OP1)\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003EThe attacker logs in from \u003Cspan class=\u0022code\u0022\u003EPXY1\u003C\/span\u003E to \u003Cspan class=\u0022code\u0022\u003EOP1\u003C\/span\u003E.\u003Cul\u003E\n\u003Cli\u003EA proxy is implemented to listen on all open ports, mirroring \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003EA load balancer points to \u003Cspan class=\u0022code\u0022\u003E192.168.100.100 [mail[.]victim[.]com]\u003C\/span\u003E to pass through user traffic.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003Ecertbot is used to create a Let’s Encrypt certificate for \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E\u003Cul\u003E\n\u003Cli\u003EWe have observed multiple Domain Control Validation providers being utilised as part of this campaign.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EA user now visits \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E and is directed to OP1. The\u0026nbsp;Let’s Encrypt certificate allows the browsers to establish a connection without any certificate errors as \u003Cspan class=\u0022code\u0022\u003ELet\u0027s Encrypt Authority X3\u003C\/span\u003E is trusted. The connection is forwarded to the load balancer which establishes the connection with the real \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E. The user is not aware of any changes and may only notice a slight delay.\u003C\/li\u003E\n\u003Cli\u003EThe username, password and domain credentials are harvested and stored.\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Ch5\u003ETechnique 2 – DNS NS Records\u003C\/h5\u003E\n\u003Cp\u003EThe second method exploited by the attacker involved altering DNS NS Records, as seen in Figure 2.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/DNSjacking\/Figure2.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: DNS NS Record\u003C\/span\u003E\u003C\/p\u003E\n\u003Col style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EThe attacker again logs into \u003Cspan class=\u0022code\u0022\u003EPXY1\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003EThis time, however, the attacker exploits a previously compromised registrar or ccTLD.\u003C\/li\u003E\n\u003Cli\u003EThe nameserver record \u003Cspan class=\u0022code\u0022\u003Ens1[.]victim[.]com\u003C\/span\u003E is currently set to \u003Cspan class=\u0022code\u0022\u003E192.168.100.200\u003C\/span\u003E. The attacker changes the NS record and points it to \u003Cspan class=\u0022code\u0022\u003Ens1[.]baddomain[.]com [10.1.2.3]\u003C\/span\u003E. That nameserver will respond with the IP \u003Cspan class=\u0022code\u0022\u003E10.20.30.40 (OP1)\u003C\/span\u003E\u0026nbsp;when \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E is requested, but with the original IP \u003Cspan class=\u0022code\u0022\u003E192.168.100.100\u003C\/span\u003E if it is www[.]victim[.]com.\u003C\/li\u003E\n\u003Cli\u003EThe attacker logs in from \u003Cspan class=\u0022code\u0022\u003EPXY1\u003C\/span\u003E to \u003Cspan class=\u0022code\u0022\u003EOP1\u003C\/span\u003E.\u003Cul\u003E\n\u003Cli\u003EA proxy is implemented to listen on all open ports, mirroring \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003EA load balancer points to \u003Cspan class=\u0022code\u0022\u003E192.168.100.100 [mail[.]victim[.]com]\u003C\/span\u003E to pass through user traffic.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003Ecertbot is used to create a Let’s Encrypt certificate for \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E.\u003Cul\u003E\n\u003Cli\u003EWe have observed multiple Domain Control Validation providers being utilised during this campaign.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EA user visits \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E and is directed to \u003Cspan class=\u0022code\u0022\u003EOP1\u003C\/span\u003E. The Let’s Encrypt certificate allows browsers to establish a connection without any certificate errors as \u003Cspan class=\u0022code\u0022\u003ELet\u0027s Encrypt Authority X3\u003C\/span\u003E is trusted. The connection is forwarded to the load balancer which establishes the connection with the real \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E. The user is not aware of any changes and may only notice a slight delay.\u003C\/li\u003E\n\u003Cli\u003EThe username, password and domain credentials are harvested and stored.\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Ch5\u003ETechnique 3 – DNS Redirector\u003C\/h5\u003E\n\u003Cp\u003EThe attacker has also been observed using a third technique in conjunction with either Figure 1 or Figure 2 above. This involves a DNS Redirector, as seen in Figure 3.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/DNSjacking\/Figure3.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: DNS Operational box\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DNS Redirector is an attacker operations box which responds to DNS requests.\u003C\/p\u003E\n\u003Col style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EA DNS request for \u003Cspan class=\u0022code\u0022\u003Email[.]victim[.]com\u003C\/span\u003E is sent to \u003Cspan class=\u0022code\u0022\u003EOP2\u003C\/span\u003E (based on previously altered A Record or NS Record).\u003C\/li\u003E\n\u003Cli\u003EIf the domain is part of victim[.]com zone, \u003Cspan class=\u0022code\u0022\u003EOP2\u003C\/span\u003E responds with an attacker-controlled IP address, and the user is re-directed to the attacker-controlled infrastructure.\u003C\/li\u003E\n\u003Cli\u003EIf the domain is not part of the victim.com zone (e.g. google[.]com), \u003Cspan class=\u0022code\u0022\u003EOP2\u003C\/span\u003E makes a DNS request to a legitimate DNS to get the IP address and the legitimate IP address is returned to the user.\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Ch4\u003ETargets\u003C\/h4\u003E\n\u003Cp\u003EA large number of organizations have been affected by this pattern of DNS record manipulation and fraudulent SSL certificates. They include telecoms and ISP providers, internet infrastructure providers, government and sensitive commercial entities.\u003C\/p\u003E\n\u003Ch4\u003ERoot Cause Still Under Investigation\u003C\/h4\u003E\n\u003Cp\u003EIt is difficult to identify a single intrusion vector for each record change, and it is possible that the actor, or actors are using multiple techniques to gain an initial foothold into each of the targets described above. FireEye intelligence customers have received previous reports describing sophisticated phishing attacks used by one actor that also conducts DNS record manipulation. Additionally, while the precise mechanism by which the DNS records were changed is unknown, we believe that at least some records were changed by compromising a victim’s domain registrar account.\u003C\/p\u003E\n\u003Ch4\u003EPrevention Tactics\u003C\/h4\u003E\n\u003Cp\u003EThis type of attack is difficult to defend against, because valuable information can be stolen, even if an attacker is never able to get direct access to your organization’s network. Some steps to harden your organization include:\u003C\/p\u003E\n\u003Col style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EImplement multi-factor authentication on your domain’s administration portal.\u003C\/li\u003E\n\u003Cli\u003EValidate A and NS record changes.\u003C\/li\u003E\n\u003Cli\u003ESearch for SSL certificates related to your domain and revoke any malicious certificates.\u003C\/li\u003E\n\u003Cli\u003EValidate the source IPs in OWA\/Exchange logs.\u003C\/li\u003E\n\u003Cli\u003EConduct an internal investigation to assess if attackers gained access to your environment.\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Ch4\u003EConclusion\u003C\/h4\u003E\n\u003Cp\u003EThis DNS hijacking, and the scale at which it has been exploited, showcases the continuing evolution in tactics from Iran-based actors. This is an overview of one set of TTPs that we recently observed affecting multiple entities. We are highlighting it now so that potential targets can take appropriate defensive action.\u003C\/p\u003E\n",
        "jcr:lastModified": "Thu Jan 10 2019 14:52:45 GMT-0500",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe detail three different ways we have seen DNS records be manipulated to enable victim compromises.\u003C\/p\u003E\n",
      "jcr:lastModified": "Wed Jan 09 2019 18:14:18 GMT-0500",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Wed Jan 09 2019 22:44:21 GMT-0500",
      "imageRotate": "0"
    }
  }
}
