{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Mon Apr 20 2020 12:01:45 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "Separating the Signal from the Noise: How Mandiant Intelligence Rates Vulnerabilities — Intelligence for Vulnerability Management, Part Three",
    "jcr:versionHistory": "89401ec0-6d54-44c7-b2e5-2e18c21f2d5f",
    "author": "Cameron Sabel",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "e9e61787-c015-4375-bcb4-c32fa3676cb0"
    ],
    "jcr:created": "Tue Apr 21 2020 14:58:29 GMT+0000",
    "cq:lastModified": "Tue Apr 21 2020 14:56:55 GMT+0000",
    "jcr:baseVersion": "e9e61787-c015-4375-bcb4-c32fa3676cb0",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:cameron-sabel",
      "fireeye-blog-authors:jared-semrau",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:mandiant",
      "fireeye-blog-tags:threat-intelligence"
    ],
    "jcr:uuid": "72742e57-694b-44d5-956f-1415b6a3db39",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Apr 20 2020 08:00:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003E\u003Ci\u003EOne of the critical strategic and tactical roles that cyber threat intelligence (CTI) plays is in the tracking, analysis, and prioritization of software vulnerabilities that could potentially put an organization’s data, employees and customers at risk. In this four-part blog series, FireEye Mandiant Threat Intelligence highlights the value of CTI in enabling vulnerability management, and unveils new research into the latest threats, trends and recommendations.\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EEvery information security practitioner knows that patching vulnerabilities is one of the first steps towards a healthy and well-maintained organization. But with thousands of vulnerabilities disclosed each year and media hype about the newest “branded” vulnerability on the news, it’s hard to know where to start.\u003C\/p\u003E\n\u003Cp\u003EThe National Vulnerability Database (NVD) considers a range of factors that are fed into an automated process to arrive at a \u003Ca href=\u0022https:\/\/nvd.nist.gov\/vuln-metrics\/cvss\/v3-calculator\u0022\u003Escore\u003C\/a\u003E for CVSSv3. Mandiant Threat Intelligence takes a different approach, drawing on the insight and experience of our analysts (Figure 1). This human input allows for qualitative factors to be taken into consideration, which gives additional focus to what matters to security operations.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/mandiantvulns\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: How Mandiant Rates Vulnerabilities\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EAssisting Patch Prioritization\u003C\/h4\u003E\n\u003Cp\u003EWe believe our approach results in a score that is more useful for determining patching priorities, as it allows for the adjustment of ratings based on factors that are difficult to quantify using automated means. It also significantly reduces the number of vulnerabilities rated ‘high’ and ‘critical’ compared to CVSSv3 (Figure 2). We consider critical vulnerabilities to pose significant security risks and strongly suggest that remediation steps are taken to address them as soon as possible. We also believe that limiting ‘critical’ and ‘high’ designations helps security teams to effectively focus attention on the most dangerous vulnerabilities. For instance, from 2016-2019 Mandiant only rated two vulnerabilities as critical, while NVD assigned 3,651 vulnerabilities a ‘critical’ rating (Figure 3).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/mandiantvulns\/Picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Criticality of US National Vulnerability Database (NVD) CVSSv3 ratings 2016-2019 compared to Mandiant vulnerability ratings for the same vulnerabilities\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/mandiantvulns\/Picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Numbers of ratings at various criticality tiers from NVD CVSSv3 scores compared to Mandiant ratings for the same vulnerabilities\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EMandiant Vulnerability Ratings Defined\u003C\/h4\u003E\n\u003Cp\u003EOur rating system includes both an exploitation rating and a risk rating:\u003C\/p\u003E\n\u003Cp\u003EThe \u003Ci\u003EExploitation Rating\u003C\/i\u003E is an in indication of what is occurring in the wild.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/mandiantvulns\/Picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: Mandiant Exploitation Rating definitions\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe\u003Ci\u003E Risk Rating\u003C\/i\u003E is our expert assessment of what impact an attacker could have on a targeted organization, if they were to exploit a vulnerability.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/mandiantvulns\/Picture5.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: Mandiant Risk Rating definitions\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWe intentionally use the critical rating sparingly, typically in cases where exploitation has serious impact, exploitation is trivial with often no real mitigating factors, and the attack surface is large and remotely accessible. When Mandiant uses the critical rating, it is an indication that remediation should be a top priority for an organization due to the potential impacts and ease of exploitation.\u003C\/p\u003E\n\u003Cp\u003EFor example, Mandiant Threat Intelligence rated CVE-2019-19781 as critical due to the confluence of widespread exploitation—including by APT41—the public release of proof-of-concept (PoC) code that facilitated automated exploitation, the potentially acute outcomes of exploitation, and the ubiquity of the software in enterprise environments.\u003C\/p\u003E\n\u003Cp\u003ECVE-2019-19781 is a path traversal vulnerability of the Citrix Application Delivery Controller (ADC) 13.0 that when exploited, allows an attacker to remotely execute arbitrary code. Due to the nature of these systems, successful exploitation could lead to further compromises of a victim\u0027s network through lateral movement or the discovery of Active Directory (AD) and\/or LDAP credentials. Though these credentials are often stored in hashes, they have been proven to be vulnerable to password cracking. Depending on the environment, the potential second order effects of exploitation of this vulnerability could be severe.\u003C\/p\u003E\n\u003Cp\u003EWe described widespread exploitation of CVE-2019-19781 in our \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/products-and-services\/2020\/01\/rough-patch-promise-it-will-be-200-ok.html\u0022\u003Eblog post\u003C\/a\u003E\u0026nbsp;earlier this year, including a timeline from disclosure on Dec. 17, 2019, to the patch releases, which began a little over a month later on Jan. 20, 2020. Significantly, within hours of the release of PoC code on Jan. 10, 2020, we detected reconnaissance for this vulnerability in FireEye telemetry data. Within days, we observed weaponized exploits used to gain footholds in victim environments. On the same day the first patches were released, Jan. 20, 2020, we \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2020\/03\/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html\u0022\u003Eobserved\u003C\/a\u003E APT41, one of the most prolific Chinese groups we track, kick off an expansive campaign exploiting CVE-2019-19781 and other vulnerabilities against numerous targets.\u003C\/p\u003E\n\u003Ch4\u003EFactors Considered in Ratings\u003C\/h4\u003E\n\u003Cp\u003EOur vulnerability analysts consider a wide variety of impact-intensifying and mitigating factors when rating a vulnerability. Factors such as actor interest, availability of exploit or PoC code, or exploitation in the wild can inform our analysis, but are not primary elements in rating.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EImpact considerations\u003C\/i\u003E help determine what impact exploitation of the vulnerability can have on a targeted system.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EImpact Type\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022486\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EImpact Consideration\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EExploitation Consequence\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022486\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EThe result of successful exploitation, such as privilege escalation or remote code execution\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EConfidentiality Impact\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022486\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EThe extent to which exploitation can compromise the confidentiality of data on the impacted system\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EIntegrity Impact\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022486\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EThe extent to which exploitation allows attackers to alter information in impacted systems\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAvailability Impact\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022486\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EThe extent to which exploitation disrupts or restricts access to data or systems\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Ci\u003EMitigating factors\u003C\/i\u003E affect an attacker’s likelihood of successful exploitation.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMitigating Factor\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMitigating Consideration\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EExploitation Vector\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EWhat methods can be used to exploit the vulnerability?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAttacking Ease\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHow difficult is the exploit to use in practice?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EExploit Reliability\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHow consistently can the exploit execute and perform the intended malicious activity?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAccess Vector\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EWhat type of access (i.e. local, adjacent network, or network) is required to successfully exploit the vulnerability?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAccess Complexity\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHow difficult is it to gain access needed for the vulnerability?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAuthentication Requirements\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EDoes the exploitation require authentication and, if so, what type of authentication?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EVulnerable Product Ubiquity\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHow commonly is the vulnerable product used in enterprise environments?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EProduct\u0027s Targeting Value\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHow attractive is the vulnerable software product or device to threat actors to target?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022144\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EVulnerable Configurations\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022480\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EDoes exploitation require specific configurations, either default or non-standard?\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EMandiant Vulnerability Rating System Applied\u003C\/h4\u003E\n\u003Cp\u003EThe following are examples of cases in which Mandiant Threat Intelligence rated vulnerabilities differently than NVD by considering additional factors and incorporating information that either was not reported to NVD or is not easily quantified in an algorithm.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022102\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EVulnerability\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EVulnerability Description\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002266\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ENVD Rating\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002272\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMandiant Rating\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022246\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EExplanation\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022102\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECVE-2019-12650\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EA command injection vulnerability in the\u0026nbsp;Web UI component of\u0026nbsp;Cisco IOS XE versions 16.11.1 and earlier that, when exploited, allows a privileged attacker to remotely execute arbitrary commands with root privileges\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002266\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHigh\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002272\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELow\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022246\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EThis vulnerability was rated high by NVD, but Mandiant Threat Intelligence rated it as low risk because it requires the highest level of privileges – level 15 admin privileges – to exploit. Because this level of access should be quite limited in enterprise environments, we believe that it is unlikely attackers would be able to leverage this vulnerability as easily as others. There is no known exploitation of this activity.\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022102\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECVE-2019-5786\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022138\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EA use after free vulnerability within the FileReader component in Google Chrome 72.0.3626.119 and prior that, when exploited, allows an attacker to remotely execute arbitrary code.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E\u0026nbsp;\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002266\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002272\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHigh\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022246\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENVD rated CVE-2019-5786 as medium, while Mandiant Threat Intelligence rated it as high risk. The difference in ratings is likely due to NVD describing the consequences of exploitation as denial of service, while we know of exploitation in the wild which results in remote code execution in the context of the renderer, which is a more serious outcome.\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EAs demonstrated, factors such as the assessed ease of exploitation and the observance of exploitation in the wild may result a different priority rating than the one issued by NVD. In the case of CVE-2019-12650, we ultimately rated this vulnerability lower than NVD due to the required privileges needed to execute the vulnerability as well as the lack of observed exploitation. On the other hand, we rated the CVE-2019-5786 as high risk due to the assessed severity, ubiquity of the software, and confirmed exploitation.\u003C\/p\u003E\n\u003Cp\u003EIn early 2019,\u0026nbsp;Google \u003Ca href=\u0022https:\/\/security.googleblog.com\/2019\/03\/disclosing-vulnerabilities-to-protect.html\u0022\u003Ereported\u003C\/a\u003E two zero-day vulnerabilities were being used together in the wild: CVE-2019-5786 (Chrome zero-day vulnerability) and CVE-2019-0808 (a Microsoft privilege escalation vulnerability). Google quickly released a patch for the Chrome vulnerability pushed it to users through Chrome’s auto-update feature on March 1. CVE-2019-5786 is significant because it can impact all major operating systems, Windows, Mac OS, and Linux, and requires only minimal user interaction, such as navigating or following a link to a website hosting exploit code, to achieve remote code execution. The severity is further compounded by a public \u003Ca href=\u0022https:\/\/blog.exodusintel.com\/2019\/03\/20\/cve-2019-5786-analysis-and-exploitation\/\u0022\u003Eblog post\u003C\/a\u003E\u0026nbsp;and proof of concept exploit code that was released a few weeks later and subsequently incorporated into a Metasploit module.\u003C\/p\u003E\n\u003Ch4\u003EThe Future of Vulnerability Analysis Requires Algorithms \u003Ci\u003Eand\u003C\/i\u003E Human Intelligence\u003C\/h4\u003E\n\u003Cp\u003EWe expect that the volume of vulnerabilities to continue to increase in coming years, emphasizing the need for a rating system that accurately identifies the most significant vulnerabilities and provides enough nuance to allow security teams to tackle patching in a focused manner. As the quantity of vulnerabilities grows, incorporating assessments of malicious actor use, that is, observed exploitation as well as the feasibility and relative ease of using a particular vulnerability, will become an even more important factor in making meaningful prioritization decisions.\u003C\/p\u003E\n\u003Cp\u003EMandiant Threat Intelligence believes that the future of vulnerability analysis will involve a combination of machine (structured or algorithmic) and human analysis to assess the potential impact of a vulnerability and the true threat that it poses to organizations. Use of structured algorithmic techniques, which are common in many models, allows for consistent and transparent rating levels, while the addition of human analysis allows experts to integrate factors that are difficult to quantify, and adjust ratings based on real-world experience regarding the actual risk posed by various types of vulnerabilities.\u003C\/p\u003E\n\u003Cp\u003EHuman curation and enhancement layered on top of automated rating will provide the best of both worlds: speed and accuracy. We strongly believe that paring down alerts and patch information to a manageable number, as well as clearly communicating risk levels with Mandiant vulnerability ratings makes our system a powerful tool to equip network defenders to quickly and confidently take action against the highest priority issues first.\u003C\/p\u003E\n\u003Cp\u003ERegister today\u0026nbsp;to hear FireEye Mandiant Threat Intelligence experts discuss the latest in\u0026nbsp;\u003Ca href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/392772\u0022\u003Evulnerability threats, trends and recommendations\u003C\/a\u003E\u0026nbsp;in our upcoming April 30 webinar.\u003C\/p\u003E\n",
        "jcr:lastModified": "Tue Apr 21 2020 14:56:55 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EMandiant Threat Intelligence rates vulnerabilities based on the insight and experience of our analysts.\u003C\/p\u003E\n",
      "jcr:lastModified": "Sun Apr 19 2020 22:47:21 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Sun Apr 19 2020 23:00:48 GMT+0000",
      "imageRotate": "0"
    }
  }
}
