{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Thu Apr 26 2018 12:21:40 GMT-0400",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Establishing a Baseline for Remote Desktop Protocol ",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "0e41a081-d128-4546-8a47-f4aa87a59a63",
    "author": "David Pany",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "adam.greenberg@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "894d099f-bbc9-464d-8cb5-eee2f3d49aed"
    ],
    "jcr:created": "Thu Apr 26 2018 12:21:40 GMT-0400",
    "cq:lastReplicated": "Thu Apr 26 2018 12:21:35 GMT-0400",
    "cq:lastModified": "Thu Apr 26 2018 12:20:31 GMT-0400",
    "jcr:baseVersion": "894d099f-bbc9-464d-8cb5-eee2f3d49aed",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:cap-david-pany",
      "fireeye-blog-authors:matthew-mcwhirt",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:rdp"
    ],
    "jcr:uuid": "8ee50144-41ff-4c9e-81c6-8b55e5da35d8",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Apr 26 2018 12:15:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EFor IT staff and Windows power users, Microsoft Terminal Services Remote Desktop Protocol (RDP) is a beneficial tool that allows for the \u003Ca href=\u0022https:\/\/technet.microsoft.com\/en-us\/library\/cc780332(v=ws.10).aspx\u0022\u003Einteractive\u003C\/a\u003E use or administration of a remote Windows system. However, Mandiant consultants have also observed threat actors using RDP, with compromised domain credentials, to move laterally across networks with limited segmentation.\u003C\/p\u003E\n\u003Cp\u003ETo understand how threat actors take advantage of RDP, consider the following example (and Figure 1):\u003C\/p\u003E\n\u003Col style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EA staff member from the HR department working on his or her desktop inadvertently installs a malicious backdoor by interacting with a phishing email.\u003C\/li\u003E\n\u003Cli\u003EThe backdoor malware runs password stealing functionality from \u003Ca href=\u0022https:\/\/github.com\/gentilkiwi\/mimikatz\u0022\u003EMimikatz\u003C\/a\u003E to obtain credentials stored in memory for any user accounts that have accessed the system.\u003C\/li\u003E\n\u003Cli\u003EThe backdoor creates a network tunnel to an attacker’s command and control (C2) server.\u003C\/li\u003E\n\u003Cli\u003EThe attacker logs on to the HR employee’s system with RDP through the network tunnel by using the compromised credentials.\u003C\/li\u003E\n\u003Cli\u003EIn pursuit of compromising financial information, the attacker uses Active Directory enumeration commands to identify domain-based systems used by the finance department.\u003C\/li\u003E\n\u003Cli\u003EThe attacker uses RDP and the compromised HR employee account to connect to a system in the finance department.\u003C\/li\u003E\n\u003Cli\u003EThe attacker uses Mimikatz to extract credentials on the finance system, resulting in access to\u0026nbsp; cached passwords for the finance employee who uses the system and an IT administrator who recently logged onto the system for troubleshooting.\u003C\/li\u003E\n\u003Cli\u003EUsing RDP, the attacker leverages the HR employee’s account, the finance employee’s account, and the IT administrator employee’s account to log onto additional systems in the environment.\u003C\/li\u003E\n\u003Cli\u003EThe attacker stages data onto the HR employee’s system.\u003C\/li\u003E\n\u003Cli\u003EThe attacker steals the files via the built-in RDP copy and paste functionality.\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/RDP\/Fig1.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Example of a compromise that uses RDP for lateral movement\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EA best practice used to identify this type of activity is network baselining. To do this, an organization must first understand what is normal behavior for their specific environment, and then begin to configure detections based on unexpected patterns. Sample questions that can help determine practical detection techniques based on the aforementioned scenario include:\u003C\/p\u003E\n\u003Col style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EDo our HR and\/or finance employees typically use RDP?\u003C\/li\u003E\n\u003Cli\u003EDo any of our HR employees RDP to a destination system in finance?\u003C\/li\u003E\n\u003Cli\u003EDo any of our HR and\/or finance employees RDP to multiple destination systems?\u003C\/li\u003E\n\u003Cli\u003EAre the systems in our HR and\/or finance departments used as source systems for RDP?\u003C\/li\u003E\n\u003Cli\u003EDo our IT administrator accounts RDP from a source system that is not part of an IT network segment?\u003C\/li\u003E\n\u003Cli\u003EDo any of our critical servers have logons from source systems that are not part of an IT network segment?\u003C\/li\u003E\n\u003Cli\u003EDo any of our critical servers have RDP logons sourced from user accounts that are correlated to any of our HR and\/or finance personnel?\u003C\/li\u003E\n\u003Cli\u003EIs it expected for a single user account to initiate RDP connections from multiple source systems?\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003EWhile it can take time to develop a customized process to baseline the scope of user accounts, source systems – and destination systems that leverage RDP in your organization’s environment – normalizing and reviewing this data will empower your staff with a deeper understanding of user account behavior, and the ability to detect unexpected activity to quickly begin investigating and triaging.\u003C\/p\u003E\n\u003Ch4\u003ETracking RDP through Event Logs\u003C\/h4\u003E\n\u003Cp\u003EOne first step and important resource for identifying your network’s typical behavior is through the use of event logs. RDP logons can generate file, event log, and registry artifacts on both the source and destination systems involved. Page 42 of JPCERT’s reference, “\u003Ca href=\u0022https:\/\/www.jpcert.or.jp\/english\/pub\/sr\/20170612ac-ir_research_en.pdf\u0022\u003EDetecting Lateral Movement through Tracking Event Logs\u003C\/a\u003E,” details many artifacts that investigators may find on source and destination systems.\u003C\/p\u003E\n\u003Cp\u003EFor the purpose of scalability, our baselining approach will focus on three high-fidelity logon events recorded on a destination system:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/technet.microsoft.com\/en-us\/library\/ee891131(ws.10).aspx\u0022\u003EEID 21\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/technet.microsoft.com\/en-us\/library\/ee891126(ws.10).aspx\u0022\u003EEID 25\u003C\/a\u003E within the “TerminalServices-LocalSessionManager” log, commonly located at “%systemroot%\\Windows\\System32\\winevt\\Logs\\Microsoft-TerminalServices-LocalSessionmanager%3Operational.evtx”\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/docs.microsoft.com\/en-us\/windows\/security\/threat-protection\/auditing\/event-4624\u0022\u003EEID 4624\u003C\/a\u003E entries of Type 10 logons within the “Security” log, commonly located at “%systemroot%\\Windows\\System32\\winevt\\Logs\\Security.evtx”\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe EID 21 entry shown in Figure 2 is created on a destination system when a successful interactive local or remote logon event occurs.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/RDP\/Fig2.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: EID 21 Example Structure\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe EID 25 entry shown in Figure 3 is created on a destination system that has been reconnected from a system that previously established an RDP session that was not terminated through a proper user logout. For example, closing the RDP window (which would generate \u003Ca href=\u0022https:\/\/technet.microsoft.com\/en-us\/library\/ee907330(ws.10).aspx\u0022\u003EEID 24\u003C\/a\u003E), as opposed to logging off through the start menu (which would generate \u003Ca href=\u0022https:\/\/technet.microsoft.com\/en-us\/library\/ee907364(ws.10).aspx\u0022\u003EEID 23\u003C\/a\u003E).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/RDP\/Fig3.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: EID 25 Example Structure\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe EID 4624 entry is created on a destination system when a logon of any type occurs. For evidence of RDP authentication, we will focus on EID 4624 entries with with Logon Type 10 as shown in Figure 4, which correspond to RDP authentications.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/RDP\/Fig4.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: Type 10 EID 4624 Example Structure\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThese event log entries provide evidence of a successful RDP authentication from one system to another. For most security teams to collect this event log data, the logs must either be forwarded to an aggregation platform, such as a security information and event management (SIEM) platform, or collected using a forensic acquisition utility such as \u003Ca href=\u0022https:\/\/www.fireeye.com\/products\/hx-endpoint-security-products.html\u0022\u003EFireEye’s Endpoint Security (HX) appliance\u003C\/a\u003E. Once extracted, the data must be processed and stacked for frequency analysis. The scope of this post is to generate metrics based on unique user accounts, source systems, and destination systems.\u003C\/p\u003E\n\u003Cp\u003EFor both EID 21 and EID 25, the user account and source system are captured in the event log strings, while the destination system is the system that recorded the event. Note that the “Source Network Address” recorded within the log may be either a hostname or an IP address. Your data processor may benefit from mapping IP addresses and hostnames together, while keeping Dynamic Host Configuration Protocol (DHCP) leases in mind. Understanding which systems correlate to specific user accounts or business units will greatly benefit the analysis of the processed results. If your organization does not track this information, you should request for this documentation to be created or captured within an asset management database for automated correlation.\u003C\/p\u003E\n\u003Ch4\u003EIdentifying Inconsistencies\u003C\/h4\u003E\n\u003Cp\u003EOnce RDP activity is baselined across your environment via the analysis of event logs, security analysts can then begin to identify RDP activity that deviates from business requirements and normalized patterns. Keep in mind that distinguishing between legitimate and anomalous RDP activity may take time.\u003C\/p\u003E\n\u003Cp\u003ENot only will DHCP logs prove useful when mapping IP address to hostnames, but documentation that associates systems and user accounts with specific business units can also help with reviewing and correlating observed RDP activity for suspicious or benign behavior. Any RDP activity inconsistent with expected business practices should be investigated. Additionally, RDP logons confirmed as benign should be noted in the baseline for future investigators.\u003C\/p\u003E\n\u003Ch4\u003ELeveraging Metrics\u003C\/h4\u003E\n\u003Cp\u003EBy using SIEM correlation techniques, analysts can stack RDP activity by account, source system, and destination system, to pinpoint the number\/count of the following metrics-related elements, which will deepen the security staff’s understanding of RDP activity in your network:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003Esource systems per user account\u003C\/li\u003E\n\u003Cli\u003Edestination systems per user account\u003C\/li\u003E\n\u003Cli\u003Euser accounts per each source system to destination system path\u003C\/li\u003E\n\u003Cli\u003Euser accounts per each source systems\u003C\/li\u003E\n\u003Cli\u003Euser accounts per each destination system\u003C\/li\u003E\n\u003Cli\u003Esource system to destination system paths per user account\u003C\/li\u003E\n\u003Cli\u003Etotal RDP logons per user account\u003C\/li\u003E\n\u003Cli\u003Etotal RDP logons per source system\u003C\/li\u003E\n\u003Cli\u003Etotal RDP logons per destination system\u003C\/li\u003E\n\u003Cli\u003Edestination systems for each source system\u003C\/li\u003E\n\u003Cli\u003Esource systems for each destination systems\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThis list of metrics is not exhaustive and can be expanded by including timestamp metadata if desired.\u003C\/p\u003E\n\u003Ch4\u003ERecommendations\u003C\/h4\u003E\n\u003Cp\u003EWhile baselining RDP activity may not readily identify threat actors who do not utilize this technique, or who take extra steps to blend in with legitimate user activity, it will continually help analysts better understand what normal behavior looks like in their specific environments – and could ultimately identify anomalies or potential indicators of unauthorized activity.\u003C\/p\u003E\n\u003Cp\u003EThe following recommendations can help maximize the effectiveness of your RDP baselining exercises, while also reducing the opportunities for RDP to be leveraged for malicious actors within your environment:\u003C\/p\u003E\n\u003Col style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EDisable the remote desktop service on end-user workstations and laptops, as well as systems where the service is not required for remote connectivity.\u003C\/li\u003E\n\u003Cli\u003EWhere connectivity using RDP is required, implement a combination of host and network-based controls to enforce that RDP connectivity must be initiated from specific jump boxes and centralized management servers for remote connection to endpoints.\u003C\/li\u003E\n\u003Cli\u003EHost-based firewall rules that explicitly deny inbound RDP connections provide enhanced protections, especially for remote users that may utilize their system at locations outside of an organization’s managed infrastructure. Use host-based firewall rules to:\u003Cul\u003E\n\u003Cli\u003EDeny inbound RDP connections by default.\u003C\/li\u003E\n\u003Cli\u003EWhen required, explicitly permit inbound RDP only from IP addresses correlating to authorized jump boxes.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EEmploy the “Deny log on through Remote Desktop Services” security setting to prevent standard users from connecting to endpoints using RDP.\u003Cul\u003E\n\u003Cli\u003EIdeally, this setting should also deny RDP access for privileged accounts (e.g. domain administrators, service accounts) on endpoints, as these types of accounts are commonly leveraged by attackers for laterally moving to sensitive systems within an environment.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EPrevent the use of RDP using local accounts by:\u003Cul\u003E\n\u003Cli\u003EInstalling \u003Ca href=\u0022http:\/\/support.microsoft.com\/kb\/2871997\u0022\u003EKB2871997\u003C\/a\u003E, and adding the SID “S-1-5-114: NT AUTHORITY\\Local account and member of Administrators group” to the “Deny log on through Remote Desktop Services” security setting on endpoints. This can be accomplished by using Group Policy.\u003C\/li\u003E\n\u003Cli\u003ERandomizing passwords for the built-in local administrator account on endpoints with a solution such as \u003Ca href=\u0022https:\/\/technet.microsoft.com\/en-us\/mt227395.aspx\u0022\u003EMicrosoft LAPS\u003C\/a\u003E.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EEnsure that EID 21, EID 23, EID 24, and EID 25 within the “TerminalServices LocalSessionManager Operational” event log are being captured and forwarded to a SIEM or log aggregator.\u003C\/li\u003E\n\u003Cli\u003EConfirm that EID 4624 within the “Security” event log is being captured and forwarded to a SIEM or log aggregator.\u003C\/li\u003E\n\u003Cli\u003EIncrease the maximum size of the “TerminalServices LocalSessionManager Operational” and event log to at least 500 MB. This can be accomplished by using Group Policy Preferences (GPP) to modify the “MaxSize” registry value within the registry key “HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\WINEVT\\Channels\\Microsoft-Windows-TerminalServices-LocalSessionManager\/Operational” on endpoints.\u003C\/li\u003E\n\u003Cli\u003EIncrease the maximum size of the “Security” event log to at least 1 GB.\u003C\/li\u003E\n\u003Cli\u003EMonitor for evidence of the “Security” and “TerminalServices LocalSessionManager Operational” event logs being cleared (\u003Ca href=\u0022https:\/\/www.sans.org\/summit-archives\/file\/summit-archive-1498249764.pdf\u0022\u003EEID 1102\u003C\/a\u003E).\u003C\/li\u003E\n\u003Cli\u003ECreate and regularly update documentation that maps user accounts and hostnames to business units.\u003C\/li\u003E\n\u003Cli\u003EEnsure DHCP logs are archived and easily accessible to correlate source system IP addresses with their hostname at the time of a logon event.\u003C\/li\u003E\n\u003C\/ol\u003E\n",
        "jcr:lastModified": "Wed Apr 25 2018 16:35:49 GMT-0400",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Thu Apr 26 2018 12:20:31 GMT-0400",
      "imageRotate": "0"
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003ERemote Desktop Protocol (RDP) is a beneficial tool, but threat actors can also use it, with compromised domain credentials, to move laterally across networks with limited segmentation.\u003C\/p\u003E\n",
      "jcr:lastModified": "Wed Apr 25 2018 16:38:22 GMT-0400",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    }
  }
}
