{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Tue Jul 10 2018 20:00:12 GMT-0400",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Chinese Espionage Group TEMP.Periscope Targets Cambodia Ahead of July 2018 Elections and Reveals Broad Operations Globally",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "692e076a-8ce2-4523-b24b-8d5b06cec3c0",
    "author": "Scott Henderson",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "lynda.hall@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "2dee1693-80e5-4843-bb55-761671ce4b5a"
    ],
    "jcr:created": "Tue May 14 2019 17:54:13 GMT-0400",
    "cq:lastReplicated": "Tue May 14 2019 17:54:11 GMT-0400",
    "cq:lastModified": "Wed Jul 11 2018 20:48:28 GMT-0400",
    "jcr:baseVersion": "2dee1693-80e5-4843-bb55-761671ce4b5a",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:scott-henderson",
      "fireeye-blog-authors:cap-steve-miller",
      "fireeye-blog-authors:dan-perez",
      "fireeye-blog-authors:marcin-siedlarz",
      "fireeye-blog-authors:ben-wilson",
      "fireeye-blog-authors:ben-read",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:china",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:malware"
    ],
    "jcr:uuid": "0995abfe-2b6d-4b7a-b33a-112f17afd6b4",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Tue Jul 10 2018 20:00:00 GMT-0400",
    "cq:lastModifiedBy": "lynda.hall@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
        "text": "\u003Ch4\u003EIntroduction\u003C\/h4\u003E\n\u003Cp\u003EFireEye has examined a range of TEMP.Periscope activity revealing extensive interest in Cambodia\u0026#39;s politics, with active compromises of multiple Cambodian entities related to the country’s electoral system. This includes compromises of Cambodian government entities charged with overseeing the elections, as well as the targeting of opposition figures. This campaign occurs in the run up to the country’s July 29, 2018, general elections. TEMP.Periscope used the same infrastructure for a range of activity against other more traditional targets, including the defense industrial base in the United States and a chemical company based in Europe. Our previous blog post focused on the group’s \u003Ca href=\u0022\/content\/fireeye-www\/ja_JP\/blog\/jp-threat-research\/2018\/03\/suspected-chinese-espionage-group-targeting-maritime-and-engineering-industries.html\u0022 adhocenable=\u0022false\u0022\u003Etargeting of engineering and maritime entities\u003C\/a\u003E in the United States.\u003C\/p\u003E\n\u003Cp\u003EOverall, this activity indicates that the group maintains an extensive intrusion architecture and wide array of malicious tools, and targets a large victim set, which is in line with typical Chinese-based APT efforts. We expect this activity to provide the Chinese government with widespread visibility into Cambodian elections and government operations. Additionally, this group is clearly able to run several large-scale intrusions concurrently across a wide range of victim types.\u003C\/p\u003E\n\u003Cp\u003EOur analysis also strengthened our overall attribution of this group. We observed the toolsets we previously attributed to this group, their observed targets are in line with past group efforts and also highly similar to known Chinese APT efforts, and we identified an IP address originating in Hainan, China that was used to remotely access and administer a command and control (C2) server.\u003C\/p\u003E\n\u003Ch4\u003ETEMP.Periscope Background\u003C\/h4\u003E\n\u003Cp\u003EActive since at least 2013, TEMP.Periscope has primarily focused on maritime-related targets across multiple verticals, including engineering firms, shipping and transportation, manufacturing, defense, government offices, and research universities (targeting is summarized in Figure 1). The group has also targeted professional\/consulting services, high-tech industry, healthcare, and media\/publishing. TEMP.Periscope overlaps in targeting, as well as tactics, techniques, and procedures (TTPs), with TEMP.Jumper, a group that also overlaps significantly with public reporting by \u003Ca href=\u0022https:\/\/www.proofpoint.com\/us\/threat-insight\/post\/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets\u0022\u003EProofpoint\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/www.f-secure.com\/documents\/996508\/1030745\/nanhaishu_whitepaper.pdf\u0022\u003EF-Secure\u003C\/a\u003E on \u0026quot;NanHaiShu.\u0026quot;\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/PeriscopeCambodia\/Fig1a.jpg\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Summary of TEMP.Periscope activity\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EIncident Background\u003C\/h4\u003E\n\u003Cp\u003EFireEye analyzed files on three open indexes believed to be controlled by TEMP.Periscope, which yielded insight into the group\u0026#39;s objectives, operational tactics, and a significant amount of technical attribution\/validation. These files were \u0026quot;open indexed\u0026quot; and thus accessible to anyone on the public internet. This TEMP.Periscope activity on these servers extends from at least April 2017 to the present, with the most current operations focusing on Cambodia\u0026#39;s government and elections.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003ETwo servers, chemscalere[.]com and scsnewstoday[.]com, operate as typical C2 servers and hosting sites, while the third, mlcdailynews[.]com, functions as an active SCANBOX server. The C2 servers contained both logs and malware.\u003C\/li\u003E\n\u003Cli\u003EAnalysis of logs from the three servers revealed:\u003Cul\u003E\n\u003Cli\u003EPotential actor logins from an IP address located in Hainan, China that was used to remotely access and administer the servers, and interact with malware deployed at victim organizations.\u003C\/li\u003E\n\u003Cli\u003EMalware command and control check-ins from victim organizations in the education, aviation, chemical, defense, government, maritime, and technology sectors across multiple regions. FireEye has notified all of the victims that we were able to identify.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EThe malware present on the servers included both new families (DADBOD, EVILTECH) and previously identified malware families (AIRBREAK, EVILTECH, HOMEFRY, MURKYTOP, HTRAN, and SCANBOX) .\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003ECompromises of Cambodian Election Entities\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EAnalysis of command and control logs on the servers revealed compromises of multiple Cambodian entities, primarily those relating to the upcoming July 2018 elections. In addition, a separate spear phishing email analyzed by FireEye indicates concurrent targeting of opposition figures within Cambodia by TEMP.Periscope.\u003C\/p\u003E\n\u003Cp\u003EAnalysis indicated that the following Cambodian government organizations and individuals were compromised by TEMP.Periscope:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003ENational Election Commission, Ministry of the Interior, Ministry of Foreign Affairs and International Cooperation, Cambodian Senate, Ministry of Economics and Finance\u003C\/li\u003E\n\u003Cli\u003EMember of Parliament representing Cambodia National Rescue Party\u003C\/li\u003E\n\u003Cli\u003EMultiple Cambodians advocating human rights and democracy who have written critically of the current ruling party\u003C\/li\u003E\n\u003Cli\u003ETwo Cambodian diplomats serving overseas\u003C\/li\u003E\n\u003Cli\u003EMultiple Cambodian media entities\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003ETEMP.Periscope sent a spear phish with AIRBREAK malware to Monovithya Kem, Deputy Director-General, Public Affairs, Cambodia National Rescue Party (CNRP), and the daughter of (imprisoned) Cambodian opposition party leader Kem Sokha (Figure 2). The decoy document purports to come from LICADHO (a non-governmental organization [NGO] in Cambodia established in 1992 to promote human rights). This sample leveraged scsnewstoday[.]com for C2.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/PeriscopeCambodia\/Fig2.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Human right protection survey lure\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe decoy document \u0026quot;Interview Questions.docx\u0026quot; (MD5: ba1e5b539c3ae21c756c48a8b5281b7e) is tied to AIRBREAK downloaders of the same name. The questions reference the opposition Cambodian National Rescue Party, human rights, and the election (Figure 3).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/PeriscopeCambodia\/Fig3.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Interview questions decoy\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EInfrastructure Also Used for Operations Against Private Companies\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe aforementioned malicious infrastructure was also used against private companies in Asia, Europe and North America. These companies are in a wide range of industries, including academics, aviation, chemical, maritime, and technology. A MURKYTOP sample from 2017 and data contained in a file linked to chemscalere[.]com suggest that a corporation involved in the U.S. defense industrial base (DIB) industry, possibly related to maritime research, was compromised. Many of these compromises are in line with TEMP.Periscope’s previous activity targeting maritime and defense industries. However, we also uncovered the compromise of a European chemical company with a presence in Asia, demonstrating that this group is a threat to business worldwide, particularly those with ties to Asia.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EAIRBREAK Downloaders and Droppers Reveal Lure Indicators\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EFilenames for AIRBREAK downloaders found on the open indexed sites also suggest the ongoing targeting of interests associated with Asian geopolitics. In addition, analysis of AIRBREAK downloader sites revealed a related server that underscores TEMP.Periscope\u0026#39;s interest in Cambodian politics.\u003C\/p\u003E\n\u003Cp\u003EThe AIRBREAK downloaders in Table 1 redirect intended victims to the indicated sites to display a legitimate decoy document while downloading an AIRBREAK payload from one of the identified C2s. Of note, the hosting site for the legitimate documents was not compromised. An additional C2 domain, partyforumseasia[.]com, was identified as the callback for an AIRBREAK downloader referencing the Cambodian National Rescue Party.\u003C\/p\u003E\n\u003Ctable width=\u0022630\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022228\u0022\u003E\u003Cp\u003E\u003Cb\u003ERedirect Site (Not Malicious)\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022275\u0022\u003E\u003Cp\u003E\u003Cb\u003EAIRBREAK Downloader\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022126\u0022\u003E\u003Cp\u003E\u003Cb\u003EAIRBREAK C2\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022228\u0022\u003E\u003Cp\u003Een.freshnewsasia.com\/index.php\/en\/8623-2018-04-26-10-12-46.html\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022275\u0022\u003E\u003Cp\u003ETOP_NEWS_Japan_to_Support_the_Election.js\u003C\/p\u003E\n\u003Cp\u003E(3c51c89078139337c2c92e084bb0904c) [Figure 4]\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd rowspan=\u00223\u0022 width=\u0022126\u0022\u003E\u003Cp\u003Echemscalere[.]com\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022228\u0022\u003E\u003Cp\u003Eiric.gov.kh\/LICADHO\/Interview-Questions.pdf\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022275\u0022\u003E\u003Cp\u003E[pdf]Interview-Questions.pdf.js\u003C\/p\u003E\n\u003Cp\u003E(e413b45a04bf5f812912772f4a14650f)\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022228\u0022\u003E\u003Cp\u003Eiric.gov.kh\/LICADHO\/Interview-Questions.pdf\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022275\u0022\u003E\u003Cp\u003E[docx]Interview-Questions.docx.js\u003C\/p\u003E\n\u003Cp\u003E(cf027a4829c9364d40dcab3f14c1f6b7)\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022228\u0022\u003E\u003Cp\u003Eunknown\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022275\u0022\u003E\u003Cp\u003EInterview_Questions.docx.js\u003C\/p\u003E\n\u003Cp\u003E(c8fdd2b2ddec970fa69272fdf5ee86cc)\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022126\u0022\u003E\u003Cp\u003Escsnewstoday[.]com\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022228\u0022\u003E\u003Cp\u003Eatimes.com\/article\/philippines-draws-three-hard-new-lines-on-china\/\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022275\u0022\u003E\u003Cp\u003EPhilippines-draws-three-hard-new-lines-on-china .js\u003C\/p\u003E\n\u003Cp\u003E(5d6ad552f1d1b5cfe99ddb0e2bb51fd7)\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022126\u0022\u003E\u003Cp\u003Emlcdailynews[.]com\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022228\u0022\u003E\u003Cp\u003Efacebook.com\/CNR.Movement\/videos\/190313618267633\/\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022275\u0022\u003E\u003Cp\u003ECNR.Movement.mp4.js\u003C\/p\u003E\n\u003Cp\u003E(217d40ccd91160c152e5fce0143b16ef)\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022126\u0022\u003E\u003Cp\u003EPartyforumseasia[.]com\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 1: AIRBREAK downloaders\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/PeriscopeCambodia\/Fig4.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: Decoy document associated with AIRBREAK downloader file TOP_NEWS_Japan_to_Support_the_Election.js\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003ESCANBOX Activity Gives Hints to Future Operations\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe active SCANBOX server, mlcdailynews[.]com, is hosting articles related to the current Cambodian campaign and broader operations. Articles found on the server indicate targeting of those with interests in U.S.-East Asia geopolitics, Russia and NATO affairs. Victims are likely either brought to the SCANBOX server via strategic website compromise or malicious links in targeted emails with the article presented as decoy material. The articles come from open-source reporting readily available online. Figure 5 is a SCANBOX welcome page and Table 2 is a list of the articles found on the server.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/PeriscopeCambodia\/Fig5.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: SCANBOX welcome page\u003C\/span\u003E\u003C\/p\u003E\n\u003Ctable cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003E\u003Cb\u003ECopied Article Topic\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022204\u0022\u003E\u003Cp\u003E\u003Cb\u003EArticle Source (Not Compromised)\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003ELeaders confident yet nervous\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd rowspan=\u00229\u0022 width=\u0022204\u0022\u003E\u003Cp\u003EKhmer Times\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EMahathir_ \u0026#39;We want to be friendly with China\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EPM urges voters to support CPP for peace\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003ECPP determined to maintain Kingdom\u0026#39;s peace and development\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EBun Chhay\u0026#39;s wife dies at 60\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003ECrackdown planned on boycott callers\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EFurther floods coming to Kingdom\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EKem Sokha again denied bail\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EPM vows to stay on as premier to quash traitors\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EIran_ Don\u0026#39;t trust Trump\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd rowspan=\u00222\u0022 width=\u0022204\u0022\u003E\u003Cp\u003EFresh News\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EKim-Trump summit_ Singapore\u0026#39;s role\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003ETrump\u0026#39;s North Korea summit may bring peace declaration - but at a cost\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd rowspan=\u00223\u0022 width=\u0022204\u0022\u003E\u003Cp\u003EReuters\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EU.S. pushes NATO to ready more forces to deter Russian threat\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003Eus-nato-russia_us-pushes-nato-to-ready-more-forces-to-deter-russian-threat\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EInterior Minister Sar Kheng warns of dirty tricks\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd rowspan=\u00222\u0022 width=\u0022204\u0022\u003E\u003Cp\u003EPhnom Penh Post\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EAnother player to enter market for cashless pay\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EDonald Trump says he has \u0026#39;absolute right\u0026#39; to pardon himself but he\u0026#39;s done nothing wrong - Donald Trump\u0026#39;s America\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022204\u0022\u003E\u003Cp\u003EABC News\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EChina-funded national road inaugurated in Cambodia\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022204\u0022\u003E\u003Cp\u003EThe Cambodia Daily\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EKim and Trump in first summit session in Singapore\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022204\u0022\u003E\u003Cp\u003EAsia Times\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003EU.S. to suspend military exercises with South Korea, Trump says\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022204\u0022\u003E\u003Cp\u003EU.S. News\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003ERainsy defamed the King_ Hun Sen\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022204\u0022\u003E\u003Cp\u003EBREAKING NEWS\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022\u003E\u003Cp\u003Ecambodia-opposition-leader-denied-bail-again-in-treason-case\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022204\u0022\u003E\u003Cp\u003EAssociated Press\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 2: SCANBOX articles copied to server\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003ETEMP.Periscope Malware Suite\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EAnalysis of the malware inventory contained on the three servers found a classic suite of TEMP.Periscope payloads, including the signature AIRBREAK, MURKYTOP, and HOMEFRY. In addition, FireEye’s analysis identified new tools, EVILTECH and DADBOD (Table 3).\u003C\/p\u003E\n\u003Ctable cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022124\u0022\u003E\u003Cp\u003E\u003Cb\u003EMalware\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003E\u003Cb\u003EFunction\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022385\u0022\u003E\u003Cp\u003E\u003Cb\u003EDetails\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022124\u0022\u003E\u003Cp\u003EEVILTECH\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EBackdoor\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022385\u0022\u003E\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EEVILTECH is a JavaScript sample that implements a simple RAT with support for uploading, downloading, and running arbitrary JavaScript.\u003C\/li\u003E\n\u003Cli\u003EDuring the infection process, EVILTECH is run on the system, which then causes a redirect and possibly the download of additional malware or connection to another attacker-controlled system.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022124\u0022\u003E\u003Cp\u003EDADBOD\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003ECredential Theft\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022385\u0022\u003E\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EDADBOD is a tool used to steal user cookies.\u003C\/li\u003E\n\u003Cli\u003EAnalysis of this malware is still ongoing.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 3: New additions to the TEMP.Periscope malware suite\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EData from Logs Strengthens Attribution to China\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EOur analysis of the servers and surrounding data in this latest campaign bolsters our previous assessment that TEMP.Periscope is likely Chinese in origin. Data from a control panel access log indicates that operators are based in China and are operating on computers with Chinese language settings.\u003C\/p\u003E\n\u003Cp\u003EA log on the server revealed IP addresses that had been used to log in to the software used to communicate with malware on victim machines. One of the IP addresses, 112.66.188.28, is located in Hainan, China. Other addresses belong to virtual private servers, but artifacts indicate that the computers used to log in all cases are configured with Chinese language settings.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EOutlook and Implications\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe activity uncovered here offers new insight into TEMP.Periscope’s activity. We were previously aware of this actor’s interest in maritime affairs, but this compromise gives additional indications that it will target the political system of strategically important countries. Notably, Cambodia has served as a reliable supporter of China’s South China Sea position in international forums such as ASEAN and is an important partner. While Cambodia is rated as Authoritarian by the Economist’s Democracy Index, the recent surprise upset of the ruling party in Malaysia may motivate China to closely monitor Cambodia’s July 29 elections.\u003C\/p\u003E\n\u003Cp\u003EThe targeting of the election commission is particularly significant, given the critical role it plays in facilitating voting. There is not yet enough information to determine why the organization was compromised – simply gathering intelligence or as part of a more complex operation. Regardless, this incident is the most recent example of aggressive nation-state intelligence collection on election processes worldwide.\u003C\/p\u003E\n\u003Cp\u003EWe expect TEMP.Periscope to continue targeting a wide range of government and military agencies, international organizations, and private industry. However focused this group may be on maritime issues, several incidents underscore their broad reach, which has included European firms doing business in Southeast Asia and the internal affairs of littoral nations. FireEye expects TEMP.Periscope will remain a virulent threat for those operating in the area for the foreseeable future.\u003C\/p\u003E\n",
        "jcr:lastModified": "Wed Jul 11 2018 20:48:28 GMT-0400",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Tue Jul 10 2018 20:04:09 GMT-0400",
      "imageRotate": "0"
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EFireEye has examined a range of TEMP.Periscope activity revealing extensive interest in Cambodia\u0026#39;s politics, with active compromises of multiple Cambodian entities related to the country’s electoral system.\u003C\/p\u003E\n",
      "jcr:lastModified": "Tue Jul 10 2018 19:56:09 GMT-0400",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    }
  }
}
