{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Mon Sep 14 2020 16:25:57 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "A \u0022DFUR-ent\u0022 Perspective on Threat Modeling and Application Log Forensic Analysis",
    "jcr:versionHistory": "65847131-533f-4e70-bee5-fd46747fda54",
    "author": "Ryan Tomcik",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "c9b2859c-a832-4eaa-9154-c1e96e6198bd"
    ],
    "jcr:created": "Mon Sep 14 2020 16:37:53 GMT+0000",
    "cq:lastModified": "Mon Sep 14 2020 16:37:33 GMT+0000",
    "jcr:baseVersion": "c9b2859c-a832-4eaa-9154-c1e96e6198bd",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:ryan-tomcik",
      "fireeye-blog-authors:cap-david-pany",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:log-analysis",
      "fireeye-blog-tags:incident-response",
      "fireeye-blog-tags:forensics",
      "fireeye-blog-tags:analysis"
    ],
    "jcr:uuid": "ca2d0bc4-8ae1-42ba-a3e4-77828b9eee04",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Sep 14 2020 12:30:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EMany organizations operating in e-commerce, hospitality, healthcare, managed services, and other service industries rely on web applications. And buried within the application logs may be the potential discovery of fraudulent use and\/or compromise! But, let\u0027s face it, finding evil in application logs can be difficult and overwhelming for a few reasons, including:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EThe wide variety of web applications with unique functionality\u003C\/li\u003E\n\u003Cli\u003EThe lack of a standard logging format\u003C\/li\u003E\n\u003Cli\u003ELogging formats that were designed for troubleshooting application issues and not security investigations\u003C\/li\u003E\n\u003Cli\u003EThe need for a centralized log analysis solution or SIEM to process and investigate a large amount of application log data\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003ESo, in this blog post, we discuss threat modeling concepts that can help prioritize logging decisions and unleash the ability to identify and investigate attacks against an application. To help us demonstrate, we\u0027ll describe situations for a fictitious organization called Dog and Feline Urgent Response, or DFUR, that we \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.youtube.com\/watch?v=_soMAPXJs5c\u0022\u003Epresented at the 2020 SANS Digital Forensics \u0026amp; Incident Response (DFIR) Summit\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003EWe selected Splunk Enterprise Security (ES) as DFUR’s SIEM and logging analysis platform, but this is just one option and there are multiple technologies that can facilitate application log analysis. We created a Splunk application called “\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/github.com\/fireeye\/DFUR-Splunk-App\u0022\u003EDog and Feline Urgent Response (DFUR)\u003C\/a\u003E” available on the FireEye GitHub that contains pre-indexed data and dashboards that you can use to follow along with the following attack scenarios.\u003C\/p\u003E\n\u003Cp\u003EBut, enough kitten around. Let’s introduce you to DFUR!\u003C\/p\u003E\n\u003Ch4\u003EDFUR: Dog and Feline Urgent Response\u003C\/h4\u003E\n\u003Cp\u003EDFUR is a long-standing organization in the pet wellness industry that provides care providers, pet owners, and insurance providers with application services.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ECare providers, such as veterinarians, use DFUR to process patient records, submit prescriptions, and order additional care services\u003C\/li\u003E\n\u003Cli\u003EPet owners use DFUR to make appointments, pay bills, and see diagnostic test results\u003C\/li\u003E\n\u003Cli\u003EInsurance providers use DFUR to receive and pay claims to pet care providers\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EApplication users log into a web portal that forwards logon and user transaction logs to DFUR’s Splunk ES instance. Backend databases store metadata for users, such as street addresses and contact information.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EDFUR Security Team Threat Modeling\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAfter stumbling through several incidents, the DFUR security team realized that their application did not log the information needed to answer investigative question clearly and quickly. The team held workshops with technical stakeholders to develop a threat model and improve their application security strategy. They addressed questions, such as:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWhat types of threats does DFUR face based on industry trends?\u003C\/li\u003E\n\u003Cli\u003EWhat impact could those threats have?\u003C\/li\u003E\n\u003Cli\u003EHow could the DFUR application be attacked or abused?\u003C\/li\u003E\n\u003Cli\u003EWhat log data would DFUR need to prove an attack or fraud happened?\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe DFUR team compiled the stakeholder feedback and developed a threat profile to identify and prioritize high-risk threats facing the DFUR application platform, including:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EAccount takeover and abuse\u003Cul\u003E\n\u003Cli\u003EPassword attacks (e.g., credential stuffing)\u003C\/li\u003E\n\u003Cli\u003EBank account modifications\u003C\/li\u003E\n\u003Cli\u003EPHI\/PII access\u003C\/li\u003E\n\u003Cli\u003EHealth service modifications or interruptions\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EFraudulent reimbursement claim submission\u003C\/li\u003E\n\u003Cli\u003EVeterinarians over-prescribing catnip\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe DFUR security team discussed how they could identify threats using their currently available logs, and, well, the findings were not purr-ty.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003ELogging Problems Identified\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DFUR team used their threat model to determine what log sources were relevant to their security mission, and then they dug into each one to confirm the log events were valid, normalized, and accessible. This effort produced a list of high-priority logging issues that needed to be addressed before the security team could move forward with developing methods for detection and analysis:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cb\u003ELocal logs were not forwarded to their Splunk ES instance\u003C\/b\u003E. Only a limited subset of logging was forwarded to their Splunk ES instance, so DFUR analysts couldn\u0027t search for the actions performed by users who were authenticated to the application portal.\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003EInaccurate field mapping\u003C\/b\u003E. DFUR analysts identified extracted field values that were mapped to incorrect field names. One example was the user-agent in authentication log events had been extracted as the username field.\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003EApplication updates sometimes affected Splunk ingestion and parsing. \u003C\/b\u003EDFUR analysts identified servers that didn\u0027t have a startup script to ensure log forwarding was enabled upon system reboot. Application updates changed the logging output format which broke field extractions. DFUR analysts didn\u0027t have a way to determine when log sources weren\u0027t operating as expected.\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003ETime zone misconfigurations\u003C\/b\u003E. DFUR analysts determined their log sources had multiple time zone configurations which made correlation difficult.\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003EThe log archival settings needed to be modified\u003C\/b\u003E. DFUR analysts needed to configure their Splunk ES instance data retirement policy to maintain indexed data for a longer time period and archive historical data for quick restoration.\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003ESource IP addresses of users logging into the portal were masked by a load balancer.\u003C\/b\u003E The DFUR analysts realized that the source IP address for every user logon was a load balancer, which made attribution even more difficult. The X-Forwarded-For (XFF) field in their appliances needed to be enabled.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EAnalysis Problems Identified\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DFUR infosec team reviewed how previous incidents involving the DFUR application were handled. They quickly learned that they needed to solve the following operational issues before they could effectively investigate application attacks:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cb\u003EInconsistency during manual analysis\u003C\/b\u003E. DFUR analysts took different approaches to searching their Splunk ES instance, and they would reach different conclusions. Playbooks were needed to define a standard investigative methodology for common incident scenarios.\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003ENo documentation of log fields or sources\u003C\/b\u003E. Some DFUR analysts were not aware of all relevant data sources that were available when investigating security incidents. This led to findings that were based on a small part of the picture. A data dictionary was needed that defines the log sources and fields in the DFUR Splunk ES instance and the retention time for each log source.\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003EApplication logs were designed for troubleshooting, not investigating\u003C\/b\u003E. The DFUR application was configured to log diagnostic information, application errors, and limited subsets of successful user activity. The DFUR team needed to reconfigure and develop the application to record more security related events.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EDFUR: New and Improved Monitoring and Detection\u003C\/h4\u003E\n\u003Cp\u003EThe DFUR team addressed their application log and analysis problems and started building a detection and investigative capability in their Splunk ES instance. Using the analysis workflows developed during the threat modeling process, the DFUR team designed Splunk dashboards (Figure 1) to provide detection analytics and context around three primary datapoints: usernames, IP addresses, and care providers (“organizations”).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture1a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 1: DFUR monitoring and detection dashboard\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DFUR team created the Splunk dashboards using Simple XML to quickly identify alerts and pivot among the primary datapoints, as seen in Figure 2. The DFUR team knew that their improved and streamlined methodology would save time compared to exporting, analyzing, and correlating raw logs manually.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Pivoting concepts used to develop DFUR dashboards\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ENewly armed (legged?) with a monitoring and detection capability, the DFUR team was ready to find evil!\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EAttack Scenario #1: Account Takeover\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe next morning, the DFUR security team was notified by their customer service team of a veterinarian provider with the username ‘labradorable’ who hadn’t received their daily claims payment and noticed their banking information in the DFUR portal was changed overnight.\u003C\/p\u003E\n\u003Cp\u003EA DFUR analyst opened the User Activity Enrichment dashboard (Figure 3) and searched for the username to see recent actions performed by the account.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture3a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 3: User Activity Enrichment dashboard\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe analyst reviewed the Remote Access Analytics in the dashboard and identified the following anomalies (Figure 4):\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EThe username reminder and password reset action was performed the day before from an Indonesia-based IP address\u003C\/li\u003E\n\u003Cli\u003EThe user account was logged in from the same suspicious IP address shortly after\u003C\/li\u003E\n\u003Cli\u003EThe legitimate user always logs in from California, so the Indonesia source IP login activity was highly suspicious\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture4a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 4: Remote access analytics based on user activity\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DFUR analyst clicked on the Application Activity tab in the User Activity Enrichment dashboard to see what actions were performed by the user while they were logged in from the suspicious IP address. The analyst identified the user account logged in from the suspicious IP address and performed an email address change and added two (2) new bank accounts, as seen in Figure 5.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture5a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 5: Application activity timeline filtered based on IP address\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DFUR analyst confirmed that the two (2) bank accounts were added by the user to the care provider with organization ID 754354, as seen in Figure 6.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture6.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 6: Bank accounts added and assigned to a provider\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EBy clicking on the organization ID in the Splunk results table, the DFUR analyst triggered a drill-down action to automatically open the Organization Enrichment Dashboard and populate the organization ID value with the results from the previous panel (Figure 7). The DFUR analyst determined that the bank routing information for the new bank accounts was inconsistent with the organization’s mailing address.\u0026nbsp;\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture7a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 7: Organization Enrichment Dashboard\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe activity indicated that the attacker had access to the user’s primary email and successfully reset the DFUR account password. The DFUR analyst confirmed that no other accounts were targeted by the suspicious IP address (Figure 8).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture8a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 8: IP Address Enrichment dashboard\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EAttack Scenario #2: Credential Stuffing\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ELater that afternoon, the DFUR team began receiving reports of account lockouts in the patient and provider portals when users tried to login. The security team was asked to investigate potential password attack activity on their DFUR platform.\u003C\/p\u003E\n\u003Cp\u003EThe DFUR analyst pulled up the main monitoring and detection dashboard and scrolled down to the panel focused on identifying potential password attack activity (Figure 9). They identified five (5) IP addresses associated with an elevated number of failed login attempts, suggesting a password spray or credential stuffing attack with varying success.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture9a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 9: Dashboard panel showing potential password attack events\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DFUR analyst clicked on one of the IP addresses which triggered a drill-down action to open the IP Address Enrichment dashboard and prepopulate the IP address token value (Figure 10).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture10a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 10: IP Address Enrichment dashboard\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe DFUR analyst identified more than 3,000 failed login attempts associated with the IP address with three (3) successful logins that morning. The Remote Access Analytics panels for the IP address further showed successful logins for accounts that may have been successfully compromised and need to be reset (Figure 11).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/dfur\/picture11a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 11: Remote access analytics for IP address\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EConclusion\u003C\/h4\u003E\n\u003Cp\u003EAfter implementing the newly developed logs and analysis capabilities and by leveraging Splunk’s security solutions, the DFUR security team drastically improved key metrics aligned with their application security missions:\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003EIdentify compromise and fraud before customers report it\u003C\/li\u003E\n\u003Cli\u003EAnalyze 90% of application security events within 30 minutes\u003C\/li\u003E\n\u003Cli\u003EAnswer all investigation questions from users, compliance, and legal teams\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003EMandiant and the whole DFUR security team hope you can use the scenarios and references in this post to improve your log analysis and how you leverage a SIEM solution in the following ways:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EReflect on your current logging gaps and capabilities to improve\u003C\/li\u003E\n\u003Cli\u003EEnhance logs from “whatever the developers implemented” to “designed to be investigated”\u003C\/li\u003E\n\u003Cli\u003EDevelop investigative workflows that are reliable and repeatable\u003C\/li\u003E\n\u003Cli\u003ECorrelate pivot points between your data sources and streamline correlation capabilities\u003C\/li\u003E\n\u003Cli\u003ECreate monitoring and alerting capabilities based on threat modeling\u003C\/li\u003E\n\u003Cli\u003ELower the technical barrier for comprehensive analysis\u003C\/li\u003E\n\u003Cli\u003EImplement similar analysis capabilities to those in the “DFUR” Splunk application, linked in the References section\u003C\/li\u003E\n\u003Cli\u003EUnderstand that logs can lead into better security analytics and strengthening of your security operations\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EReferences\u003C\/h4\u003E\n\u003Cp\u003EFor organizations that utilize Splunk security solutions as their SIEM solution, for automation, analytics or log aggregation, or want to try out for free with Splunk’s free trial download, we developed an application called “Dog and Feline Urgent Response (DFUR)” to demonstrate application log forensic analysis and dashboard pivoting concepts. The code contains pre-indexed data and CSV files referenced by searches contained in four Splunk XML dashboards. All data, such as IP addresses and usernames, was fabricated for the purposes of the demo and any association with organizations, users, or pets is coincidental.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWatch the recording of our \u003Ca href=\u0022https:\/\/www.youtube.com\/watch?v=_soMAPXJs5c\u0022 adhocenable=\u0022false\u0022\u003ESANS DFIR Summit presentation\u003C\/a\u003E.\u003C\/li\u003E\n\u003Cli\u003EDownload the \u003Ca href=\u0022https:\/\/github.com\/fireeye\/DFUR-Splunk-App\u0022\u003E\u0026quot;DFUR\u0026quot; Splunk application in FireEye GitHub\u003C\/a\u003E.\u003C\/li\u003E\n\u003Cli\u003EIf you need assistance investigating application attacks or developing log analysis capabilities, contact us at investigations@mandiant.com.\u003C\/li\u003E\n\u003C\/ul\u003E\n",
        "jcr:lastModified": "Mon Sep 14 2020 16:37:33 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe discuss threat modeling concepts that can help prioritize logging decisions and unleash the ability to identify and investigate attacks against an application.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu Sep 10 2020 16:39:44 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon Sep 14 2020 16:25:20 GMT+0000",
      "imageRotate": "0"
    }
  }
}
