{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Thu Oct 31 2019 13:00:12 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "MESSAGETAP: Who’s Reading Your Text Messages?",
    "jcr:versionHistory": "45a90532-7d9f-44d8-a9f1-686cae85980d",
    "author": "Raymond Leong",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "78a46db7-8e5a-4a99-a33a-b9226f3172ac"
    ],
    "jcr:created": "Mon Nov 04 2019 20:06:31 GMT+0000",
    "cq:lastModified": "Mon Nov 04 2019 20:06:25 GMT+0000",
    "jcr:baseVersion": "78a46db7-8e5a-4a99-a33a-b9226f3172ac",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:raymond-leong",
      "fireeye-blog-authors:dan-perez",
      "fireeye-blog-authors:tyler-dean",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:apt",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:malware",
      "fireeye-blog-tags:mobile",
      "fireeye-blog-tags:espionage",
      "fireeye-blog-tags:FLARE"
    ],
    "jcr:uuid": "269bd562-fa82-4cb5-9486-ef03ecafd420",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Oct 31 2019 09:00:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EFireEye Mandiant recently discovered a new malware family used by APT41 (a Chinese APT group) that is designed to monitor and save SMS traffic from specific phone numbers, IMSI numbers and keywords for subsequent theft. Named MESSAGETAP, the tool was deployed by APT41 in a telecommunications network provider in support of Chinese espionage efforts. APT41’s operations have included state-sponsored cyber espionage missions as well as financially-motivated intrusions. These operations have spanned from as early as 2012 to the present day. For an overview of APT41, see our \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/08\/apt41-dual-espionage-and-cyber-crime-operation.html\u0022\u003EAugust 2019 blog post\u003C\/a\u003E\u0026nbsp;or our\u0026nbsp;\u003Ca href=\u0022https:\/\/content.fireeye.com\/apt41\/rpt-apt41\u0022\u003Efull published report\u003C\/a\u003E. MESSAGETAP was first reported to \u003Ca href=\u0022https:\/\/www.fireeye.com\/solutions\/cyber-threat-intelligence\/threat-intelligence-subscriptions.html\u0022\u003EFireEye Threat Intelligence subscribers\u003C\/a\u003E in August 2019 and initially discussed publicly in an APT41 presentation at FireEye Cyber Defense Summit 2019.\u003C\/p\u003E\n\u003Ch4\u003EMESSAGETAP Overview\u003C\/h4\u003E\n\u003Cp\u003EAPT41\u0027s newest espionage tool, MESSAGETAP, was discovered during a 2019 investigation at a telecommunications network provider within a cluster of Linux servers. Specifically, these Linux servers operated as Short Message Service Center (SMSC) servers. In mobile networks, SMSCs are responsible for routing Short Message Service (SMS) messages to an intended recipient or storing them until the recipient has come online. With this background, let\u0027s dig more into the malware itself.\u003C\/p\u003E\n\u003Cp\u003EMESSAGETAP is a 64-bit ELF data miner initially loaded by an installation script. Once installed, the malware checks for the existence of two files: \u003Ci\u003Ekeyword_parm.txt\u003C\/i\u003E and \u003Ci\u003Eparm.txt\u003C\/i\u003E and attempts to read the configuration files every 30 seconds.\u0026nbsp; If either exist, the contents are read and XOR decoded with the string:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003Ehttp:\/\/www.etsi.org\/deliver\/etsi_ts\/123000_123099\/123040\/04.02.00_60\/ts_123040v040200p.pdf\u003Cul\u003E\n\u003Cli\u003EInterestingly, this XOR key leads to a URL owned by the European Telecommunications Standards Institute (ETSI). The document explains the Short Message Service (SMS) for GSM and UMTS Networks. It describes architecture as well as requirements and protocols for SMS.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThese two files, \u003Ci\u003Ekeyword_parm.txt \u003C\/i\u003Eand \u003Ci\u003Eparm.txt \u003C\/i\u003Econtain instructions for MESSAGETAP to target and save contents of SMS messages.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EThe first file (\u003Ci\u003Eparm.txt\u003C\/i\u003E) is a file containing two lists:\u003Cul\u003E\n\u003Cli\u003E\u003Ci\u003EimsiMap\u003C\/i\u003E: This list contains International Mobile Subscriber Identity (IMSI) numbers. IMSI numbers identify subscribers on a cellular network.\u003C\/li\u003E\n\u003Cli\u003E\u003Ci\u003EphoneMap\u003C\/i\u003E: The \u003Ci\u003EphoneMap\u003C\/i\u003E list contains phone numbers.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EThe second file (\u003Ci\u003Ekeyword_parm.txt\u003C\/i\u003E) is a list of keywords that is read into \u003Ci\u003EkeywordVec\u003C\/i\u003E.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EBoth files are deleted from disk once the configuration files are read and loaded into memory. After loading the keyword and phone data files, MESSAGETAP begins monitoring all network connections to and from the server. It uses the libpcap library to listen to all traffic and parses network protocols starting with Ethernet and IP layers. It continues parsing protocol layers including SCTP, SCCP, and TCAP. Finally, the malware parses and extracts SMS message data from the network traffic:\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003ESMS message contents\u003C\/li\u003E\n\u003Cli\u003EThe IMSI number\u003C\/li\u003E\n\u003Cli\u003EThe source and destination phone numbers\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003EThe malware searches the SMS message contents for keywords from the \u003Ci\u003EkeywordVec\u003C\/i\u003E list, compares the IMSI number with numbers from the \u003Ci\u003EimsiMap\u003C\/i\u003E list, and checks the extracted phone numbers with the numbers in the \u003Ci\u003EphoneMap\u003C\/i\u003E list.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/messagetap\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: General Overview Diagram of MESSAGETAP\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EIf the SMS message text contains one of the \u003Ci\u003EkeywordVec\u003C\/i\u003E values, the contents are XORed and saved to a path with the following format:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\/etc\/\u0026lt;redacted\u0026gt;\/kw_\u0026lt;year\u0026gt;\u0026lt;month\u0026gt;\u0026lt;day\u0026gt;.csv\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe malware compares the IMSI number and phone numbers with the values from the \u003Ci\u003EimsiMap\u003C\/i\u003E and \u003Ci\u003EphoneMap\u003C\/i\u003E lists. If found, the malware XORs the contents and stores the data in a path with the following format:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\/etc\/\u0026lt;redacted\u0026gt;\/\u0026lt;year\u0026gt;\u0026lt;month\u0026gt;\u0026lt;day\u0026gt;.csv\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EIf the malware fails to parse a message correctly, it dumps it to the following location:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\/etc\/\u0026lt;redacted\u0026gt;\/\u0026lt;year\u0026gt;\u0026lt;month\u0026gt;\u0026lt;day\u0026gt;_\u0026lt;count\u0026gt;.dump\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003ESignificance of Input Files\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe configuration files provide context into the targets of this information gathering and monitoring campaign.\u0026nbsp;The data in \u003Ci\u003Ekeyword_parm.txt\u003C\/i\u003E contained terms of geopolitical interest to Chinese intelligence collection. The two lists \u003Ci\u003EphoneMap \u003C\/i\u003Eand \u003Ci\u003EimsiMap \u003C\/i\u003Efrom \u003Ci\u003Eparm.txt\u003C\/i\u003E contained a high volume of phone numbers and IMSI numbers.\u003C\/p\u003E\n\u003Cp\u003EFor a quick review, \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/csrc.nist.gov\/glossary\/term\/International-Mobile-Subscriber-Identity\u0022\u003EIMSI numbers\u003C\/a\u003E are used in both GSM (Global System for Mobiles) and UMTS (Universal Mobile Telecommunications System) mobile phone networks and consists of three parts:\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003EMobile Country Code (MCC)\u003C\/li\u003E\n\u003Cli\u003EMobile Network Code (MNC)\u003C\/li\u003E\n\u003Cli\u003EMobile Station Identification Number (MSIN)\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003EThe Mobile Country Code corresponds to the subscriber’s country, the Mobile Network Code corresponds to the specific provider and the Mobile Station Identification Number is uniquely tied to a specific subscriber.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/messagetap\/Picture2a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 2: IMSI number description\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe inclusion of both phone and IMSI numbers show the highly targeted nature of this cyber intrusion. If an SMS message contained either a phone number or an IMSI number that matched the predefined list, it was saved to a CSV file for later theft by the threat actor.\u003C\/p\u003E\n\u003Cp\u003ESimilarly, the keyword list contained items of geopolitical interest for Chinese intelligence collection. Sanitized examples include the names of political leaders, military and intelligence organizations and political movements at odds with the Chinese government. If any SMS messages contained these keywords, MESSAGETAP would save the SMS message to a CSV file for later theft by the threat actor.\u003C\/p\u003E\n\u003Cp\u003EIn addition to MESSAGETAP SMS theft, FireEye Mandiant also identified the threat actor interacting with call detail record (CDR) databases to query, save and steal records during this same intrusion.\u0026nbsp;The CDR records corresponded to foreign high-ranking individuals of interest to the Chinese intelligence services. Targeting CDR information provides a high-level overview of phone calls between individuals, including time, duration, and phone numbers. In contrast, MESSAGETAP captures the contents of specific text messages.\u003C\/p\u003E\n\u003Ch4\u003ELooking Ahead\u003C\/h4\u003E\n\u003Cp\u003EThe use of MESSAGETAP and targeting of sensitive text messages and call detail records at scale is representative of the evolving nature of Chinese cyber espionage campaigns observed by FireEye. APT41 and multiple other threat groups attributed to Chinese state-sponsored actors have increased their targeting of upstream data entities since 2017. These organizations, located multiple layers above end-users, occupy critical information junctures in which data from multitudes of sources converge into single or concentrated nodes. Strategic access into these organizations, such as telecommunication providers, enables the Chinese intelligence services an ability to obtain sensitive data at scale for a wide range of priority intelligence requirements.\u003C\/p\u003E\n\u003Cp\u003EIn 2019, FireEye observed four telecommunication organizations targeted by APT41 actors. Further, four additional telecommunications entities were targeted in 2019 by separate threat groups with suspected Chinese state-sponsored associations. Beyond telecommunication organizations, other client verticals that possess sensitive records related to specific individuals of interest, such as major travel services and healthcare providers, were also targeted by APT41. This is reflective of an evolving Chinese targeting trend focused on both upstream data and targeted surveillance. For deeper analysis regarding recent Chinese cyber espionage targeting trends, customers may refer to the FireEye Threat Intelligence Portal. This topic was also briefed at FireEye Cyber Defense Summit 2019.\u003C\/p\u003E\n\u003Cp\u003EFireEye assesses this trend will continue in the future. Accordingly, both users and organizations must consider the risk of unencrypted data being intercepted several layers upstream in their cellular communication chain. This is especially critical for highly targeted individuals such as dissidents, journalists and officials that handle highly sensitive information. Appropriate safeguards such as utilizing a communication program that enforces end-to-end encryption can mitigate a degree of this risk. Additionally, user education must impart the risks of transmitting sensitive data over SMS. More broadly, the threat to organizations that operate at critical information junctures will only increase as the incentives for determined nation-state actors to obtain data that directly support key geopolitical interests remains.\u003C\/p\u003E\n\u003Ch4\u003EFireEye Detections\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EFE_APT_Controller_SH_MESSAGETAP_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Trojan_Linux64_MESSAGETAP_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Trojan_Linux_MESSAGETAP_1\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Trojan_Linux_MESSAGETAP_2\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Trojan_Linux_MESSAGETAP_3\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EExample File\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cb\u003EFile name: \u003C\/b\u003Emtlserver\u003C\/li\u003E\n\u003Cli\u003E\u003Cb\u003EMD5 hash\u003C\/b\u003E: 8D3B3D5B68A1D08485773D70C186D877\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp style=\u0022margin-left: 40px;\u0022\u003E*This sample was identified by FireEye on VirusTotal and provides an example for readers to reference. The file is a less robust version than instances of MESSAGETAP identified in intrusions and may represent an earlier test of the malware. The file and any of its embedded data were not observed in any Mandiant Consulting engagement*\u003C\/p\u003E\n\u003Ch4\u003EReferences\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/08\/apt41-dual-espionage-and-cyber-crime-operation.html\u0022\u003EAPT41: A Dual Espionage and Cyber Crime Operation\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.fireeye.com\/solutions\/cyber-threat-intelligence\/threat-intelligence-subscriptions.html\u0022\u003EFireEye Threat Intelligence Portal, MESSAGETAP report\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/summit.fireeye.com\/learn\/tracks.html#technical\u0022\u003EFireEye 2019 Cyber Defense Summit\u0026nbsp;– APT41: Technical TTPs and Malware Capabilities\u003C\/a\u003E (recording to be released)\u003C\/li\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/summit.fireeye.com\/learn\/tracks.html#executive\u0022\u003EFireEye 2019 Cyber Defense Summit\u0026nbsp;– Achievement Unlocked: Chinese Cyber Espionage Evolves to Support Higher Level Missions\u003C\/a\u003E (recording to be released)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EAcknowledgements\u003C\/h4\u003E\n\u003Cp\u003EThank you to Adrian Pisarczyk, Matias Bevilacqua and Marcin Siedlarz for identification and analysis of MESSAGETAP at a FireEye Mandiant Consulting engagement.\u003C\/p\u003E\n",
        "jcr:lastModified": "Thu Oct 31 2019 01:50:27 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EMESSAGETAP is\u0026nbsp;a new malware family used by APT41 that is designed to monitor SMS traffic.\u003C\/p\u003E\n",
      "jcr:lastModified": "Tue Oct 29 2019 15:38:52 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon Nov 04 2019 20:06:25 GMT+0000",
      "imageRotate": "0"
    }
  }
}
