{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Fri Mar 05 2021 01:45:08 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Detection and Response to Exploitation of Microsoft Exchange Zero-Day Vulnerabilities",
    "jcr:versionHistory": "385b3e76-d5d3-4cd6-980f-183486b2a730",
    "author": "Matt Bromiley",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "80e94cc9-476c-4972-9117-8658a2b43af8"
    ],
    "jcr:created": "Tue Mar 09 2021 18:40:34 GMT+0000",
    "cq:lastModified": "Tue Mar 09 2021 18:38:54 GMT+0000",
    "jcr:baseVersion": "80e94cc9-476c-4972-9117-8658a2b43af8",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:matt-bromiley",
      "fireeye-blog-authors:cap-chris-digamo",
      "fireeye-blog-authors:andrew-thompson",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:zero-day",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:microsoft",
      "fireeye-blog-tags:managed-defense",
      "fireeye-blog-authors:robert-wallace"
    ],
    "jcr:uuid": "3a2830a1-b9f9-4cb4-83a8-06f64d41e795",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Mar 04 2021 17:30:00 GMT-0500",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EBeginning in January 2021, Mandiant Managed Defense observed multiple instances of abuse of Microsoft Exchange Server within at least one client environment. The observed activity included creation of web shells for persistent access, remote code execution, and reconnaissance for endpoint security solutions. Our investigation revealed that the files created on the Exchange servers were owned by the user \u003Cspan class=\u0022code\u0022\u003ENT AUTHORITY\\SYSTEM\u003C\/span\u003E, a privileged local account on the Windows operating system. Furthermore, the process that created the web shell was \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E, the process responsible for Exchange Server’s Unified Messaging Service. In subsequent investigations, we observed malicious files created by \u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E, the process responsible for the Exchange Server web front-end.\u003C\/p\u003E\n\u003Cp\u003EIn response to this activity, we built threat hunting campaigns designed to identify additional Exchange Server abuse. We also utilized this data to build higher-fidelity detections of web server process chains. On March 2, 2021, Microsoft released a \u003Ca href=\u0022https:\/\/www.microsoft.com\/security\/blog\/2021\/03\/02\/hafnium-targeting-exchange-servers\/\u0022\u003Eblog post\u003C\/a\u003E that detailed multiple zero-day vulnerabilities used to attack on-premises versions of Microsoft Exchange Server. Microsoft also issued emergency Exchange Server updates for the following vulnerabilities:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022651\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ERisk Rating\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EAccess Vector\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EExploitability\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EEase of Attack\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMandiant Intel\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26855\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECritical\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunctional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEasy\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004941\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26857\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunctional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEasy\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004938\u0022 adhocenable=\u0022false\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26858\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunctional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEasy\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004944\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-27065\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunctional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEasy\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004939\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 1: List of March 2021 Microsoft Exchange CVEs and FireEye Intel Summaries\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe activity reported by Microsoft aligns with our observations. \u003Cb\u003EFireEye currently tracks this activity in three clusters, UNC2639, UNC2640, and UNC2643. We anticipate additional clusters as we respond to intrusions.\u003C\/b\u003E We recommend following Microsoft’s guidance and patching Exchange Server immediately to mitigate this activity.\u003C\/p\u003E\n\u003Cp\u003EBased on our telemetry, we have identified an array of affected victims including US-based retailers, local governments, a university, and an engineering firm. Related activity may also include a Southeast Asian government and Central Asian telecom. \u003Ca href=\u0022https:\/\/www.microsoft.com\/security\/blog\/2021\/03\/02\/hafnium-targeting-exchange-servers\/\u0022\u003EMicrosoft reported\u003C\/a\u003E the exploitation occurred together and is linked to a single group of actors tracked as “HAFNIUM”, a group that has previously targeted the US-based defense companies, law firms, infectious disease researchers, and think tanks.\u003C\/p\u003E\n\u003Cp\u003EIn this blog post, we will detail our observations on the active investigations we are currently performing. As our experience with and knowledge of this threat actor grows, we will update this post or release new technical details as appropriate. For our Managed Defense Customers, we have launched a Community Protection Event that will provide frequent updates on this threat actor and activity. \u003C\/p\u003E\n\u003Cp\u003EWe will be discussing these attacks more in an \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/475010?utm_source=FireEye\u0026amp;utm_medium=brighttalk\u0026amp;utm_campaign=475010\u0022\u003Eupcoming webinar on Mar. 17, 2021\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003EFrom Exploit to Web Shell\u003C\/h4\u003E\n\u003Cp\u003EBeginning in January 2021, Mandiant Managed Defense observed the creation of web shells on one Microsoft Exchange server file system within a customer’s environment. The web shell, named \u003Cspan class=\u0022code\u0022\u003Ehelp.aspx\u003C\/span\u003E (MD5: 4b3039cf227c611c45d2242d1228a121), contained code to identify the presence of (1) FireEye xAgent, (2) CarbonBlack, or (3) CrowdStrike Falcon endpoint products and write the output of discovery. Figure 1 provides a snippet of the web shell’s code.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Snippet of the web shell help.aspx, crafted to identify the presence of endpoint security software on a victim system\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe web shell was written to the system by the \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E process, which is associated with Microsoft Exchange Server’s Unified Messaging service. This activity suggested exploitation of CVE-2021-26858.\u003C\/p\u003E\n\u003Cp\u003EApproximately twenty days later, the attacker placed another web shell on a separate Microsoft Exchange Server. This second, partially obfuscated web shell, named \u003Cspan class=\u0022code\u0022\u003Eiisstart.aspx\u003C\/span\u003E (MD5: 0fd9bffa49c76ee12e51e3b8ae0609ac), was more advanced and contained functions to interact with the file system. As seen in Figure 2, the web shell included the ability to run arbitrary commands and upload, delete, and view the contents of files.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Snippet of iisstart.aspx, uploaded by the attacker in late January 2021\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWhile the use of web shells is common amongst threat actors, the parent processes, timing, and victim(s) of these files clearly indicate activity that commenced with the abuse of Microsoft Exchange.\u003C\/p\u003E\n\u003Cp\u003EIn March 2021, in a separate environment, we observed a threat actor utilize one or more vulnerabilities to place at least one web shell on the vulnerable Exchange Server. This was likely to establish both persistence and secondary access, as in other environments. In this case, Mandiant observed the process \u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E, (the IIS process associated with the Exchange web front-end) spawning \u003Cspan class=\u0022code\u0022\u003Ecmd.exe\u003C\/span\u003E to write a file to disk. The file, depicted in Figure 3, matches signatures for the tried-and-true \u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/global\/en\/current-threats\/pdfs\/rpt-china-chopper.pdf\u0022\u003EChina Chopper\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Snippet of China Chopper web shell found on a compromised Exchange Server system\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWe observed that in at least two cases, the threat actors subsequently issued the following command against the Exchange web server:\u003C\/p\u003E\n\u003Cp\u003E\u003Cspan class=\u0022code\u0022\u003Enet group \u0026quot;Exchange Organization administrators\u0026quot; administrator \/del \/domain.\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThis command attempts to delete the \u003Cspan class=\u0022code\u0022\u003Eadministrator\u003C\/span\u003E user from the \u003Cspan class=\u0022code\u0022\u003EExchange Organizations administrators\u003C\/span\u003E group, beginning with the Domain Controller in the current domain. If the system is in a single-system domain, it will execute on the local computer.\u003C\/p\u003E\n\u003Cp\u003EPer Microsoft’s blog, they have identified additional post-exploitation activities, including:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ECredential theft via dumping of LSASS process memory.\u003C\/li\u003E\n\u003Cli\u003ECompression of data for exfiltration via 7-Zip.\u003C\/li\u003E\n\u003Cli\u003EUse of Exchange PowerShell Snap-ins to export mailbox data.\u003C\/li\u003E\n\u003Cli\u003EUse of additional offensive security tools \u003Ca href=\u0022https:\/\/github.com\/cobbr\/Covenant\u0022\u003ECovenant\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/samratashok\/nishang\u0022\u003ENishang\u003C\/a\u003E, and \u003Ca href=\u0022https:\/\/github.com\/besimorhino\/powercat\u0022\u003EPowerCat\u003C\/a\u003E for remote access.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe activity we have observed, coupled with others in the information security industry, indicate that these threat actors are likely using Exchange Server vulnerabilities to gain a foothold into environments. This activity is followed quickly by additional access and persistent mechanisms. As previously stated, we have multiple ongoing cases and will continue to provide insight as we respond to intrusions.\u003C\/p\u003E\n\u003Ch4\u003EInvestigation Tips\u003C\/h4\u003E\n\u003Cp\u003EWe recommend checking the following for potential evidence of compromise:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EChild processes of \u003Cspan class=\u0022code\u0022\u003EC:\\Windows\\System32\\inetsrv\\w3wp.exe\u003C\/span\u003E on Exchange Servers, particularly \u003Cspan class=\u0022code\u0022\u003Ecmd.exe\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003EFiles written to the system by \u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E or \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003EASPX files owned by the \u003Cspan class=\u0022code\u0022\u003ESYSTEM\u003C\/span\u003E user\u003C\/li\u003E\n\u003Cli\u003ENew, unexpected compiled ASPX files in the \u003Cspan class=\u0022code\u0022\u003ETemporary ASP.NET Files\u003C\/span\u003E directory\u003C\/li\u003E\n\u003Cli\u003EReconnaissance, vulnerability-testing requests to the following resources from an external IP address:\u003Cul\u003E\n\u003Cli\u003E\u003Cspan class=\u0022code\u0022\u003E\/rpc\/\u003C\/span\u003E directory\u003C\/li\u003E\n\u003Cli\u003E\u003Cspan class=\u0022code\u0022\u003E\/ecp\/DDI\/DDIService.svc\/SetObject\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003ENon-existent resources\u003C\/li\u003E\n\u003Cli\u003EWith suspicious or spoofed HTTP User-Agents\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EUnexpected or suspicious Exchange PowerShell SnapIn requests to export mailboxes\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EIn our investigations to date, the web shells placed on Exchange Servers have been named differently in each intrusion, and thus the file name alone is not a high-fidelity indicator of compromise.\u003C\/p\u003E\n\u003Cp\u003EIf you believe your Exchange Server was compromised, we recommend investigating to determine the scope of the attack and dwell time of the threat actor.\u003C\/p\u003E\n\u003Cp\u003EFurthermore, as system and web server logs may have time or size limits enforced, we recommend preserving the following artifacts for forensic analysis:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EAt least 14 days of HTTP web logs from the \u003Cspan class=\u0022code\u0022\u003Einetpub\\Logs\\LogFiles\u003C\/span\u003E directories (include logs from all subdirectories)\u003C\/li\u003E\n\u003Cli\u003EThe contents of the Exchange Web Server (also found within the \u003Cspan class=\u0022code\u0022\u003Einetpub\u003C\/span\u003E folder)\u003C\/li\u003E\n\u003Cli\u003EAt least 14 days of Exchange Control Panel (ECP) logs, located in \u003Cspan class=\u0022code\u0022\u003EProgram Files\\Microsoft\\Exchange Server\\v15\\Logging\\ECP\\Server\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003EMicrosoft Windows event logs\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EWe have found significant hunting and analysis value in these log folders, especially for suspicious CMD parameters in the ECP Server logs. We will continue updating technical details as we observe more related activity.\u003C\/p\u003E\n\u003Ch4\u003ETechnical Indicators\u003C\/h4\u003E\n\u003Cp\u003EThe following are technical indicators we have observed, organized by the threat groups we currently associate with this activity. To increase investigation transparency, we are including a Last Known True, or LKT, value for network indicators. The LKT timestamp indicates the last time Mandiant knew the indicator was associated with the adversary; however, as with all ongoing intrusions, a reasonable time window should be considered.\u003C\/p\u003E\n\u003Ch5\u003EUNC2639\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022613\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndicator\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EType\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ENote\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E165.232.154.116\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork: IP Address\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast known true: 2021\/03\/02 02:43\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E182.18.152.105\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork: IP Address\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast known true: 2021\/03\/03 16:16\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch5\u003EUNC2640\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndicator\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022118\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EType\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022341\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMD5\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ehelp.aspx\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022118\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFile: Web shell\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022341\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E4b3039cf227c611c45d2242d1228a121\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Eiisstart.aspx\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFile: Web shell\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E0fd9bffa49c76ee12e51e3b8ae0609ac\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch5\u003EUNC2643\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022589\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndicator\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EType\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMD5\/Note\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECobalt Strike BEACON\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFile: Shellcode\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E79eb217578bed4c250803bd573b10151\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E89.34.111.11\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork: IP Address\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast known true: 2021\/03\/03 21:06\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E86.105.18.116\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork: IP Address\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast known true: 2021\/03\/03 21:39\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EDetecting the Techniques\u003C\/h4\u003E\n\u003Cp\u003EFireEye detects this activity across our platforms. The following contains specific detection names that provide an indicator of Exchange Server exploitation or post-exploitation activities we associated with these threat actors.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022695\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EPlatform\u003C\/u\u003E(s)\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EDetection Name\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003ENetwork Security\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EEmail Security\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EDetection\u0026nbsp;On\u0026nbsp;Demand\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EMalware\u0026nbsp;File Scanning\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EMalware\u0026nbsp;File\u0026nbsp;Storage Scanning\u0026nbsp;\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EFEC_Trojan_ASPX_Generic_2\u003C\/li\u003E\n\u003Cli\u003EFE_Webshell_ASPX_Generic_33\u003C\/li\u003E\n\u003Cli\u003EFEC_APT_Webshell_ASPX_HEARTSHELL_1\u003C\/li\u003E\n\u003Cli\u003EExploit.CVE-2021-26855\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEndpoint Security\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EReal-Time (IOC)\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ESUSPICIOUS CODE EXECUTION FROM EXCHANGE SERVER (EXPLOIT)\u003C\/li\u003E\n\u003Cli\u003EASPXSPY WEBSHELL CREATION A (BACKDOOR)\u003C\/li\u003E\n\u003Cli\u003EPROCDUMP ON LSASS.EXE (METHODOLOGY)\u003C\/li\u003E\n\u003Cli\u003ETASKMGR PROCESS DUMP OF LSASS.EXE A (METHODOLOGY)\u003C\/li\u003E\n\u003Cli\u003ENISHANG POWERSHELL TCP ONE LINER (BACKDOOR)\u003C\/li\u003E\n\u003Cli\u003ESUSPICIOUS POWERSHELL USAGE (METHODOLOGY)\u003C\/li\u003E\n\u003Cli\u003EPOWERSHELL DOWNLOADER (METHODOLOGY)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EMalware Protection (AV\/MG)\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ETrojan.Agent.Hafnium.A\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EModule Coverage\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E[Process Guard] - prevents dumping of LSASS memory using the procdump utility.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHelix\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [Unusual Web Server Child Process]\u003C\/li\u003E\n\u003Cli\u003EMICROSOFT EXCHANGE [Authentication Bypass (CVE-2021-26855)]\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n",
        "jcr:lastModified": "Tue Mar 09 2021 18:38:54 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EBeginning in January 2021, we observed multiple instances of abuse of Microsoft Exchange Server stemming from zero-day vulnerabilities.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu Mar 04 2021 23:06:49 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Fri Mar 05 2021 01:55:21 GMT+0000",
      "imageRotate": "0"
    }
  }
}
