{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Tue May 25 2021 14:00:07 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Crimes of Opportunity: Increasing Frequency of Low Sophistication Operational Technology Compromises",
    "jcr:versionHistory": "9de3c04f-7f54-4211-88fb-32ebfdb61619",
    "author": "Keith Lunden",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "fe717b0f-42a7-43d3-b7c9-fb13fa2edf22"
    ],
    "jcr:created": "Tue May 25 2021 14:00:07 GMT+0000",
    "cq:lastModified": "Mon May 24 2021 17:09:07 GMT+0000",
    "jcr:baseVersion": "fe717b0f-42a7-43d3-b7c9-fb13fa2edf22",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:keith-lunden",
      "fireeye-blog-authors:daniel-kapellmann-zafra",
      "fireeye-blog-authors:nathan-brubaker",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:operational-technology",
      "fireeye-blog-tags:threat-intelligence",
      "fireeye-blog-tags:compromise"
    ],
    "jcr:uuid": "e3864f43-d5f7-4e5a-857b-45f4b834d136",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Tue May 25 2021 10:00:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EAttacks on control processes supported by operational technology (OT) are often perceived as necessarily complex. This is because disrupting or modifying a control process to cause a predictable effect is often quite difficult and can require a lot of time and resources. However, Mandiant Threat Intelligence has observed simpler attacks, where actors with varying levels of skill and resources use common IT tools and techniques to gain access to and interact with exposed OT systems.\u003C\/p\u003E\n\u003Cp\u003EThe activity is typically not sophisticated and is normally not targeted against specific organizations. Rather, the compromises appear to be driven by threat actors who are motivated to achieve ideological, egotistical, or financial objectives by taking advantage of an ample supply of internet-connected OT systems. As the actors are not interested in causing specific physical outcomes, they target whatever is available on the internet.\u003C\/p\u003E\n\u003Cp\u003EMandiant has observed an increase in compromises of internet-accessible OT assets over the past several years. In this blog post we discuss previously undisclosed compromises and place them in context alongside publicly known incidents. Although none of these incidents have appeared to significantly impact the physical world, their increasing frequency and relative severity calls for analysis on their possible risks and implications.\u003C\/p\u003E\n\u003Cp\u003EVisit our website to learn more about \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/products\/industrial-systems-and-critical-infrastructure-security.html\u0022\u003EMandiant’s OT security practice\u003C\/a\u003E or contact us directly to request\u0026nbsp;\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/mandiant.html\u0022 adhocenable=\u0022false\u0022\u003EMandiant services\u003C\/a\u003E\u0026nbsp;or\u0026nbsp;\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/mandiant\/threat-intelligence.html\u0022 adhocenable=\u0022false\u0022\u003Ethreat intelligence\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003ECompromises of Internet-Exposed OT Are Increasing in Frequency\u003C\/h4\u003E\n\u003Cp\u003EWhile Mandiant has monitored threat actors claiming to share or sell access to internet-exposed OT systems since at least 2012, we have seen a significant increase in the frequency and relative severity of incidents in the past few years. The most common activity we observe involves actors trying to make money off exposed OT systems, but we also see actors simply sharing knowledge and expertise. More recently, we have observed more low sophistication threat activity leveraging broadly known tactics, techniques, and procedures (TTPs), and commodity tools to access, interact with, or gather information from internet exposed assets—something we had seen very little of in the past.\u003C\/p\u003E\n\u003Cp\u003EThis low sophistication threat activity has impacted a variety of targets across different industries, ranging from solar energy panels and water control systems, to building automation systems (BAS) and home security systems in academic and private residences. While some critical infrastructure targets are very sensitive in nature, other targets present very little risk.\u003C\/p\u003E\n\u003Cp\u003EThe following timeline presents a selection of some public and previously undisclosed OT compromises Mandiant observed between 2020 and early 2021. We note that, although it is possible many of these incidents involved process interaction, high confidence validation is not feasible as most often the evidence is provided by the actor itself.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/crimes-of-opportunity\/fig1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Selection of notable low sophistication OT compromises: January 2020 to April 2021\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ELow Sophistication OT Threat Activity Can Take Many Forms\u003C\/h4\u003E\n\u003Cp\u003EA consistent characteristic we observe among low sophisticated compromises is that actors most often exploit unsecure remote access services, such as virtual network computing (VNC) connections, to remotely access the compromised control systems. Graphical user interfaces (GUI), such as human machine interfaces (HMI), become the low-hanging fruit of process-oriented OT attacks as they provide a user-friendly representation of complex industrial processes, which enables actors to modify control variables without prior knowledge of a process. In many cases, the actors showed evidence of compromised control processes via images of GUIs, IP addresses, system timestamps, and videos.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003ELow Sophistication Threat Actors Access HMIs and Manipulate Control Processes\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EIn March 2020, we analyzed a series of screenshots shared by a threat actor who claimed to compromise dozens of control systems across North America, Western and Central Europe, and East Asia. Based on the timestamps from the images, the actor appeared to gain unauthorized access to these assets over a five-day period. The actor also shared a low-quality cell phone video showing their explicit interaction with a Dutch-language temperature control system.\u003C\/p\u003E\n\u003Cp\u003EWhile much of this type of activity appears opportunistic in nature, some may also be driven by political motivations. For example, we have seen hacktivist groups that frequently use anti-Israel\/pro-Palestine rhetoric in social media posts share images indicating that they had compromised OT assets in Israel, including a solar energy asset and the webserver of a datalogger used for different applications such as mining exploration and dam surveillance (Figure 2).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/crimes-of-opportunity\/fig2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Screenshots of compromised web-interfaces supporting OT\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ESome threat actors appear particularly eager to demonstrate their interaction with compromised control systems. One threat actor shared multiple screen recordings making arbitrary set point changes to compromised HMIs via remote connections from their own desktop. While we suspect many of the victims compromised by this threat actor were small- and medium-sized businesses, on one occasion the group appeared to have successfully accessed the BAS of a hotel in Australia belonging to a major international hotel chain (Figure 3).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/crimes-of-opportunity\/fig3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Screenshots showing a possible compromise of a hotel BAS\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003ESome Amateur Actors Show Limited OT Expertise\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ESome of the actors we track made comments that indicated they had either a limited understanding of the OT assets they compromised or that they were simply attempting to gain notoriety. For example, one threat actor shared a screenshot of a purportedly compromised German-language rail control system. We conducted a reverse image search of the screenshot and identified the asset as the web interface for an ECoS 50210 command station designed for model train sets (Figure 4).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/crimes-of-opportunity\/fig4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: “Rail control system” that was really a web-interface for a model train set\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EAnother group made a similar gaffe when they claimed to retaliate for \u003Ca href=\u0022https:\/\/www.nytimes.com\/2020\/06\/29\/world\/middleeast\/iran-missile-explosion.html\u0022\u003Ean explosion at a missile facility in Iran\u003C\/a\u003E by compromising an Israeli “gas system.” A video of their operation showed that they had actually compromised a kitchen ventilation system installed at a restaurant in Ramat Hasharon, Israel (Figure 5).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/crimes-of-opportunity\/fig5.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: “Gas system” that was really a kitchen ventilation system\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003ELow Sophistication OT Threat Activity is Supported by Hacktivist Tutorials\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EIn a few instances, actors operating as part of hacktivist collectives created and shared tutorials that instructed their affiliates and sympathetic parties on how to identify and compromise internet-accessible OT assets. The tutorials typically described simple methodologies, such as using VNC utilities to connect to IP addresses identified in Shodan or Censys searches for port 5900. These methods appear to have been used in some of the incidents we described, as some of the shared screenshots of compromised OT systems also showed the actor’s web browser tabs displaying similar Shodan queries and remote access tools.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/crimes-of-opportunity\/fig6.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 6: Hacktivist tutorial describing how to access the HMI of an industrial gas and liquid burner\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ELow Sophistication OT Compromises Pose A Growing Risk\u003C\/h4\u003E\n\u003Cp\u003EEach of the low sophistication incidents we observe is unique and poses a different level of risk, which we normally determine by examining the actor’s previous work and reputation, the target’s industry, and the nature of the compromised process, among other things. While low sophistication incidents do not appear to commonly impact physical environments, they remain concerning for the following reasons.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EEach incident provides threat actors with opportunities to learn more about OT, such as the underlying technology, physical processes, and operations. These opportunities can increase an adversary\u0027s ability and enhance their tradecraft.\u003C\/li\u003E\n\u003Cli\u003EEven low-sophistication intrusions into OT environments carry the risk of disruption to physical processes, mainly in the case of industries or organizations with less mature security practices. As the number of intrusions increase, so does the risk of process disruption.\u003C\/li\u003E\n\u003Cli\u003EThe publicity of these incidents normalizes cyber operations against OT and may encourage other threat actors to increasingly target or impact these systems. This is consistent with \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/07\/financially-motivated-actors-are-expanding-access-into-ot.html\u0022 adhocenable=\u0022false\u0022\u003Ethe increase in OT activity by more resourced financially-motivated groups and ransomware operators.\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003ESecurity Best Practices and Situational Awareness Help Prevent Low Sophistication Compromises\u003C\/h4\u003E\n\u003Cp\u003EDefense against low sophistication compromises is best addressed by implementing security best practices and gaining situational awareness about the threat exposure of assets and data. Implementing security controls to defend against this activity is also the foundation for mature security programs that seek to prevent and identify complex OT threats before they introduce a risk to the safety of people and infrastructure.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWhenever feasible, remove OT assets from public-facing networks. If remote access is required, deploy access controls and monitor traffic for unusual activity to minimize unintended interaction and safeguard asset information.\u003C\/li\u003E\n\u003Cli\u003EApply common network-hardening techniques to remotely accessible and edge devices, such as disabling unused services, changing default credentials, reviewing asset configurations, and creating whitelists for access.\u003C\/li\u003E\n\u003Cli\u003EDetermine if relevant assets are discoverable using online scanners such as Shodan and Censys. Leverage support from knowledgeable security researchers to identify exposed assets and leaked information. Mandiant Threat Intelligence offers subscription content, custom analysis, and black box assessments that help organizations identify internet-exposed assets and information.\u003C\/li\u003E\n\u003Cli\u003EMaintain situational awareness on threat actors’ interest in cyber physical systems and the development of \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/03\/monitoring-ics-cyber-operation-tools-and-software-exploit-modules.html\u0022 adhocenable=\u0022false\u0022\u003EOT exploits\u003C\/a\u003E, with particular interest in attention driven to your organization, third party providers, or original equipment manufacturers (OEM).\u003C\/li\u003E\n\u003Cli\u003EConfigure HMIs and other control system assets to enforce acceptable input ranges and prohibit hazardous variable states. Similar to web application security, automation programmers should treat all operator input as potentially malicious and gain security assurances by validating that the operator input is within acceptable thresholds.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EVisit our website to learn more about \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/products\/industrial-systems-and-critical-infrastructure-security.html\u0022\u003EMandiant’s OT security practice\u003C\/a\u003E or contact us directly to request\u0026nbsp;\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/mandiant.html\u0022 adhocenable=\u0022false\u0022\u003EMandiant services\u003C\/a\u003E\u0026nbsp;or\u0026nbsp;\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/mandiant\/threat-intelligence.html\u0022 adhocenable=\u0022false\u0022\u003Ethreat intelligence\u003C\/a\u003E.\u003C\/p\u003E\n",
        "jcr:lastModified": "Mon May 24 2021 17:03:46 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe take a look at simple attacks against OT systems, where actors with varying levels of skill and resources use common IT tools and techniques.\u003C\/p\u003E\n",
      "jcr:lastModified": "Mon May 24 2021 17:05:09 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon May 24 2021 17:09:07 GMT+0000",
      "imageRotate": "0"
    }
  }
}
