{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed Jun 09 2021 21:46:32 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Erkennung von und Reaktion auf die Ausnutzung von Microsoft Exchange-spezifischen Zero-Day-Schwachstellen",
    "jcr:versionHistory": "c42c73fc-54fb-4f4e-8654-d967dba5f229",
    "author": "Matt Bromiley",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
    "jcr:language": "de_de",
    "jcr:predecessors": [
      "0ac97e2a-c1a8-4373-942d-f8c92d1a13d0"
    ],
    "jcr:created": "Wed Jun 09 2021 21:46:32 GMT+0000",
    "cq:lastModified": "Wed Jun 09 2021 21:46:28 GMT+0000",
    "jcr:baseVersion": "0ac97e2a-c1a8-4373-942d-f8c92d1a13d0",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:matt-bromiley",
      "fireeye-blog-authors:cap-chris-digamo",
      "fireeye-blog-authors:andrew-thompson",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:zero-day",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:microsoft",
      "fireeye-blog-tags:managed-defense",
      "fireeye-blog-authors:robert-wallace"
    ],
    "jcr:lastModified": "Tue Jun 08 2021 16:47:06 GMT+0000",
    "jcr:uuid": "f57e6ede-c4bc-4059-9c43-a7b953232cd6",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Mar 04 2021 14:30:00 GMT-0800",
    "cq:lastModifiedBy": "lynda.hall@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
        "text": "\u003Cp\u003ESeit Januar\u0026nbsp;2021 hat das \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/de_DE\/mandiant\/managed-detection-and-response.html\u0022\u003EMandiant Managed Defense\u003C\/a\u003E-Team mehrere Fälle von Missbrauch von Microsoft Exchange Server in mindestens einer Kundenumgebung beobachtet. Die beobachteten Aktivitäten umfassen die Erstellung von Webshells für dauerhaften Zugänge, die Remote-Ausführung von Code und die Erkennung von Endpunkt-Sicherheitslösungen. Unsere erste Untersuchung ergab, dass die auf den Exchange-Servern erstellten Dateien im Besitz des Benutzers \u003Cspan class=\u0022code\u0022\u003ENT\u0026nbsp;AUTHORITY\\SYSTEM\u003C\/span\u003E waren, einem lokalen Konto mit privilegierten Zugriffsrechten auf dem Windows-Betriebssystem. Außerdem handelte es sich bei dem Prozess, der die Webshell erstellte (\u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E) um den Prozess, der für den Unified Messaging Service von Exchange\u0026nbsp;Server verantwortlich ist. Bei weiteren Untersuchungen beobachteten wir schädliche Dateien, die von \u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E erstellt wurden, dem Prozess, der für das Web-Frontend von Exchange\u0026nbsp;Server verantwortlich ist.\u003C\/p\u003E\n\u003Cp\u003EAls Reaktion auf diese Aktivität erstellten wir Kampagnen zur Bedrohungssuche, um weitere Fälle von Exchange\u0026nbsp;Server-Missbrauch zu identifizieren. Wir nutzten diese Daten auch, um eine genauere Erkennung von Webserver-Prozessketten zu erreichen. Am 2.\u0026nbsp;März\u0026nbsp;2021 veröffentlichte Microsoft einen \u003Ca href=\u0022https:\/\/www.microsoft.com\/security\/blog\/2021\/03\/02\/hafnium-targeting-exchange-servers\/\u0022\u003EBlogpost\u003C\/a\u003E, in dem mehrere Zero-Day-Schwachstellen beschrieben wurden, die für Angriffe auf lokale Versionen von Microsoft\u0026nbsp;Exchange\u0026nbsp;Server verwendet werden. Microsoft gab außerdem Notfall-Updates für Exchange\u0026nbsp;Server für die folgenden Sicherheitslücken heraus:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022651\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ERisikobewertung\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EZugriffsvektor\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EAusnutzbarkeit\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ELeichtigkeit der Ausführung\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EWeitere Infos von Mandiant\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26855\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EKritisch\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunktional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEinfach\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004941\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26857\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMittel\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunktional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEinfach\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004938\u0022 adhocenable=\u0022false\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26858\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMittel\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunktional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEinfach\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004944\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-27065\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMittel\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFunktional\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEinfach\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004939\u0022\u003ELink\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETabelle 1: Liste der Microsoft Exchange-CVEs vom März 2021 und Zusammenfassung der FireEye-Daten\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EDie von Microsoft gemeldete Aktivität deckt sich mit unseren Beobachtungen. \u003Cb\u003EFireEye verfolgt diese Aktivität derzeit in drei Clustern: UNC2639, UNC2640 und UNC2643. Wir rechnen damit, bei der Reaktion auf die Angriffe auf weitere Cluster zu stoßen.\u003C\/b\u003E Wir empfehlen, die Anweisungen von Microsoft zu befolgen und Exchange\u0026nbsp;Server sofort zu patchen, um diese Aktivität einzudämmen.\u003C\/p\u003E\n\u003Cp\u003EBasierend auf unseren Telemetriedaten haben wir eine Reihe von Betroffenen identifiziert, darunter in den USA ansässige Einzelhändler, Behörden, eine Universität und ein Ingenieurbüro. Möglicherweise sind auch eine südostasiatische Regierung und ein zentralasiatisches Telekommunikationsunternehmen betroffen. \u003Ca href=\u0022https:\/\/www.microsoft.com\/security\/blog\/2021\/03\/02\/hafnium-targeting-exchange-servers\/\u0022\u003EMicrosoft berichtet\u003C\/a\u003E, dass die Angriffe gleichzeitig stattfanden und mit einer einzigen Gruppe von Akteuren in Verbindung stehen, die als „HAFNIUM“ verfolgt wird. Dies ist eine Gruppe, die bereits zuvor in den USA ansässige Verteidigungsunternehmen, Anwaltskanzleien, Forscher von Infektionskrankheiten und Think Tanks ins Visier genommen hat.\u003C\/p\u003E\n\u003Cp\u003EIn diesem Blogbeitrag stellen wir unsere Beobachtungen zu unseren momentan stattfindenden Untersuchungen vor. Sobald wir weitere Erkenntnisse über diesen Angreifer haben, werden wir diesen Beitrag aktualisieren oder neue technische Details veröffentlichen. Für unsere Managed\u0026nbsp;Defense-Kunden haben wir ein Community Protection Event ins Leben gerufen, das regelmäßige Updates zu diesem Angreifer und seinen Aktivitäten liefern wird.\u003C\/p\u003E\n\u003Cp\u003EIn einem \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/475010?utm_source=FireEye\u0026amp;utm_medium=brighttalk\u0026amp;utm_campaign=475010\u0022\u003EWebinar am 17.\u0026nbsp;März 2021\u003C\/a\u003E erläutern wir diese Angriffe näher.\u003C\/p\u003E\n\u003Ch4\u003EVom Exploit zur Webshell\u003C\/h4\u003E\n\u003Cp\u003ESeit Januar\u0026nbsp;2021 beobachtete das Mandiant Managed Defense-Team die Erstellung von Webshells auf einem Microsoft Exchange Server-Dateisystem in der Umgebung eines Kunden. Die Webshell mit dem Namen \u003Cspan class=\u0022code\u0022\u003Ehelp.aspx\u003C\/span\u003E (MD5: 4b3039cf227c611c45d2242d1228a121) enthielt Code zur Identifizierung von Endpunktprodukten mit (1)\u0026nbsp;FireEye\u0026nbsp;xAgent, (2)\u0026nbsp;CarbonBlack oder (3)\u0026nbsp;CrowdStrike Falcon und zur Ausgabe dieser Informationen. Abbildung 1 zeigt einen Ausschnitt aus dem Code der Webshell.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EAbbildung 1: Ausschnitt aus der Webshell help.aspx, die erstellt wurde, um das Vorhandensein von Endpunkt-Sicherheitssoftware auf einem System zu erkennen\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EDie Webshell wurde von dem Prozess \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E ins System geschrieben, der mit dem Unified Messaging-Dienst von Microsoft\u0026nbsp;Exchange\u0026nbsp;Server verbunden ist. Diese Aktivität deutete auf die Ausnutzung von CVE-2021-26858 hin.\u003C\/p\u003E\n\u003Cp\u003EUngefähr zwanzig Tage später platzierte der Angreifer eine weitere Webshell auf einem separaten Microsoft\u0026nbsp;Exchange-Server. Diese zweite, teilweise verschleierte Webshell mit dem Namen \u003Cspan class=\u0022code\u0022\u003Eiisstart.aspx\u003C\/span\u003E (MD5: 0fd9bffa49c76ee12e51e3b8ae0609ac) war komplexer und enthielt Funktionen zur Interaktion mit dem Dateisystem. Wie in Abbildung\u0026nbsp;2 zu sehen ist, beinhaltete die Webshell die Möglichkeit, beliebige Befehle auszuführen und den Inhalt von Dateien hochzuladen, zu löschen und einzusehen.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EAbbildung 2: Ausschnitt der Datei iisstart.aspx, die der Angreifer Ende Januar\u0026nbsp;2021 hochgeladen hat\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWährend die Verwendung von Webshells unter Angreifern üblich ist, weisen die übergeordneten Prozesse, der Zeitpunkt und die Art der betroffenen Unternehmen eindeutig darauf hin, dass die Aktivitäten mit dem Missbrauch von Microsoft\u0026nbsp;Exchange begannen.\u003C\/p\u003E\n\u003Cp\u003EIm März 2021 beobachteten wir in einer separaten Umgebung, wie ein Angreifer eine oder mehrere Schwachstellen ausnutzte, um mindestens eine Webshell auf dem anfälligen Exchange-Server zu platzieren. Dies geschah wahrscheinlich, um sowohl Persistenz als auch sekundären Zugriff zu etablieren, wie in anderen Umgebungen. In diesem Fall beobachtete Mandiant, dass der Prozess \u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E (der IIS-Prozess, der mit dem Exchange-Web-Frontend verbunden ist) \u003Cspan class=\u0022code\u0022\u003Ecmd.exe\u003C\/span\u003E startete, um eine Datei auf die Festplatte zu schreiben. Die in Abbildung\u0026nbsp;3 dargestellte Datei entspricht den Signaturen der berüchtigten Webshell \u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/global\/en\/current-threats\/pdfs\/rpt-china-chopper.pdf\u0022\u003EChina Chopper\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EAbbildung 3: Ausschnitt der Webshell „China Chopper“, die auf einem kompromittierten Exchange Server-System gefunden wurde\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWir beobachteten, dass die Angreifer in mindestens zwei Fällen anschließend den folgenden Befehl gegen den Exchange-Webserver ausführten:\u003C\/p\u003E\n\u003Cp\u003E\u003Cspan class=\u0022code\u0022\u003Enet group \u0026quot;Exchange Organization administrators\u0026quot; administrator \/del \/domain.\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EDieser Befehl versucht, den Benutzer \u003Cspan class=\u0022code\u0022\u003Eadministrator\u003C\/span\u003E aus der Gruppe \u003Cspan class=\u0022code\u0022\u003EExchange Organizations administrators\u003C\/span\u003E zu löschen, beginnend mit dem Domain-Controller in der aktuellen Domain. Wenn sich das System in einer Einzelsystemdomäne befindet, wird er auf dem lokalen Computer ausgeführt.\u003C\/p\u003E\n\u003Cp\u003ELaut dem Microsoft-Blog wurden zusätzliche Aktivitäten nach der Ausnutzung identifiziert, darunter:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EDiebstahl von Anmeldeinformationen durch Dumping des LSASS-Prozessspeichers\u003C\/li\u003E\n\u003Cli\u003EKomprimierung von Daten zur Exfiltration über 7-Zip\u003C\/li\u003E\n\u003Cli\u003EVerwendung von Exchange PowerShell-Snap-ins zum Exportieren von Postfachdaten\u003C\/li\u003E\n\u003Cli\u003EVerwendung der zusätzlichen offensiven Sicherheits-Tools \u003Ca href=\u0022https:\/\/github.com\/cobbr\/Covenant\u0022\u003ECovenant\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/samratashok\/nishang\u0022\u003ENishang\u003C\/a\u003E und \u003Ca href=\u0022https:\/\/github.com\/besimorhino\/powercat\u0022\u003EPowerCat\u003C\/a\u003E für den Fernzugriff\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EDie von uns beobachteten Aktivitäten und andere Erkenntnisse aus der Informationssicherheitsbranche deuten darauf hin, dass diese Angreifer wahrscheinlich Schwachstellen von Exchange\u0026nbsp;Server ausnutzen, um in Umgebungen Fuß zu fassen. Auf diese Aktivität folgen schnell weitere Zugriffs- und Persistenzmechanismen. Wie bereits erwähnt, haben wir mehrere laufende Fälle und werden weiterhin Einblicke geben, wenn wir auf Eindringlinge reagieren.\u003C\/p\u003E\n\u003Ch4\u003ETipps zur Untersuchung\u003C\/h4\u003E\n\u003Cp\u003EWir empfehlen, Folgendes auf mögliche Anzeichen für eine Kompromittierung zu überprüfen:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ETochterprozesse von \u003Cspan class=\u0022code\u0022\u003EC:\\Windows\\System32\\inetsrv\\w3wp.exe\u003C\/span\u003E auf Exchange-Servern, insbesondere \u003Cspan class=\u0022code\u0022\u003Ecmd.exe\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003EDateien, die von \u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E oder \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E ins System geschrieben werden\u003C\/li\u003E\n\u003Cli\u003EASPX-Dateien, die dem Benutzer \u003Cspan class=\u0022code\u0022\u003ESYSTEM\u003C\/span\u003E gehören\u003C\/li\u003E\n\u003Cli\u003ENeue, unerwartet kompilierte ASPX-Dateien im Verzeichnis \u003Cspan class=\u0022code\u0022\u003ETemporary ASP.NET Files\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003EAuf Sicherheitslücken testende Ausspähungsanfragen von einer externen IP-Adresse:\u003Cul\u003E\n\u003Cli\u003EAnfrage an Verzeichnis \u003Cspan class=\u0022code\u0022\u003E\/rpc\/\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Cspan class=\u0022code\u0022\u003EAnfrage an \/ecp\/DDI\/DDIService.svc\/SetObject\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003EAnfrage an nicht existierende Ressourcen\u003C\/li\u003E\n\u003Cli\u003EAnfrage mit verdächtigen oder gefälschten HTTP-Benutzer-Agents\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EUnerwartete oder verdächtige Exchange PowerShell SnapIn-Anfragen zum Exportieren von Postfächern\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EBei unseren bisherigen Untersuchungen wurden die auf Exchange-Servern platzierten Webshells bei jedem Eindringen anders benannt. Der Dateiname allein ist also kein zuverlässiger Gefahrenindikator.\u003C\/p\u003E\n\u003Cp\u003EWenn Sie glauben, dass Ihr Exchange-Server kompromittiert wurde, empfehlen wir eine Untersuchung, um den Umfang des Angriffs und die Verweildauer des Angreifers zu ermitteln.\u003C\/p\u003E\n\u003Cp\u003EDa für System- und Webserver-Protokolle möglicherweise Zeit- oder Größenbeschränkungen gelten, empfehlen wir außerdem, die folgenden Artefakte für die forensische Analyse aufzubewahren:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EHTTP-Webprotokolle mindestens der letzten 14\u0026nbsp;Tage aus den Verzeichnissen unter \u003Cspan class=\u0022code\u0022\u003Einetpub\\Logs\\LogFiles\u003C\/span\u003E (einschließlich Protokolle aus allen Unterverzeichnissen)\u003C\/li\u003E\n\u003Cli\u003Eden Inhalt des Exchange-Webservers (ebenfalls im Ordner \u003Cspan class=\u0022code\u0022\u003Einetpub\u003C\/span\u003E)\u003C\/li\u003E\n\u003Cli\u003Edie Exchange Control Panel (ECP)-Protokolle mindestens der letzten 14\u0026nbsp;Tage, die sich in \u003Cspan class=\u0022code\u0022\u003EProgrammdateien\\Microsoft\\Exchange Server\\v15\\Logging\\ECP\\Server\u003C\/span\u003E befinden\u003C\/li\u003E\n\u003Cli\u003EMicrosoft Windows-Ereignisprotokolle\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EWir haben in diesen Protokollordnern einen bedeutenden Such- und Analysewert gefunden, insbesondere für verdächtige CMD-Parameter in den ECP-Server-Protokollen. Wir werden die technischen Details weiter aktualisieren, sobald wir weitere diesbezügliche Aktivitäten beobachten.\u003C\/p\u003E\n\u003Ch4\u003ETechnische Indikatoren\u003C\/h4\u003E\n\u003Cp\u003EIm Folgenden finden Sie technische Indikatoren, die wir beobachtet haben, geordnet nach den Bedrohungsgruppen, die wir derzeit mit dieser Aktivität in Verbindung bringen. Um die Untersuchungstransparenz zu erhöhen, fügen wir einen Last Known True (LKT)-Wert für Netzwerkindikatoren hinzu. Der LKT-Zeitstempel gibt den letzten Zeitpunkt an, zu dem der Indikator nach Kenntnis von Mandiant vom Angreifer genutzt wurde. Wie bei allen laufenden Sicherheitsvorfällen sollte jedoch ein angemessenes Zeitfenster berücksichtigt werden.\u003C\/p\u003E\n\u003Ch5\u003EUNC2639\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022613\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndikator\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ETyp\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EHinweis\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E165.232.154.116\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk: IP-Adresse\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast Known True: 02.03.2021 02:43\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E182.18.152.105\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk: IP-Adresse\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast Known True: 03.03.2021 16:16\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch5\u003EUNC2640\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndikator\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022118\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ETyp\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022341\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMD5\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ehelp.aspx\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022118\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EDatei: Webshell\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022341\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E4b3039cf227c611c45d2242d1228a121\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Eiisstart.aspx\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EDatei: Webshell\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E0fd9bffa49c76ee12e51e3b8ae0609ac\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch5\u003EUNC2643\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022589\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndikator\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ETyp\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMD5\/Hinweis\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECobalt Strike BEACON\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EDatei: Shellcode\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E79eb217578bed4c250803bd573b10151\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E89.34.111.11\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk: IP-Adresse\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast Known True: 03.03.2021 21:06\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E86.105.18.116\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetzwerk: IP-Adresse\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELast Known True: 03.03.2021 21:39\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EErkennen der Techniken\u003C\/h4\u003E\n\u003Cp\u003EDie Erkennung dieser Aktivitäten durch FireEye erfolgt plattformübergreifend. Im Folgenden finden Sie spezifische Erkennungsnamen, die einen Hinweis auf die Ausnutzung von Exchange\u0026nbsp;Server oder auf Aktivitäten nach der Ausnutzung geben, die wir mit diesen Angreifern in Verbindung bringen.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022695\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EPlattform\u003C\/u\u003E(en)\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EErkennungsname\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003ENetwork Security\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EEmail Security\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EDetection\u0026nbsp;On\u0026nbsp;Demand\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003ESuche nach Malware in Dateien\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003ESuche nach Malware in Dateispeichern\u0026nbsp;\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EFEC_Trojan_ASPX_Generic_2\u003C\/li\u003E\n\u003Cli\u003EFE_Webshell_ASPX_Generic_33\u003C\/li\u003E\n\u003Cli\u003EFEC_APT_Webshell_ASPX_HEARTSHELL_1\u003C\/li\u003E\n\u003Cli\u003EExploit.CVE-2021-26855\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEndpoint Security\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EEchtzeit (IOC)\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ESUSPICIOUS CODE EXECUTION FROM EXCHANGE SERVER (EXPLOIT)\u003C\/li\u003E\n\u003Cli\u003EASPXSPY WEBSHELL CREATION A (BACKDOOR)\u003C\/li\u003E\n\u003Cli\u003EPROCDUMP ON LSASS.EXE (METHODE)\u003C\/li\u003E\n\u003Cli\u003ETASKMGR PROCESS DUMP OF LSASS.EXE A (METHODE)\u003C\/li\u003E\n\u003Cli\u003ENISHANG POWERSHELL TCP ONE LINER (BACKDOOR)\u003C\/li\u003E\n\u003Cli\u003ESUSPICIOUS POWERSHELL USAGE (METHODE)\u003C\/li\u003E\n\u003Cli\u003EPOWERSHELL DOWNLOADER (METHODE)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EMalware-Schutz (AV\/MG)\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ETrojan.Agent.Hafnium.A\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EModulschutz\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E[Process Guard]\u0026nbsp;– verhindert das Dumping des LSASS-Speichers mit dem Dienstprogramm procdump\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHelix\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EWINDOWS-METHODE [ungewöhnlicher untergeordneter Webserver-Prozess]\u003C\/li\u003E\n\u003Cli\u003EMICROSOFT EXCHANGE [Authentifizierungs-Bypass (CVE-2021-26855)]\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n",
        "jcr:lastModified": "Wed Jun 09 2021 21:46:11 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003ESeit Januar 2021 haben wir mehrere Fälle von Missbrauch von Microsoft Exchange Server beobachtet, die auf Zero-Day-Schwachstellen zurückzuführen sind.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu Mar 04 2021 23:06:49 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
      "jcr:lastModified": "Wed Jun 09 2021 21:46:28 GMT+0000",
      "imageRotate": "0"
    }
  }
}
