{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Mon Jul 13 2020 18:30:59 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "SCANdalous! (External Detection Using Network Scan Data and Automation)",
    "jcr:versionHistory": "d16e86f4-e1ea-4bd3-a2fc-6a3a1f980959",
    "author": "Aaron Stephens",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "37e68ad6-d659-44fa-8d7f-8cc32a846bef"
    ],
    "jcr:created": "Fri Jul 24 2020 07:20:31 GMT+0000",
    "cq:lastModified": "Fri Jul 24 2020 07:20:13 GMT+0000",
    "jcr:baseVersion": "37e68ad6-d659-44fa-8d7f-8cc32a846bef",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:aaron-stephens",
      "fireeye-blog-authors:andrew-thompson",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:analysis",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:detection",
      "fireeye-blog-tags:automation",
      "fireeye-blog-tags:data"
    ],
    "jcr:uuid": "bf69a798-e4ea-45f8-9043-2aab24813f8d",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Jul 13 2020 14:30:00 GMT-0400",
    "cq:lastModifiedBy": "reference-adjustment-service",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Ch4\u003EReal Quick\u003C\/h4\u003E\n\u003Cp\u003EIn case you’re thrown by that fantastic title, our lawyers made us change the name of this project so we wouldn’t get sued. SCANdalous—a.k.a. Scannah Montana a.k.a. Scanny McScanface a.k.a. “Scan I Kick It? (Yes You Scan)”—had another name before today that, for legal reasons, we’re keeping to ourselves. A special thanks to our legal team who is always looking out for us, this blog post would be a lot less fun without them. Strap in folks.\u003C\/p\u003E\n\u003Ch4\u003EIntroduction\u003C\/h4\u003E\n\u003Cp\u003EAdvanced Practices is known for using primary source data obtained through \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/mandiant\/incident-response.html\u0022\u003EMandiant Incident Response\u003C\/a\u003E, \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/mandiant\/managed-detection-and-response.html\u0022\u003EManaged Defense\u003C\/a\u003E, and product telemetry across thousands of FireEye clients. Regular, first-hand observations of threat actors afford us opportunities to learn intimate details of their modus operandi. While our visibility from organic data is vast, we also derive value from third-party data sources. By looking outwards, we extend our visibility beyond our clients’ environments and shorten the time it takes to detect adversaries in the wild—often before they initiate intrusions against our clients.\u003C\/p\u003E\n\u003Cp\u003EIn October 2019, Aaron Stephens gave his \u003Ca href=\u0022https:\/\/www.youtube.com\/watch?v=x1tEOkY-7JE\u0022\u003E“Scan’t Touch This”\u003C\/a\u003E talk at the annual FireEye Cyber Defense Summit (slides available \u003Ca href=\u0022https:\/\/github.com\/aaronst\/talks\/blob\/master\/scanttouchthis.pdf\u0022\u003Eon his Github\u003C\/a\u003E). He discussed using network scan data for external detection and provided examples of how to profile command and control (C2) servers for various post-exploitation frameworks used by criminal and intelligence organizations alike. However, manual application of those techniques doesn’t scale. It may work if your role focuses on one or two groups, but Advanced Practices’ scope is much broader. We needed a solution that would enable us to track thousands of groups, malware families and profiles. In this blog post we’d like to talk about that journey, highlight some wins, and for the first time publicly, introduce the project behind it all: SCANdalous.\u003C\/p\u003E\n\u003Ch4\u003EPre-SCANdalous Case Studies\u003C\/h4\u003E\n\u003Cp\u003EPrior to any sort of system or automation, our team used traditional profiling methodologies to manually identify servers of interest. The following are some examples. The success we found in these case studies served as the primary motivation for SCANdalous.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EAPT39 SSH Tunneling\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAfter observing APT39 in a series of intrusions, we determined they frequently created \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/01\/bypassing-network-restrictions-through-rdp-tunneling.html\u0022 adhocenable=\u0022false\u0022\u003ESecure Shell (SSH) tunnels with PuTTY Link to forward Remote Desktop Protocol\u003C\/a\u003E connections to internal hosts within the target environment. Additionally, they preferred using BitVise SSH servers listening on port 443. Finally, they were using servers hosted by WorldStream B.V.\u003C\/p\u003E\n\u003Cp\u003EIndependent isolation of any one of these characteristics would produce a lot of unrelated servers; however, the aggregation of characteristics provided a strong signal for newly established infrastructure of interest. We used this established profile and others to illuminate dozens of servers we later attributed to \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/01\/apt39-iranian-cyber-espionage-group-focused-on-personal-information.html\u0022 adhocenable=\u0022false\u0022\u003EAPT39\u003C\/a\u003E, often before they were used against a target.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EAPT34 QUADAGENT\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EIn February 2018, an independent researcher shared a sample of what would later be named QUADAGENT. We had not observed it in an intrusion yet; however, by analyzing the characteristics of the C2, we were able to develop a strong profile of the servers to track over time. For example, our team identified the server \u003Cspan class=\u0022code\u0022\u003E185.161.208\\.37\u003C\/span\u003E and domain \u003Cspan class=\u0022code\u0022\u003Erdppath\\.com\u003C\/span\u003E within hours of it being established. A week later, we identified a QUADAGENT dropper with the previously identified C2. Additional examples of QUADAGENT are depicted in Figure 1.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/scandalous\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: QUADAGENT C2 servers in the Shodan user interface\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EFive days after the QUADAGENT dropper was identified, Mandiant was engaged by a victim that was targeted via the same C2. This activity was later attributed to APT34. During the investigation, Mandiant uncovered APT34 using RULER.HOMEPAGE. This was the first time our consultants observed the tool and technique used in the wild by a real threat actor. Our team developed a profile of servers hosting HOMEPAGE payloads and began tracking their deployment in the wild. Figure 2 shows a timeline of QUADAGENT C2 servers discovered between February and November of 2018.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/scandalous\/Picture2a.jpg\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 2: Timeline of QUADAGENT C2 servers discovered throughout 2018\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EAPT33 RULER.HOMEPAGE, POSHC2, and POWERTON\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EA month after that aforementioned intrusion, Managed Defense discovered a threat actor using RULER.HOMEPAGE to download and execute POSHC2. All the RULER.HOMEPAGE servers were previously identified due to our efforts. Our team developed a profile for POSHC2 and began tracking their deployment in the wild. The threat actor pivoted to a novel PowerShell backdoor, POWERTON. Our team repeated our workflow and began illuminating those C2 servers as well. This activity was later attributed to APT33 and was documented in our\u0026nbsp;\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2018\/12\/overruled-containing-a-potentially-destructive-adversary.html\u0022\u003EOVERRULED\u0026nbsp;post\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003ESCANdalous\u003C\/h4\u003E\n\u003Cp\u003E\u003Ci\u003EScanner, Better, Faster, Stronger\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EOur use of scan data was proving wildly successful, and we wanted to use more of it, but we needed to innovate. How could we leverage this dataset and methodology to track not one or two, but dozens of active groups that we observe across our solutions and services? Even if every member of Advanced Practices was dedicated to external detection, we would still not have enough time or resources to keep up with the amount of manual work required. But that’s the key word: \u003Ci\u003EManual\u003C\/i\u003E. Our workflow consumed hours of individual analyst actions, and we had to change that. This was the beginning of SCANdalous: An automated system for external detection using third-party network scan data.\u003C\/p\u003E\n\u003Cp\u003EA couple of nice things about computers: They’re great at multitasking, and they don’t forget. The tasks that were taking us hours to do—if we had time, and if we remembered to do them every day—were now taking SCANdalous minutes if not seconds. This not only afforded us additional time for analysis, it gave us the capability to expand our scope. Now we not only look for specific groups, we also search for common malware, tools and frameworks in general. We deploy weak signals (or broad signatures) for software that isn’t inherently bad, but is often used by threat actors.\u003C\/p\u003E\n\u003Cp\u003EOur external detection was further improved by automating additional collection tasks, executed by SCANdalous upon a discovery—we call them follow-on actions. For example, if an interesting open directory is identified, acquire certain files. These actions ensure the team never misses an opportunity during “non-working hours.” If SCANdalous finds something interesting on a weekend or holiday, we know it will perform the time-sensitive tasks against the server and in defense of our clients.\u003C\/p\u003E\n\u003Cp\u003EThe data we collect not only helps us track things we aren’t seeing at our clients, it allows us to provide timely and historical context to our incident responders and security analysts. Taking observations from Mandiant Incident Response or Managed Defense and distilling them into knowledge we can carry forward has always been our bread and butter. Now, with SCANdalous in the mix, we can project that knowledge out onto the Internet as a whole.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003ECollection Metrics\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ELooking back on where we started with our manual efforts, we’re pleased to see how far this project has come, and is perhaps best illustrated by examining the numbers. Today (and as we write these continue to grow), SCANdalous holds over five thousand signatures across multiple sources, covering dozens of named malware families and threat groups. Since its inception, SCANdalous has produced over two million hits. Every single one of those, a piece of contextualized data that helps our team make analytical decisions. Of course, raw volume isn’t everything, so let’s dive a little deeper.\u003C\/p\u003E\n\u003Cp\u003EWhen an analyst discovers that an IP address has been used by an adversary against a named organization, they denote that usage in our knowledge store. While the time at which this observation occurs does not always correlate with when it was used in an intrusion, knowing when we became aware of that use is still valuable. We can cross-reference these times with data from SCANdalous to help us understand the impact of our external detection.\u003C\/p\u003E\n\u003Cp\u003ELooking at the IP addresses marked by an analyst as observed at a client in the last year, we find that 21.7% (more than one in five) were also found by SCANdalous. Of that fifth, SCANdalous has an average lead time of 47 days. If we only consider the IP addresses that SCANdalous found first, the average lead time jumps to 106 days. Going even deeper and examining this data month-to-month, we find a steady upward trend in the percentage of IP addresses identified by SCANdalous before being observed at a client (Figure 3).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/scandalous\/Picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Percentage of IP addresses found by SCANdalous before being marked as observed at a client by a FireEye analyst\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EA similar pattern can be seen for SCANdalous’ average lead time over the same data (Figure 4).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/scandalous\/Picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: Average lead time in days for SCANdalous over the same data shown in Figure 3\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EAs we continue to create signatures and increase our external detection efforts, we can see from these numbers that the effectiveness and value of the resulting data grow as well.\u003C\/p\u003E\n\u003Ch4\u003ESCANdalous Case Studies\u003C\/h4\u003E\n\u003Cp\u003EToday in Advanced Practices, SCANdalous is a core element of our external detection work. It has provided us with a new lens through which we can observe threat activity on a scale and scope beyond our organic data, and enriches our workflows in support of Mandiant. Here are a few of our favorite examples:\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EFIN6\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EIn early 2019, SCANdalous identified a Cobalt Strike C2 server that we were able to associate with FIN6. Four hours later, the server was used to target a Managed Defense client, as discussed in our blog post,\u0026nbsp;\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/04\/pick-six-intercepting-a-fin6-intrusion.html\u0022 adhocenable=\u0022false\u0022\u003EPick-Six: Intercepting a FIN6 Intrusion, an Actor Recently Tied to Ryuk and LockerGoga Ransomware\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EFIN7\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EIn late 2019, SCANdalous identified a BOOSTWRITE C2 server and automatically acquired keying material that was later used to decrypt files found in a FIN7 intrusion worked by Mandiant consultants, as discussed in our blog post,\u0026nbsp;\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/10\/mahalo-fin7-responding-to-new-tools-and-techniques.html\u0022 adhocenable=\u0022false\u0022\u003EMahalo FIN7: Responding to the Criminal Operators’ New Tools and Techniques\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EUNC1878 (financially motivated)\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ESome of you may also remember our \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/03\/the-cycle-of-adversary-pursuit.html\u0022 adhocenable=\u0022false\u0022\u003Erecent blog post on UNC1878\u003C\/a\u003E. It serves as a great case study for how we grow an initial observation into a larger set of data, and then use that knowledge to find more activity across our offerings. Much of the early work that went into tracking that activity (see the section titled “Expansion”) happened via SCANdalous. The quick response from Managed Defense gave us just enough information to build a profile of the C2 and let our automated system take it from there. Over the next couple months, SCANdalous identified numerous servers matching UNC1878’s profile. This allowed us to not only analyze and attribute new network infrastructure, it also helped us observe when and how they were changing their operations over time.\u003C\/p\u003E\n\u003Ch4\u003EConclusion\u003C\/h4\u003E\n\u003Cp\u003EThere are hundreds more stories to tell, but the point is the same. When we find value in an analytical workflow, we ask ourselves how we can do it better and faster. The automation we build into our tools allows us to not only accomplish more of the work we were doing manually, it enables us to work on things we never could before. Of course, the conversion doesn’t happen all at once. Like all good things, we made a lot of incremental improvements over time to get where we are today, and we’re still finding ways to make more. Continuing to innovate is how we keep moving forward – as Advanced Practices, as FireEye, and as an industry.\u003C\/p\u003E\n\u003Ch4\u003EExample Signatures\u003C\/h4\u003E\n\u003Cp\u003EThe following are example Shodan queries; however, any source of scan data can be used.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EUsed to Identify APT39 C2 Servers\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cspan class=\u0022code\u0022\u003Eproduct:“bitvise” port:“443” org:“WorldStream B.V.”\u003C\/span\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EUsed to Identify QUADAGENT C2 Servers\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cspan class=\u0022code\u0022\u003E“PHP\/7.2.0beta2”\u003C\/span\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003ERULER.HOMEPAGE Payloads\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cspan class=\u0022code\u0022\u003Ehtml:“clsid:0006F063-0000-0000-C000-000000000046”\u003C\/span\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n",
        "jcr:lastModified": "Sun Jul 19 2020 20:39:54 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe discuss SCANdalous, a solution we developed that enables us to track thousands of threat groups, malware families and profiles.\u003C\/p\u003E\n",
      "jcr:lastModified": "Mon Jul 13 2020 17:53:14 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon Jul 13 2020 17:58:00 GMT+0000",
      "imageRotate": "0"
    }
  }
}
