{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Mon Apr 13 2020 12:10:45 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "Think Fast: Time Between Disclosure, Patch Release and Vulnerability Exploitation — Intelligence for Vulnerability Management, Part Two",
    "jcr:versionHistory": "0d8f512e-35b6-4df1-ab7a-5f7fb9b2f24e",
    "author": "Kathleen Metrick",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "8aa7bba0-f05a-4587-bbb7-7c16bedb782a"
    ],
    "jcr:created": "Fri Jul 24 2020 06:59:10 GMT+0000",
    "cq:lastModified": "Fri Jul 24 2020 06:58:43 GMT+0000",
    "jcr:baseVersion": "8aa7bba0-f05a-4587-bbb7-7c16bedb782a",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:kathleen-metrick",
      "fireeye-blog-authors:jared-semrau",
      "fireeye-blog-authors:shambavi-sadayappan",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:threat-intelligence",
      "fireeye-blog-tags:patches"
    ],
    "jcr:uuid": "590e5da6-4739-43e7-9458-4dd26f12458a",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Apr 13 2020 08:00:00 GMT-0400",
    "cq:lastModifiedBy": "reference-adjustment-service",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003E\u003Ci\u003EOne of the critical strategic and tactical roles that cyber threat intelligence (CTI) plays is in the tracking, analysis, and prioritization of software vulnerabilities that could potentially put an organization’s data, employees and customers at risk. In this four-part blog series, \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/mandiant\/threat-intelligence.html\u0022\u003EFireEye Mandiant Threat Intelligence\u003C\/a\u003E highlights the value of CTI in enabling vulnerability management, and unveils new research into the latest threats, trends and recommendations. Check out our first post on \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/zero-day-exploitation-demonstrates-access-to-money-not-skill.html\u0022\u003Ezero-day vulnerabilities\u003C\/a\u003E.\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAttackers are in a constant race to exploit newly discovered vulnerabilities before defenders have a chance to respond. FireEye Mandiant Threat Intelligence research into vulnerabilities exploited in 2018 and 2019 suggests that the majority of exploitation in the wild occurs before patch issuance or within a few days of a patch becoming available.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnmanage2\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Percentage of vulnerabilities exploited at various times in relation to patch release\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EFireEye Mandiant Threat Intelligence analyzed 60 vulnerabilities that were either exploited or assigned a CVE number between Q1 2018 to Q3 2019. The majority of vulnerabilities were exploited as zero-days – before a patch was available. More than a quarter were exploited within one month after the patch date. Figure 2 illustrates the number of days between when a patch was made available and the first observed exploitation date for each vulnerability.\u003C\/p\u003E\n\u003Cp\u003EWe believe these numbers to be conservative estimates, as we relied on the first reported exploitation of a vulnerability linked to a specific date. Frequently, first exploitation dates are not publicly disclosed. It is also likely that in some cases exploitation occurred without being discovered before researchers recorded exploitation attached to a certain date.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnmanage2\/Picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Time between vulnerability exploitation and patch issuance\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E­­­\u003Ci\u003ETime Between Disclosure and Patch Release\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe average time between disclosure and patch availability was approximately 9 days. This average is slightly inflated by vulnerabilities such as CVE-2019-0863, a Microsoft Windows server vulnerability, which was disclosed in December 2018 and not patched until 5 months later in May 2019. The majority of these vulnerabilities, however, were patched quickly after disclosure. In 59% of cases, a patch was released on the same day the vulnerability was disclosed. These metrics, in combination with the observed swiftness of adversary exploitation activity, highlight the importance of responsible disclosure, as it may provide defenders with the slim window needed to successfully patch vulnerable systems.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EExploitation After Patch Release\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EWhile the majority of the observed vulnerabilities were zero-days, 42 percent of vulnerabilities were exploited after a patch had been released. For these non-zero-day vulnerabilities, there was a very small window (often only hours or a few days) between when the patch was released and the first observed instance of attacker exploitation. Table 1 provides some insight into the race between attackers attempting to exploit vulnerable software and organizations attempting to deploy the patch.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022623\u0022 colspan=\u00222\u0022 valign=\u0022top\u0022\u003E\u003Cp style=\u0022text-align: center;\u0022\u003E\u003Cb\u003ETime to Exploit for Vulnerabilities First Exploited after a Patch\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002288\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHours\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022535\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ETwo vulnerabilities were successfully exploited within hours of a patch release, CVE-2018-2628 and CVE-2018-7602.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002288\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EDays\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022535\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E12 percent of vulnerabilities were exploited within the first week following the patch release.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002288\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EOne Month\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022535\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E15 percent of vulnerabilities were exploited after one week but within one month of patch release.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002288\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EYears\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022535\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EIn multiple cases, such as the first observed exploitation of CVE-2010-1871 and CVE-2012-0874 in 2019, attackers exploited vulnerabilities for which a patch had been made available many years prior.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 1: Exploitation timing for patched vulnerabilities ranges from within hours of patch issuance to years after initial disclosure\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ECase Studies\u003C\/h4\u003E\n\u003Cp\u003EWe continue to observe espionage and financially motivated groups quickly leveraging publicly disclosed vulnerabilities in their operations. The following examples demonstrate the speed with which sophisticated groups are able to incorporate vulnerabilities into their toolsets following public disclosure and the fact that multiple disparate groups have repeatedly leveraged the same vulnerabilities in independent campaigns. Successful operations by these types of groups are likely to have a high potential impact.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnmanage2\/Picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Timeline of activity for CVE-2018-15982\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ECVE-2018-15982: A use after free vulnerability in a file package in Adobe Flash Player 31.0.0.153 and earlier that, when exploited, allows an attacker to remotely execute arbitrary code.\u0026nbsp;This vulnerability was exploited by espionage groups—Russia\u0027s APT28 and North Korea\u0027s APT37—as well as TEMP.MetaStrike and other financially motivated attackers.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnmanage2\/Picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: Timeline of activity for CVE-2018-20250\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ECVE-2018-20250: A path traversal vulnerability exists within the ACE format in the archiver tool WinRAR versions 5.61 and earlier that, when exploited, allows an attacker to locally execute arbitrary code. This vulnerability was exploited by multiple espionage groups, including Chinese, North Korean, and Russian, groups, as well as Iranian groups APT33 and TEMP.Zagros.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnmanage2\/Picture5.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: Timeline of Activity for CVE-2018-4878\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ECVE-2018-4878: A use after free vulnerability exists within the DRMManager’s “initialize” call in Adobe Flash Player 28.0.0.137 and earlier that, when exploited, allows an attacker to remotely execute arbitrary code. Mandiant Intelligence confirmed that North Korea’s APT37 exploited this vulnerability as a zero-day as early as September 3, 2017. Within 8 days of disclosure, we observed Russia’s APT28 also leverage this vulnerability, with financially motivated attackers and North Korea’s TEMP.Hermit also using within approximately a month of disclosure.\u003C\/p\u003E\n\u003Ch4\u003EAvailability of PoC or Exploit Code\u003C\/h4\u003E\n\u003Cp\u003EThe availability of POC or exploit code on its own does not always increase the probability or speed of exploitation. However, we believe that POC code likely hastens exploitation attempts for vulnerabilities that do not require user interaction. For vulnerabilities that have already been exploited, the subsequent introduction of publicly available exploit or POC code indicates malicious actor interest and makes exploitation accessible to a wider range of attackers. There were a number of cases in which certain vulnerabilities were exploited on a large scale within 48 hours of PoC or exploit code availability (Table 2).\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E\u003Cb\u003ETime Between PoC or Exploit Code Publication and First Observed Potential Exploitation Events\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003E\u003Cb\u003EProduct\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003E\u003Cb\u003EFireEye Risk Rating\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E1 day\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003EWinRAR\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2018-20250\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E1 day\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003EDrupal\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2018-7600\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EHigh\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E1 day\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003ECisco Adaptive Security Appliance\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2018-0296\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E2 days\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003EApache Struts\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2018-11776\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EHigh\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E2 days\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003ECisco Adaptive Security Appliance\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2018-0101\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EHigh\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E2 days\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003EOracle WebLogic Server\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2018-2893\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EHigh\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E2 days\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003EMicrosoft Windows Server\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2018-8440\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E2 days\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003EDrupal\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2019-6340\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EMedium\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022168\u0022\u003E\u003Cp\u003E2 days\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022160\u0022\u003E\u003Cp\u003EAtlassian Confluence\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022152\u0022\u003E\u003Cp\u003ECVE-2019-3396\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022144\u0022\u003E\u003Cp\u003EHigh\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 2: Vulnerabilities exploited within two days of either PoC or exploit code being made publicly available, Q1 2018–Q3 2019\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ETrends by Targeted Products\u003C\/h4\u003E\n\u003Cp\u003EFireEye judges that malicious actors are likely to most frequently leverage vulnerabilities based on a variety of factors that influence the utility of different vulnerabilities to their specific operations. For instance, we believe that attackers are most likely to target the most widely used products (see Figure 6). Attackers almost certainly also consider the cost and availability of an exploit for a specific vulnerability, the perceived success rate based on the delivery method, security measures introduced by vendors, and user awareness around certain products.\u003C\/p\u003E\n\u003Cp\u003EThe majority of observed vulnerabilities were for Microsoft products, likely due to the ubiquity of Microsoft offerings. In particular, vulnerabilities in software such as Microsoft Office Suite may be appealing to malicious actors based on the utility of email attached documents as initial infection vectors in phishing campaigns.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnmanage2\/Picture6.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 6: Exploited vulnerabilities by vendor, Q1 2018–Q3 2019\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EOutlook and Implications\u003C\/h4\u003E\n\u003Cp\u003EThe speed with which attackers exploit patched vulnerabilities emphasizes the importance of patching as quickly as possible. With the sheer quantity of vulnerabilities disclosed each year, however, it can be difficult for organizations with limited resources and business constraints to implement an effective strategy for prioritizing the most dangerous vulnerabilities. In upcoming blog posts, FireEye Mandiant Threat Intelligence describes our approach to vulnerability risk rating as well as strategies for making informed and realistic patch management decisions in more detail.\u003C\/p\u003E\n\u003Cp\u003EWe recommend using this exploitation trend information to better prioritize patching schedules in combination with other factors, such as known active threats to an organization\u0027s industry and geopolitical context, the availability of exploit and PoC code, commonly impacted vendors, and how widely software is deployed in an organization\u0027s environment may help to mitigate the risk of a large portion of malicious activity.\u003C\/p\u003E\n\u003Cp\u003ERegister today\u0026nbsp;to hear FireEye Mandiant Threat Intelligence experts discuss the latest in\u0026nbsp;\u003Ca href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/392772\u0022\u003Evulnerability threats, trends and recommendations\u003C\/a\u003E\u0026nbsp;in our upcoming April 30 webinar.\u003C\/p\u003E\n",
        "jcr:lastModified": "Mon Apr 13 2020 12:11:47 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Sun Apr 12 2020 18:25:07 GMT+0000",
      "imageRotate": "0"
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EThe majority of exploitation in the wild occurs before patch issuance or within a few days of a patch becoming available.\u003C\/p\u003E\n",
      "jcr:lastModified": "Mon Apr 13 2020 12:10:33 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    }
  }
}
