{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Fri Jul 16 2021 19:30:34 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Exploitation des vulnérabilités zero-day de Microsoft Exchange : détection et réponse",
    "jcr:versionHistory": "cbc30cb9-4100-4cd7-bfa9-894201ff2144",
    "author": "Matt Bromiley",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
    "jcr:language": "fr_FR",
    "jcr:predecessors": [
      "637a5259-1228-4c3e-818d-68faa13a12b0"
    ],
    "jcr:created": "Fri Jul 16 2021 19:30:34 GMT+0000",
    "cq:lastModified": "Fri Jul 16 2021 19:30:08 GMT+0000",
    "jcr:baseVersion": "637a5259-1228-4c3e-818d-68faa13a12b0",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:matt-bromiley",
      "fireeye-blog-authors:cap-chris-digamo",
      "fireeye-blog-authors:andrew-thompson",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:zero-day",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:microsoft",
      "fireeye-blog-tags:managed-defense",
      "fireeye-blog-authors:robert-wallace"
    ],
    "jcr:lastModified": "Fri Jul 16 2021 18:14:59 GMT+0000",
    "jcr:uuid": "a0cf1798-cf8f-46a9-8cf3-cd2c6c8069b8",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Mar 04 2021 17:30:00 GMT-0500",
    "cq:lastModifiedBy": "lynda.hall@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
        "text": "\u003Cp\u003ETout a commencé en janvier 2021, quand l\u0027équipe de Mandiant Managed Defense a remarqué plusieurs cas de détournement du serveur de messagerie Microsoft Exchange Server, et ce au sein d\u0027au moins un environnement client. Parmi les activités observées\u0026nbsp;: création de web shells permettant d\u0027obtenir un accès permanent, exécution de code à distance et opérations de reconnaissance et de détection de solutions de protection des terminaux. D’après notre enquête, les fichiers créés sur les serveurs Exchange appartenaient à \u003Cspan class=\u0022code\u0022\u003ENT AUTHORITY\\SYSTEM\u003C\/span\u003E, un utilisateur local doté de privilèges élevés sur le système d\u0027exploitation Windows. En outre, il est apparu que le processus à l\u0027origine du web shell, \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E, était celui responsable du service de messagerie unifiée du serveur Exchange. La poursuite de nos investigations a révélé la création de fichiers malveillants par le processus\u0026nbsp;\u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E, responsable de son application frontale web.\u003C\/p\u003E\n\u003Cp\u003EEn réponse à ces activités, nous avons engagé plusieurs actions de traque des menaces destinées à détecter d\u0027autres détournements d’Exchange. Ces données nous ont également permis de mettre au point des moyens de détection plus pointus des chaînes de processus des serveurs web. Le 2 mars 2021, Microsoft a publié sur son blog un \u003Ca href=\u0022https:\/\/www.microsoft.com\/security\/blog\/2021\/03\/02\/hafnium-targeting-exchange-servers\/\u0022\u003Earticle\u003C\/a\u003E détaillant plusieurs des vulnérabilités zero-day exploitées pour attaquer les versions sur site de Microsoft Exchange. À la même période, la firme de Redmond a également sorti des mises à jour d\u0027urgence d’Exchange pour corriger les vulnérabilités suivantes\u0026nbsp;:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022651\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIdentifiant CVE\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EScores de risque\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EVecteur d\u0027accès\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EExploitabilité\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ESimplicité de l\u0027attaque\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EThreat Intelligence de Mandiant\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26855\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECritique\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFonctionnelle\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFacile\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004941\u0022\u003ELien\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26857\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMoyen\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFonctionnelle\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFacile\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004938\u0022 adhocenable=\u0022false\u0022\u003ELien\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-26858\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMoyenne\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFonctionnelle\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFacile\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004944\u0022\u003ELien\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ECVE-2021-27065\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022105\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMoyenne\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022111\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022127\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFonctionnelle\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFacile\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002282\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/21-00004939\u0022\u003ELien\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETableau\u0026nbsp;1\u0026nbsp;: Liste des vulnérabilités de Microsoft Exchange en mars 2021 et synthèses de FireEye\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ELes activités signalées par Microsoft et nos observations concordent. \u003Cb\u003EActuellement, nous poursuivons nos observations de ces attaques dans trois clusters\u0026nbsp;:\u0026nbsp;UNC2639, UNC2640 et\u0026nbsp;UNC2643. Nous nous attendons à en voir apparaître d\u0027autres à mesure que nous intervenons sur de nouveaux cas d\u0027intrusion.\u003C\/b\u003E Nous recommandons de suivre les conseils de Microsoft et d\u0027appliquer immédiatement les correctifs à Exchange pour neutraliser ces attaques.\u003C\/p\u003E\n\u003Cp\u003ENos données de télémétrie font état d\u0027un large éventail de victimes aux États-Unis, dont des acteurs de la grande distribution, des collectivités locales, une université et une société d\u0027ingénierie. Un gouvernement d\u0027Asie du Sud-Est et une compagnie de télécommunication d\u0027Asie centrale pourraient aussi avoir été touchés par des activités du même genre. \u003Ca href=\u0022https:\/\/www.microsoft.com\/security\/blog\/2021\/03\/02\/hafnium-targeting-exchange-servers\/\u0022\u003ESelon Microsoft\u003C\/a\u003E, ces exploits ont eu lieu en même temps et renvoient tous à «\u0026nbsp;HAFNIUM\u0026nbsp;», un groupe d\u0027assaillants qui s\u0027est déjà tristement illustré face à des entreprises de défense, des cabinets d\u0027avocats, des équipes de recherche sur les maladies infectieuses et des think tanks.\u003C\/p\u003E\n\u003Cp\u003ECet article a pour vocation de recenser nos observations à ce jour, l\u0027enquête\u0026nbsp;étant toujours en cours. Nous l’actualiserons ou publierons éventuellement de nouveaux détails techniques à mesure que notre connaissance et notre compréhension de cet attaquant s’affinent. Nous avons par ailleurs lancé un CPE (Community Protection Event) à l\u0027intention de nos clients Managed Defense afin de les tenir régulièrement informés de ces attaques.\u003C\/p\u003E\n\u003Cp\u003EUn webinaire a d\u0027ailleurs déjà eu lieu \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/475010?utm_source=FireEye\u0026amp;utm_medium=brighttalk\u0026amp;utm_campaign=475010\u0022\u003Ele 17 mars dernier\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003EDe l\u0027exploit au web shell\u003C\/h4\u003E\n\u003Cp\u003ETout a commencé en janvier 2021, lorsque Mandiant Managed Defense a constaté la création de web shells sur un système de fichiers du serveur Microsoft Exchange au sein de l\u0027environnement d\u0027un de ses clients. Ce web shell, appelé \u003Cspan class=\u0022code\u0022\u003Ehelp.aspx\u003C\/span\u003E (MD5: 4b3039cf227c611c45d2242d1228a121), contenait du code destiné à repérer la présence de produits de protection de terminaux tels que (1) FireEye xAgent, (2) CarbonBlack, ou (3) CrowdStrike Falcon, puis à écrire les résultats de sa découverte. Un extrait du code de ce web shell est donné dans la figure\u0026nbsp;1.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;1\u0026nbsp;: Extrait du web shell help.aspx conçu pour identifier la présence d\u0027un logiciel de protection des terminaux sur le système cible.\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EC\u0027est par le processus \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E, associé au service de messagerie unifiée de Microsoft Exchange, que le web shell s\u0027est retrouvé dans le système, suggérant ainsi l\u0027exploitation de CVE-2021-26858.\u003C\/p\u003E\n\u003Cp\u003EUne vingtaine de jours plus tard, l\u0027attaquant plaçait un autre web shell sur un serveur Microsoft Exchange distinct. Ce deuxième script, partiellement masqué, du nom de \u003Cspan class=\u0022code\u0022\u003Eiisstart.aspx\u003C\/span\u003E (MD5: 0fd9bffa49c76ee12e51e3b8ae0609ac), était plus sophistiqué et contenait des fonctions d’interaction avec le système de fichiers. Comme l\u0027illustre la figure\u0026nbsp;2, il avait la capacité d\u0027exécuter des commandes arbitraires et de charger, effacer et visualiser les contenus de fichiers.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;2\u0026nbsp;: Extrait du web shell iisstart.aspx, chargé par l\u0027attaquant à la fin du mois de janvier 2021\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ESi le recours aux web shells est monnaie courante dans les attaques, les processus parents, le timing et les victimes de ces fichiers indiquent que ces activités ont démarré par le détournement de Microsoft Exchange.\u003C\/p\u003E\n\u003Cp\u003EEn mars 2021, dans un autre environnement, nous avons détecté l\u0027exploitation d\u0027une faille, voire de plusieurs, visant à placer au moins un web shell sur le serveur vulnérable d\u0027Exchange. L\u0027objectif était probablement d\u0027instaurer tant une présence permanente qu\u0027un accès secondaire, comme cela a été constaté dans d\u0027autres environnements. En l\u0027occurrence, Mandiant a repéré le processus\u0026nbsp;\u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E, (processus de Microsoft IIS associé avec l\u0027application web frontale d\u0027Exchange) qui a engendré \u003Cspan class=\u0022code\u0022\u003Ecmd.exe\u003C\/span\u003E pour écrire un fichier sur le disque. Le fichier, décrit dans la figure\u0026nbsp;3, correspond à la signature de \u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/global\/en\/current-threats\/pdfs\/rpt-china-chopper.pdf\u0022\u003EChina Chopper\u003C\/a\u003E, un web shell bien connu.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/exchange-0day\/fig3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure\u0026nbsp;3\u0026nbsp;: Extrait du web shell China Chopper détecté sur un système compromis du serveur Exchange\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EDans au moins deux cas, les assaillants ont activé la commande suivante à l\u0027encontre du serveur web d\u0027Exchange\u0026nbsp;:\u003C\/p\u003E\n\u003Cp\u003E\u003Cspan class=\u0022code\u0022\u003Enet group \u0026quot;Exchange Organization administrators\u0026quot; administrator \/del \/domain.\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ECette commande tente de supprimer l\u0027utilisateur \u003Cspan class=\u0022code\u0022\u003Eadministrator\u003C\/span\u003E du groupe \u003Cspan class=\u0022code\u0022\u003EExchange Organizations administrators\u003C\/span\u003E, à commencer par le contrôleur de domaine dans le domaine actuel. Si le système est le seul du domaine, l\u0027exécution se fera sur la machine locale.\u003C\/p\u003E\n\u003Cp\u003ED\u0027après le blog de Microsoft, d\u0027autres activités post-exploitation ont été détectées, dont\u0026nbsp;:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ELe vol d\u0027identifiants par dumping de la mémoire du processus LSASS\u003C\/li\u003E\n\u003Cli\u003ELa compression de données en vue d\u0027une exfiltration via 7 Zip\u003C\/li\u003E\n\u003Cli\u003EL\u0027utilisation de snap-ins Exchange PowerShell pour exporter les données des boîtes mail\u003C\/li\u003E\n\u003Cli\u003ELe recours à d\u0027autres outils de sécurité offensifs tels que \u003Ca href=\u0022https:\/\/github.com\/cobbr\/Covenant\u0022\u003ECovenant\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/github.com\/samratashok\/nishang\u0022\u003ENishang\u003C\/a\u003E et \u003Ca href=\u0022https:\/\/github.com\/besimorhino\/powercat\u0022\u003EPowerCat\u003C\/a\u003E pour obtenir un accès à distance.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003ELes activités observées, conjuguées à celles rapportées par d\u0027autres acteurs de la sécurité informatique, nous amènent à penser que ces assaillants exploitent très probablement les vulnérabilités d’Exchange pour s\u0027implanter durablement dans les environnements. Elles sont rapidement suivies d\u0027autres mécanismes d\u0027accès et d\u0027implantation. Comme nous l’avons précédemment mentionné, plusieurs affaires sont en cours et nous continuerons à vous informer à mesure que nous intervenons sur de nouveaux cas.\u003C\/p\u003E\n\u003Ch4\u003EConseils d\u0027investigation\u003C\/h4\u003E\n\u003Cp\u003ENous vous invitons à vérifier les points suivants pour déceler d\u0027éventuels signes de compromission\u0026nbsp;:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ELes processus enfants de \u003Cspan class=\u0022code\u0022\u003EC:\\Windows\\System32\\inetsrv\\w3wp.exe\u003C\/span\u003E sur les serveurs Exchange, tout particulièrement \u003Cspan class=\u0022code\u0022\u003Ecmd.exe\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003ELes fichiers écrits sur le système par \u003Cspan class=\u0022code\u0022\u003Ew3wp.exe\u003C\/span\u003E ou \u003Cspan class=\u0022code\u0022\u003EUMWorkerProcess.exe\u003C\/span\u003E.\u003C\/li\u003E\n\u003Cli\u003ELes fichiers ASPX appartenant à l\u0027utilisateur \u003Cspan class=\u0022code\u0022\u003ESYSTEM\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003EL\u0027apparition soudaine de nouveaux fichiers ASPX compilés dans le répertoire des \u003Cspan class=\u0022code\u0022\u003Efichiers temporaires ASP.NET\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003EDes activités de reconnaissance et des tests de vulnérabilité des ressources suivantes à partir d\u0027une adresse IP externe\u0026nbsp;:\u003Cul\u003E\n\u003Cli\u003ELe répertoire \u003Cspan class=\u0022code\u0022\u003E\/rpc\/\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Cspan class=\u0022code\u0022\u003E\/ecp\/DDI\/DDIService.svc\/SetObject\u003C\/span\u003E\u003C\/li\u003E\n\u003Cli\u003EDes ressources non existantes\u003C\/li\u003E\n\u003Cli\u003EAvec des utilisateurs-agents HTTP suspects ou usurpés\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EDemandes inattendues ou suspectes de SnapIn Exchange PowerShell pour exporter des boîtes mail\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EÀ ce jour, notre enquête révèle que les web shells placés sur les serveurs Exchange ont été nommés différemment à chaque intrusion. Dès lors, le nom de fichier seul n\u0027est pas un indicateur de compromission très fiable.\u003C\/p\u003E\n\u003Cp\u003ESi vous pensez que votre serveur Exchange a été compromis, nous vous recommandons d\u0027enquêter sur l\u0027ampleur de l\u0027attaque et la durée de présence de l\u0027assaillant.\u003C\/p\u003E\n\u003Cp\u003EPar ailleurs, en raison de possibles limites de taille et de durée de rétention imposées aux journaux des systèmes et serveurs web, nous préconisons de conserver les artefacts suivants pour les analyses forensiques\u0026nbsp;:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ELes journaux web HTTP provenant des répertoires \u003Cspan class=\u0022code\u0022\u003Einetpub\\Logs\\LogFiles\u003C\/span\u003E (y compris les journaux de tous les sous-répertoires) sur 14 jours au minimum\u003C\/li\u003E\n\u003Cli\u003ELe contenu du serveur web d’Exchange (également présent dans le dossier \u003Cspan class=\u0022code\u0022\u003Einetpub\u003C\/span\u003E)\u003C\/li\u003E\n\u003Cli\u003ELes journaux d\u0027Exchange Control Panel (ECP), situés dans \u003Cspan class=\u0022code\u0022\u003EProgram Files\\Microsoft\\Exchange Server\\v15\\Logging\\ECP\\Server\u003C\/span\u003E sur 14 jours au minimum\u003C\/li\u003E\n\u003Cli\u003ELes journaux d\u0027événements Microsoft Windows\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003ENous avons trouvé des informations particulièrement précieuses pour la traque et l\u0027analyse dans ces dossiers de journaux, notamment en ce qui concerne des paramètres CMD suspects dans les journaux de serveur ECP. Nous continuerons de publier et de mettre à jour ces renseignements techniques à mesure que nous détectons des activités associées.\u003C\/p\u003E\n\u003Ch4\u003EIndicateurs techniques\u003C\/h4\u003E\n\u003Cp\u003EVous trouverez ci-dessous les indicateurs techniques que nous avons observés et classés selon les groupes d\u0027attaque actuellement associés à ces activités. Par souci de transparence, nous incluons pour les indicateurs de réseaux une valeur de «\u0026nbsp;Last Known True\u0026nbsp;», ou LKT, pour préciser la date et l\u0027heure à laquelle Mandiant savait pour la dernière fois que l\u0027indicateur en question était associé à l\u0027attaquant. Néanmoins, comme avec toutes les intrusions en cours, un laps de temps raisonnable devrait être envisagé.\u003C\/p\u003E\n\u003Ch5\u003EUNC2639\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022613\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndicateur\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EType\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ERemarque\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E165.232.154.116\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u0026nbsp;: Adresse IP\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELKT\u0026nbsp;: 2021\/03\/02 02:43\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022151\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E182.18.152.105\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022155\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u0026nbsp;: Adresse IP\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022307\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELKT\u0026nbsp;: 2021\/03\/03 16:16\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch5\u003EUNC2640\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndicateur\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022118\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EType\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022341\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMD5\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022131\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ehelp.aspx\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022118\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFichier\u0026nbsp;: Web Shell\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022341\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E4b3039cf227c611c45d2242d1228a121\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Eiisstart.aspx\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFichier\u0026nbsp;: Web Shell\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E0fd9bffa49c76ee12e51e3b8ae0609ac\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch5\u003EUNC2643\u003C\/h5\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022589\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EIndicateur\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EType\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMD5\/Remarque\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECobalt Strike BEACON\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFichier\u0026nbsp;: Shellcode\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E79eb217578bed4c250803bd573b10151\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E89.34.111.11\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u0026nbsp;: Adresse IP\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELKT\u0026nbsp;: 2021\/03\/03 21:06\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E86.105.18.116\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u00220\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERéseau\u0026nbsp;: Adresse IP\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022276\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELKT\u0026nbsp;: 2021\/03\/03 21:39\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EDétection des techniques\u003C\/h4\u003E\n\u003Cp\u003EFireEye détecte ces activités sur nos différentes plateformes. Le tableau suivant contient les noms de détection indiquant des opérations d\u0027exploitation ou de post-exploitation d\u0027Exchange Server que nous associons à ces attaquants.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022695\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EPlateforme\u003C\/u\u003E(s)\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003ENom de détection\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003ENetwork Security\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EEmail Security\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EDetection\u0026nbsp;On\u0026nbsp;Demand\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EMalware\u0026nbsp;File Scanning\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EMalware\u0026nbsp;File\u0026nbsp;Storage Scanning\u0026nbsp;\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EFEC_Trojan_ASPX_Generic_2\u003C\/li\u003E\n\u003Cli\u003EFE_Webshell_ASPX_Generic_33\u003C\/li\u003E\n\u003Cli\u003EFEC_APT_Webshell_ASPX_HEARTSHELL_1\u003C\/li\u003E\n\u003Cli\u003EExploit.CVE-2021-26855\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEndpoint Security\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EIOC en temps réel\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EEXÉCUTION D\u0027UN CODE SUSPECT PROVENANT D\u0027EXCHANGE SERVER (EXPLOIT)\u003C\/li\u003E\n\u003Cli\u003ECRÉATION DU WEBSHELL ASPXSPY (BACKDOOR)\u003C\/li\u003E\n\u003Cli\u003EPROCDUMP SUR LSASS.EXE (MÉTHODOLOGIE)\u003C\/li\u003E\n\u003Cli\u003EPROCESS DUMP DE TASKMGR DE LSASS.EXE (MÉTHODOLOGIE)\u003C\/li\u003E\n\u003Cli\u003EUNILIGNE TCP NISHANG POWERSHELL (BACKDOOR)\u003C\/li\u003E\n\u003Cli\u003EUTILISATION SUSPECTE DE POWERSHELL (MÉTHODOLOGIE)\u003C\/li\u003E\n\u003Cli\u003EDOWNLOADER POWERSHELL (MÉTHODOLOGIE)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003E\u003Cu\u003EProtection anti-malware (AV\/MG)\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ETrojan.Agent.Hafnium.A\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003E\u003Cu\u003ECouverture des modules\u003C\/u\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E[Process Guard] – empêche le dumping mémoire du processus LSASS grâce à l\u0027utilitaire procdump.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022143\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHelix\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022552\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [Processus enfant inhabituel sur le serveur web]\u003C\/li\u003E\n\u003Cli\u003EMICROSOFT EXCHANGE [Bypass\/Contournement d\u0027authentification\u0026nbsp;CVE-2021-26855)]\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n",
        "jcr:lastModified": "Fri Jul 16 2021 19:30:08 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EEn janvier 2021, nous avons commencé à constater de multiples cas de détournement de Microsoft Exchange Server provenant de l\u0027exploitation de vulnérabilités zero-day.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu Mar 04 2021 23:06:49 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Fri Mar 05 2021 01:55:21 GMT+0000",
      "imageRotate": "0"
    }
  }
}
