{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Thu Jul 30 2020 18:52:49 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "Obscured by Clouds: Insights into Office 365 Attacks and How Mandiant Managed Defense Investigates",
    "jcr:versionHistory": "4f826eb7-5f00-4380-8360-7571884cb731",
    "author": "Joseph Hladik",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "54c123da-05f4-40ca-a13b-24afaa25baba"
    ],
    "jcr:created": "Thu Jul 30 2020 18:52:49 GMT+0000",
    "cq:lastModified": "Thu Jul 30 2020 18:52:37 GMT+0000",
    "jcr:baseVersion": "54c123da-05f4-40ca-a13b-24afaa25baba",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:joseph-hladik",
      "fireeye-blog-authors:josh-fleischer",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:email",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:phishing",
      "fireeye-blog-tags:business-risk",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:response"
    ],
    "jcr:uuid": "07b23e0f-7b1a-4c2e-b85f-72bff2c8930f",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Jul 30 2020 15:00:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EWith Business Email Compromises (BECs) \u003Ca href=\u0022https:\/\/pdf.ic3.gov\/2019_IC3Report.pdf\u0022\u003Eshowing no signs of slowing down\u003C\/a\u003E, it is becoming increasingly important for security analysts to understand Office 365 (O365) breaches and how to properly investigate them. This blog post is for those who have yet to dip their toes into the waters of an O365 BEC, providing a crash course on Microsoft’s cloud productivity suite and its assortment of logs and data sources useful to investigators. We’ll also go over common attacker tactics we’ve observed while responding to BECs and provide insight into how Mandiant Managed Defense analysts approach these investigations at our customers using PowerShell and the \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/products\/helix.html\u0022\u003EFireEye\u0026nbsp;Helix platform\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003EOffice 365\u003C\/h4\u003E\n\u003Cp\u003EOffice 365 is Microsoft’s cloud-based subscription service for the Microsoft Office suite. It is built from dozens of applications tightly embedded into the lives of today’s workforce, including:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EExchange Online, for emails\u003C\/li\u003E\n\u003Cli\u003ESharePoint, for intranet portals and document sharing\u003C\/li\u003E\n\u003Cli\u003ETeams and Skype for Business, for instant messaging\u003C\/li\u003E\n\u003Cli\u003EOneDrive, for file sharing\u003C\/li\u003E\n\u003Cli\u003EMicrosoft Stream, for recorded meetings and presentations\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EAs more and more organizations decide to adopt Microsoft’s cloud-based offering to meet their needs, unauthorized access to these O365 environments, or \u003Ci\u003Etenants\u003C\/i\u003E in Microsoft’s parlance, has become increasingly lucrative to motivated attackers. The current high adoption rate of O365 means that attackers are getting plenty of hands on experience with using and abusing the platform. While many tactics have remained largely unchanged in the years since we’ve first observed them, we’ve also witnessed the evolution of techniques that are effective against even security-conscious users.\u003C\/p\u003E\n\u003Cp\u003EIn general, the O365 compromises we’ve responded to have fallen into two categories:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EBusiness Email Compromises (BECs)\u003C\/li\u003E\n\u003Cli\u003EAPT or state-sponsored intrusions\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EBased on our experience, BECs are a common threat to any organization\u0027s O365 tenant. The term “BEC” typically refers to a type of fraud committed by financially motivated attackers. BEC actors heavily rely on social engineering to carry out their schemes, ultimately defrauding organizations and even personnel.\u003C\/p\u003E\n\u003Cp\u003EOne common BEC scheme involves compromising a C-suite executive’s account via phishing. Once the victim unwittingly enters their credentials into a web form masquerading as the legitimate Office 365 login portal, attackers log in and instruct others in the organization to conduct a wire transfer, perhaps under the guise of an upcoming acquisition that has yet to be publicly announced. However, we’ve also observed more effective schemes where attackers compromise those in financial positions and patiently wait until an email correspondence has begun about a due payment. Attackers seize this opportunity by sending a doctored invoice (sometimes based on a legitimate invoice that had been stolen earlier) on behalf of the compromised user to another victim responsible for making payments. These emails are typically hidden from the compromised user due to attacker-created Outlook mailbox rules. Often times, by the time the scheme is inevitably discovered and understood days or weeks later, the money is unrecoverable—highlighting the importance of contacting law enforcement immediately if you’ve fallen victim to a fraud.\u003C\/p\u003E\n\u003Cp\u003EThe personal finances of staff aren’t off limits to attackers either. We’ve observed several cases of W-2 scams, in which attackers send a request to HR for W-2 information from the victim’s account. Once obtained, this personally identifiable information is later used to conduct tax fraud.\u003C\/p\u003E\n\u003Cp\u003EConversely, APT intrusions are typically more sophisticated and are conducted by state-sponsored threat actors. Rather than for financial gain, APT actors are usually tasked to compromise O365 tenants for purposes of espionage, data theft, or destruction. Given the wealth of sensitive information housed in any given organization’s O365 tenant, APT actors may not even need to touch a single endpoint to complete their mission, sidestepping the many security controls organizations have implemented and invested in.\u003C\/p\u003E\n\u003Ch4\u003EO365 Logs and Data Sources\u003C\/h4\u003E\n\u003Cp\u003EIn this section, we’ll touch on the multitude of logs and portals containing forensic data relevant to an O365 investigation.\u003C\/p\u003E\n\u003Cp\u003EBefore we can begin investigating an O365 case, we’ll work with our clients to get an “Investigator” account provisioned with the roles required to obtain the forensic data we need. For the purposes of this blog post, we’ll quickly list the roles needed for an Investigator account, but during an active Managed Defense investigation, a designated Managed Defense consultant will provide further guidance on account provisioning.\u003C\/p\u003E\n\u003Cp\u003EAt a minimum, the Investigator account should have the following roles:\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EExchange Admin Roles\u003C\/i\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EView-only audit logs\u003C\/li\u003E\n\u003Cli\u003EView-only configuration\u003C\/li\u003E\n\u003Cli\u003EView-only recipients\u003C\/li\u003E\n\u003Cli\u003EMailbox Search\u003C\/li\u003E\n\u003Cli\u003EMessage Tracking\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EeDiscovery Rights\u003C\/i\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EeDiscovery Manager role\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EAzure Active Directory Roles\u003C\/i\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EGlobal Reader\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EUnified Audit Log (UAL)\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe Unified Audit Log records activity from various applications within the Office 365 suite, and can be considered O365’s main log source. Entries in the UAL are stored in JSON format. We recommend using the PowerShell cmdlet \u003Cb\u003ESearch-UnifiedAuditLog\u003C\/b\u003E to query the UAL as it allows for greater flexibility, though it can also be acquired from the Office 365 Security \u0026amp; Compliance Center located at \u003Ca href=\u0022https:\/\/protection.office.com\/\u0022\u003Eprotection.office.com\u003C\/a\u003E. In order to leverage this log source (and the Admin Audit Log), ensure that the \u003Ci\u003EAudit Log Search\u003C\/i\u003E feature is enabled.\u003C\/p\u003E\n\u003Cp\u003EThe UAL has a few nuances that are important to consider. While it provides a good high-level summary of activity across various O365 applications, it won’t log comprehensive mailbox activity (for that, acquire the Mailbox Audit Log). Furthermore, the UAL has a few limitations, namely:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EResults to a single query are limited to 5000 results\u003C\/li\u003E\n\u003Cli\u003EOnly 90 days of activity are retained\u003C\/li\u003E\n\u003Cli\u003EEvents may take up to 24 hours before they are searchable\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EMailbox Audit Log (MAL)\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe Mailbox Audit Log, part of Exchange Online, will capture additional actions performed against objects within a mailbox. As such, it’s a good idea acquire and analyze the MAL for each affected user account with the PowerShell cmdlet \u003Cb\u003ESearch-MailboxAuditLog\u003C\/b\u003E. Note that entries in the MAL will be retained for 90 days (by default) and timestamps will be based on the user’s local time zone. The MAL’s retention time can always be increased with the PowerShell cmdlet \u003Cb\u003ESet-Mailbox\u003C\/b\u003E along with the \u003Cb\u003EAuditLogAgeLimit\u003C\/b\u003E parameter.\u003C\/p\u003E\n\u003Cp\u003EAt the time of writing this post, Microsoft has recently \u003Ca href=\u0022https:\/\/docs.microsoft.com\/en-us\/microsoft-365\/compliance\/advanced-audit?view=o365-worldwide\u0022\u003Ereleased information\u003C\/a\u003E about enhanced auditing functionality that gives investigators insight into which emails were accessed by attackers. This level of logging for regular user accounts is only available for organizations with an Office 365 E5 subscription. Once Advanced Auditing is enabled, mail access activity will be logged under the \u003Ci\u003EMailItemsAccessed\u003C\/i\u003E operation in both the UAL and MAL.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EAdministrator Audit Log\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EIf the \u003Ci\u003EAudit Log Search\u003C\/i\u003E feature is enabled, this supplemental data source logs all PowerShell administrative cmdlets (including command-line arguments) executed by administrators. If you suspect that an administrator account was compromised, don’t overlook this log! The PowerShell cmdlet \u003Cb\u003E\u003Ci\u003ESearch-AdminAuditLog\u003C\/i\u003E\u003C\/b\u003E is used to query these logs, but note that the \u003Ci\u003EAudit Log Search\u003C\/i\u003E feature must be enabled and the same 90 day retention limit will be in place.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EAzure AD Logs\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EAzure AD logs can be accessed from the Azure portal (\u003Ca href=\u0022https:\/\/portal.azure.com\/\u0022\u003Eportal.azure.com\u003C\/a\u003E) under the Azure Active Directory service. Azure AD Sign-in logs contain detailed information about how authentications occur and O365 application usage. Azure AD audit logs are also a valuable source of information, containing records of password resets, account creations, role modifications, OAuth grants, and more that could be indicative of suspicious activity. Note that Azure AD logs are only available for 30 days.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003ECloud App Security Portal\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EFor cases where OAuth abuse has been observed, information about cloud applications can be found in Microsoft’s Cloud App Security portal (\u003Ca href=\u0022https:\/\/portal.cloudappsecurity.com\/\u0022\u003Eportal.cloudappsecurity.com\u003C\/a\u003E). Access to this portal requires an E5 license or a standalone Cloud App license. For more background on OAuth abuse, be sure to check out our blog post:\u0026nbsp;\u003Ci\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2018\/05\/shining-a-light-on-oauth-abuse-with-pwnauth.html\u0022\u003EShining a Light on OAuth Abuse with PwnAuth\u003C\/a\u003E\u003C\/i\u003E.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EMessage Traces\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EMessage traces record the emails sent and received by a user. During an investigation, run reports on any email addresses of interest. The message trace report will contain detailed mail flow information as well as subject lines, original client IP addresses, and message sizes. Message traces are useful for identifying emails sent by attackers from compromised accounts, and can also aid in identifying initial phishing emails if phishing was used for initial access. To obtain the actual emails, use the Content Search tool.\u003C\/p\u003E\n\u003Cp\u003EOnly the past 10 days of activity is available with the \u003Cb\u003EGet-MessageTrace\u003C\/b\u003E PowerShell cmdlet. Historical searches for older messages can be run with the \u003Cb\u003EGet-HistoricalSearch\u003C\/b\u003E cmdlet (up to 90 days by default), but historical searches typically take hours for the report to be available. Historical reports can also be generated within the Security and Compliance Center.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EeDiscovery Content Searches\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe Content Search tool allows investigators to query for emails, documents, and instant message conversations stored in an Office 365 tenant. We frequently run Content Search queries to find and acquire copies of emails sent by attackers. Content searches are limited to what has been indexed by Microsoft, so recent activity may not immediately appear. Additionally, only the most recent 1000 items will be shown in the preview pane.\u003C\/p\u003E\n\u003Ch4\u003EAnatomy of an O365 BEC\u003C\/h4\u003E\n\u003Cp\u003EAs mentioned earlier, BECs are one of the more prevalent threats to O365 tenants seen by Managed Defense today. Sometimes, Mandiant analysts respond to several BEC cases at our customers within the same week. With this frontline experience, we’ve compiled a list of commonly observed tactics and techniques to advise our readers about the types of activities one should anticipate. Please note that this is by no means a comprehensive list of O365 attacks, rather a focus on the usual routes we’ve seen BEC actors take to accomplish their objective.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EPhase 1: Initial Compromise\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cu\u003EPhishing\u003C\/u\u003E: Emails with links to credential harvesting forms sent to victims, sometimes from the account of a compromised business partner.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EBrute force\u003C\/u\u003E: A large dictionary of passwords attempted against an account of interest.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EPassword spray\u003C\/u\u003E: A dictionary of commonly used passwords attempted against a list of known user accounts.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EAccess to credential dump\u003C\/u\u003E: Valid credentials used from a previous compromise of the user.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EMFA bypasses\u003C\/u\u003E: Use of mail clients leveraging legacy authentication protocols (e.g. IMAP\/POP), which bypass MFA policies. Attackers may also spam push notifications to the victim by repeatedly attempting to log in, eventually leading to the victim mistakenly accepting the prompt.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EPhase 2: Establish Foothold\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cu\u003EMore phishing\u003C\/u\u003E: Additional phishing lures sent to internal\/external contacts from Outlook’s global address list.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EMore credible lures\u003C\/u\u003E: New phishing lures uploaded to the compromised user\u0027s OneDrive or SharePoint account and shared with the victim’s coworkers.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003ESMTP forwarding\u003C\/u\u003E: SMTP forwarding enabled in the victim’s mailbox to forward all email to an external address.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EForwarding mailbox rules\u003C\/u\u003E: Mailbox rules created to forward all or certain mail to an external address.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EMail client usage\u003C\/u\u003E: Outlook or third-party mail clients used by attackers. Mail will continue to sync for a short while after a password reset occurs.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EPhase 3: Evasion\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cu\u003EEvasive mailbox rules\u003C\/u\u003E: Mailbox rules created to delete mail or move some or all incoming mail to uncommonly used folders in Outlook, such as “RSS Subscriptions”.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EManual evasion\u003C\/u\u003E: Manual deletion of incoming and sent mail. Attackers may forego mailbox rules entirely.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EMail forwarding\u003C\/u\u003E: Attackers accessing emails without logging in if a mechanism to forward mail to an external address was set up earlier.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EMail client usage\u003C\/u\u003E: Outlook or third-party mail clients used by attackers. Mail can be synced locally to the attacker’s machine and accessed later.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EVPN usage\u003C\/u\u003E: VPN servers, sometimes with similar geolocations to their victims, used in an attempt to avoid detection and evade conditional access policies.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EPhase 4: Internal Reconnaissance\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cu\u003EOutlook searching\u003C\/u\u003E: The victim’s mailbox queried by attackers for emails of interest. While not recorded in audit logs, it may be available to \u003Ca href=\u0022https:\/\/support.office.com\/en-us\/article\/delete-search-history-or-export-search-history-in-outlook-on-the-web-582647f4-fae8-46ed-9f78-49b919ddfc69\u0022\u003Eexport\u003C\/a\u003E if it was not deleted by attackers.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EO365 searching\u003C\/u\u003E: Searches conducted within SharePoint and other O365 applications for content of interest. While not recorded in audit logs, SharePoint and OneDrive file interactions are recorded in the UAL.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EMail client usage\u003C\/u\u003E: Outlook or third-party mail clients used by attackers. Mail can be synced locally to the attacker’s machine and accessed later.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EPhase 5: Complete Mission\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Cu\u003EDirect deposit update\u003C\/u\u003E: A request sent to the HR department to update the victim’s direct deposit information, redirecting payment to the BEC actor.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EW-2 scam\u003C\/u\u003E: A request sent to the HR department for W-2 forms, used to harvest PII for tax fraud.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EWire transfer\u003C\/u\u003E: A wire transfer requested for an unpaid invoice, upcoming M\u0026amp;A, charities, etc.\u003C\/li\u003E\n\u003Cli\u003E\u003Cu\u003EThird-party account abuse\u003C\/u\u003E: Abuse of the compromised user’s privileged access to third-party accounts and services, such as access to a corporate rewards site.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EHow Managed Defense Responds to O365 BECs\u003C\/h4\u003E\n\u003Cp\u003EIn this section, we’re going to walk through how Managed Defense investigates a typical O365 BEC case.\u003C\/p\u003E\n\u003Cp\u003EMany of the steps in our investigation rely on querying for logs with PowerShell. To do this, first establish a remote PowerShell session to Exchange Online. The following Microsoft documentation provides guidance on two methods to do this:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/docs.microsoft.com\/en-us\/powershell\/exchange\/exchange-online\/connect-to-exchange-online-powershell\/connect-to-exchange-online-powershell\u0022\u003EConnect to Exchange Online PowerShell with Basic authentication\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/docs.microsoft.com\/en-us\/powershell\/exchange\/exchange-online-powershell-v2\u0022\u003EUse the Exchange Online PowerShell with modern authentication using V2 module\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/obscured\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EBroad Scoping\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EWe start our investigations off by running broad queries against the Unified Audit Log (UAL) for suspicious activity. We’ll review OAuth activity too, which is especially important if something more nefarious than a financially motivated BEC is suspected. Any FireEye gear available to us—such as FireEye \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/products\/helix.html\u0022\u003EHelix\u003C\/a\u003E and \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/products\/email-security.html\u0022 adhocenable=\u0022false\u0022\u003EEmail Security\u003C\/a\u003E—will be leveraged to augment the data available to us from Office 365.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003EThe following are a few initial scoping queries we’d typically run at the beginning of a Managed Defense engagement.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EScoping Recent Mailbox Rule Activity\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EEven in large tenants, pulling back all recent mailbox rule activity doesn’t typically produce an unmanageable number of results, and attacker-created rules tend to stand out from the rest of the noise.\u003C\/p\u003E\n\u003Cp\u003EQuerying UAL for all mailbox rule activity in Helix:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003Eclass=ms_office365 action:[New-InboxRule, Set-InboxRule, Enable-InboxRule] | table [createdtime, action, username, srcipv4, srcregion, parameters, rawmsg]\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EQuery UAL for new mail rule activity in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003ESearch-UnifiedAuditLog -StartDate (Get-Date).AddDays(-90) -EndDate (Get-Date) -ResultSize 5000 -Operations \u0026quot;New-InboxRule\u0026quot;,\u0026quot;Set-InboxRule\u0026quot;,\u0026quot;Enable-InboxRule\u0026quot; | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Ci\u003EScoping SMTP Forwarding Activity\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ESMTP forwarding is sometimes overlooked because it appears under a UAL operation separate from mailbox rules. This query looks for the \u003Cb\u003ESet-Mailbox\u003C\/b\u003E operation containing a parameter to forward mail over SMTP, indicative of \u003Ca href=\u0022https:\/\/support.office.com\/en-us\/article\/turn-on-automatic-forwarding-in-outlook-on-the-web-7f2670a1-7fff-4475-8a3c-5822d63b0c8e\u0022\u003Eautomatic forwarding\u003C\/a\u003E being enabled from OWA.\u003C\/p\u003E\n\u003Cp\u003EQuerying UAL for SMTP forwarding in Helix:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003Eclass=ms_office365 action=Set-Mailbox rawmsg:ForwardingSmtpAddress | table [createdtime, action, username, srcipv4, srcregion, parameters, rawmsg]\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EQuerying UAL for SMTP forwarding in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003ESearch-UnifiedAuditLog -StartDate (Get-Date).AddDays(-90) -EndDate (Get-Date) -ResultSize 5000 -FreeText \u0026quot;ForwardingSmtpAddress\u0026quot; | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cb\u003EAnalyze Compromised Users Logs\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EAfter we’ve finished scoping the tenant, we’ll turn our attention to the individual users believed to be involved in the compromise. We’ll acquire all relevant O365 logs for the identified compromised user(s) - this includes the user\u0027s UAL, Mailbox Audit Log (MAL), and Admin audit log (if the user is an administrator). We’ll review these logs for anomalous account activity and assemble a list of attacker IP addresses and User-Agents strings. We’ll use this list to further scope the tenant.\u003C\/p\u003E\n\u003Cp\u003EO365 investigations rely heavily on anomaly detection. Many times, the BEC actor may even be active at the same time as the user. In order to accurately differentiate between legitimate user activity and attacker activity within a compromised account, it\u0027s recommended to pull back as much data as possible to use as a reference for legitimate activity. Using the Helix query transforms \u003Cb\u003E\u003Ci\u003Egroupby \u0026lt; [srccountry,srcregion]\u003C\/i\u003E\u003C\/b\u003E,\u003Cb\u003E \u003Ci\u003Egroupby \u0026lt; useragent\u003C\/i\u003E\u003C\/b\u003E\u003Ci\u003E \u003C\/i\u003Eand\u003Ci\u003E \u003C\/i\u003E\u003Cb\u003E\u003Ci\u003Egroupby \u0026lt; srcipv4\u003C\/i\u003E\u003C\/b\u003E\u003Ci\u003E,\u003Cb\u003E \u003C\/b\u003E\u003C\/i\u003Ewhich highlight the least common geolocations, User Agent strings, and IP addresses, can also assist in identifying anomalies in results.\u003C\/p\u003E\n\u003Cp\u003EQuerying UAL for a user in Helix:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003Eclass=ms_office365 username=user@client.com | table [createdtime, action, username, srcipv4, srccountry, srcregion, useragent, rawmsg] | groupby \u0026lt; [srccountry,srcregion]\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EQuerying UAL for a user in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003ESearch-UnifiedAuditLog -StartDate mm\/dd\/yyyy -EndDate (Get-Date) -ResultSize 5000 -UserIds user@client.com | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EQuerying MAL for a user in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003ESearch-MailboxAuditLog -Identity user@client.com -LogonTypes Owner,Delegate,Admin -ShowDetails -StartDate (Get-Date).AddDays(-90) -EndDate (Get-Date) | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EQuerying Admin Audit Log for all events within a certain date in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003ESearch-AdminAuditLog -StartDate mm\/dd\/yyyy -EndDate mm\/dd\/yyyy | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cb\u003EQuery UAL with New Leads\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003ENow that we’ve built a list of suspicious IP addresses (or even entire CIDR ranges) and User-Agent strings, we’ll run new queries against the entire UAL to try to identify other compromised user accounts. \u003Ci\u003EWe’ll repeat this step and the previous step for each newly identified user account.\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EOne advantage to using FireEye Helix platform over PowerShell is that we can query entire CIDR ranges. This is helpful when we observe attackers coming from a VPN or ISP that dynamically assigns IP addresses within the same address block.\u003C\/p\u003E\n\u003Cp\u003EQueries for attacker User-Agent strings usually generate more noise to sift through than IP address searches. In practice, User-Agent queries are only beneficial if the attackers are using an uncommon browser or version of a browser. Due to limitations of the \u003Cb\u003ESearch-UnifiedAuditLog\u003C\/b\u003E cmdlet, we’ve had the most success using the FreeText parameter and searching for simple strings.\u003C\/p\u003E\n\u003Cp\u003EIn Helix:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003Eclass=ms_office365 (srcipv4:[1.2.3.4, 2.3.4.0\/24] OR useragent:Opera) | table [createdtime, action, username, srcipv4, srccountry, srcregion, useragent, rawmsg] | groupby username\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EQuerying the UAL for IPs and user agents in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003ESearch-UnifiedAuditLog -StartDate mm\/dd\/yyyy -EndDate (Get-Date) -ResultSize 5000 -IPAddresses 1.2.3.4, 2.3.4.5 | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003ESearch-UnifiedAuditLog -StartDate mm\/dd\/yyyy -EndDate (Get-Date) -ResultSize 5000 -FreeText \u0026quot;Opera\u0026quot; | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cb\u003EAnalyze Message Traces\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EWe’ll use PowerShell to query message traces for the compromised users we’ve identified. If the email was sent within the past 10 days, use the \u003Cb\u003EGet-MessageTrace\u003C\/b\u003E cmdlet, which immediately returns results and allows teams to query IP addresses. For older emails, use the \u003Cb\u003EStart-HistoricalSearch\u003C\/b\u003E cmdlet and download the report later from the Mail Flow section of the Security \u0026amp; Compliance center.\u003C\/p\u003E\n\u003Cp\u003EQuerying for the last 10 days of mail sent by the victim in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EGet-MessageTrace -StartDate (Get-Date).AddDays(-10) -EndDate (Get-Date) -SenderAddress victim@client.com | Select-Object Received, SenderAddress, RecipientAddress, Subject, Status, FromIP, Size, MessageID | Export-CSV \\path\\to\\file.csv –NoTypeInformation -Encoding utf8\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EQuerying for older emails (up to 90 days) in PowerShell:\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EStart-HistoricalSearch -ReportTitle \u0026quot;Mandiant O365 investigation\u0026quot; -StartDate mm\/dd\/yyyy -EndDate mm\/dd\/yyyy -ReportType MessageTraceDetail -SenderAddress victim@client.com\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EAs Message Trace results are reviewed, attention should be given to IP addresses to determine which emails were sent by attackers. If phishing was the suspected initial compromise vector, it’s a good idea to also query for incoming mail received within a few days prior to the first compromise date and look for suspicious sender addresses and\/or subject lines.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EAcquire Emails of Interest\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EWith our list of suspicious emails identified from message traces, we’ll use the Content Search tool available in the Office 365 Security and Compliance Center acquire the email body and learn what domains were used in phishing lures (if phishing was present). Content Searches are performed by using a straightforward GUI, and the results can either be previewed in the browser, downloaded individually as EML files, or downloaded in bulk as PST files.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EFinal Scoping\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EAt this point of our investigation, the BEC should be sufficiently scoped within the tenant. To ensure any follow-on activity hasn’t occurred, we’ll take all of the attack indicators and perform our final queries across the UAL.\u003C\/p\u003E\n\u003Cp\u003EWith that said, there are still edge cases in which attacker activity wouldn’t appear in O365 logs. For example, perhaps an additional user has submitted their credentials to a phishing page, but the attackers haven’t used them to log in yet. To ensure we don’t miss this activity, we’ll perform additional scoping across available network logs, specifically for IP addresses and domains related to the attacker’s phishing infrastructure. We’ll also leverage other FireEye products, such as the Endpoint Security platform, to search for phishing domains present on a host’s web browser history.\u003C\/p\u003E\n\u003Ch4\u003EConclusion\u003C\/h4\u003E\n\u003Cp\u003EUnauthorized access to O365 tenant doesn’t just pose a threat to an organization, but also to its staff and business partners. Organizations without enhanced security controls in O365 are at the greatest risk of experiencing a BEC. However, as multi factor-authentication becomes more and more commonplace, we’ve witnessed an increase of MFA bypass attempts performed by increasingly proficient attackers.\u003C\/p\u003E\n\u003Cp\u003EIt’s important to remember that social engineering plays a primary role throughout a BEC. Ensure that users are trained on how to identify credential harvesting forms, a common compromise vector. When in the midst of a BEC compromise, teams may want to promptly alert personnel in HR and finance-related roles to exercise extra caution when processing requests related to banking or wire transfers while the investigation is in progress.\u003C\/p\u003E\n\u003Cp\u003EThe examples covered in this blog post are just a sample of what Managed Defense performs while investigating an Office 365 compromise. To take a proactive approach at preventing BECs, make sure the following best practices are implemented in a O365 tenant. Additionally, FireEye Email Security offers protections against phishing and the Helix platform’s O365 ruleset can alert on anomalous activity as soon as it happens.\u003C\/p\u003E\n\u003Ch4\u003ERecommended Best Practices\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EEnsure mailbox audit logging is enabled on all accounts\u003C\/li\u003E\n\u003Cli\u003EDisable Legacy Authentication protocols\u003C\/li\u003E\n\u003Cli\u003EEnable multi-factor authentication (MFA)\u003C\/li\u003E\n\u003Cli\u003EEnforce strong passwords and a password expiration policy\u003C\/li\u003E\n\u003Cli\u003EForward O365 audit logs to a centralized logging platform for extended retention\u003C\/li\u003E\n\u003Cli\u003EEnforce an account lockout policy in Azure\/on-premise Active Directory\u003C\/li\u003E\n\u003Cli\u003ERestrict mail forwarding to external domains\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EAcknowledgements\u003C\/h4\u003E\n\u003Cp\u003ESpecial thanks to Doug Bienstock, Glenn Edwards, Josh Madeley, and Tim Martin for their research and assistance on the topic.\u003C\/p\u003E\n",
        "jcr:lastModified": "Thu Jul 30 2020 18:52:11 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EIn this post we provide an overview on Business Email Compromise involving Office 365 and then offer details on how to effectively investigate these attacks.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu Jul 30 2020 18:32:49 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Thu Jul 30 2020 18:52:37 GMT+0000",
      "imageRotate": "0"
    }
  }
}
