{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Mon Apr 06 2020 12:00:06 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "Zero-Day Exploitation Increasingly Demonstrates Access to Money, Rather than Skill — Intelligence for Vulnerability Management, Part One",
    "jcr:versionHistory": "75403b44-7275-4a48-b516-ab16a60161ca",
    "author": "Kathleen Metrick",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "4c1e7a88-f3c3-423c-a538-9c97c0ef6706"
    ],
    "jcr:created": "Fri Jul 24 2020 06:59:10 GMT+0000",
    "cq:lastModified": "Fri Jul 24 2020 06:58:43 GMT+0000",
    "jcr:baseVersion": "4c1e7a88-f3c3-423c-a538-9c97c0ef6706",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:kathleen-metrick",
      "fireeye-blog-authors:parnian-najafi",
      "fireeye-blog-authors:jared-semrau",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:zero-day",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:threat-intelligence"
    ],
    "jcr:uuid": "6a7275ff-9f7c-4d4d-88e7-cb99e624aec4",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Apr 06 2020 08:00:00 GMT-0400",
    "cq:lastModifiedBy": "reference-adjustment-service",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003E\u003Ci\u003EOne of the critical strategic and tactical roles that cyber threat intelligence (CTI) plays is in the tracking, analysis, and prioritization of software vulnerabilities that could potentially put an organization’s data, employees and customers at risk. In this four-part blog series, \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/mandiant\/threat-intelligence.html\u0022\u003EFireEye Mandiant Threat Intelligence\u003C\/a\u003E highlights the value of CTI in enabling vulnerability management, and unveils new research into the latest threats, trends and recommendations.\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EFireEye Mandiant Threat Intelligence documented more zero-days exploited in 2019 than any of the previous three years. While not every instance of zero-day exploitation can be attributed to a tracked group, we noted that a wider range of tracked actors appear to have gained access to these capabilities. Furthermore, we noted a significant increase over time in the number of zero-days leveraged by groups suspected to be customers of companies that supply offensive cyber capabilities, as well as an increase in zero-days used against targets in the Middle East, and\/or by groups with suspected ties to this region. Going forward, we are likely to see a greater variety of actors using zero-days, especially as private vendors continue feeding the demand for offensive cyber weapons.\u003C\/p\u003E\n\u003Ch4\u003EZero-Day Usage by Country and Group\u003C\/h4\u003E\n\u003Cp\u003ESince late 2017, FireEye Mandiant Threat Intelligence noted a significant increase in the number of zero-days leveraged by groups that are known or suspected to be customers of private companies that supply offensive cyber tools and services. Additionally, we observed an increase in zero-days leveraged against targets in the Middle East, and\/or by groups with suspected ties to this region.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/intelvuln1\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003C\/p\u003E\n\u003Cp\u003EExamples include:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EA group described by researchers as\u0026nbsp;\u003Ca href=\u0022https:\/\/citizenlab.ca\/2016\/05\/stealth-falcon\/\u0022 title=\u0022https:\/\/citizenlab.ca\/2016\/05\/stealth-falcon\/\u0022\u003EStealth Falcon\u003C\/a\u003E\u0026nbsp;and\u0026nbsp;\u003Ca href=\u0022https:\/\/www.securityweek.com\/windows-zero-day-exploited-fruityarmor-sandcat-threat-groups\u0022 title=\u0022https:\/\/www.securityweek.com\/windows-zero-day-exploited-fruityarmor-sandcat-threat-groups\u0022\u003EFruityArmor\u003C\/a\u003E\u0026nbsp;is an espionage group that has\u0026nbsp;reportedly\u0026nbsp;\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.welivesecurity.com\/2019\/09\/09\/backdoor-stealth-falcon-group\/\u0022\u003Etargeted journalists and activists in the Middle East\u003C\/a\u003E. In 2016, this group used malware sold by NSO group, which leveraged three iOS zero-days. From 2016 to 2019, this group used more zero-days than any other group.\u003C\/li\u003E\n\u003Cli\u003EThe activity dubbed SandCat in open sources, suspected to be linked to \u003Ca href=\u0022https:\/\/www.vice.com\/en_us\/article\/3kx5y3\/uzbekistan-hacking-operations-uncovered-due-to-spectacularly-bad-opsec\u0022\u003EUzbekistan state intelligence\u003C\/a\u003E, has been observed using zero-days in operations against targets in the Middle East. This group may have acquired their zero-days by purchasing malware from private companies such as NSO group, as the zero-days used in SandCat operations were also used in Stealth Falcon operations, and it is unlikely that these distinct activity sets independently discovered the same three zero-days.\u003C\/li\u003E\n\u003Cli\u003EThroughout 2016 and 2017, activity referred to in open sources as \u003Ca href=\u0022https:\/\/www.securityweek.com\/middle-east-group-uses-flash-zero-day-deliver-spyware\u0022\u003EBlackOasis\u003C\/a\u003E, which also primarily targets entities in the Middle East and likely acquired at least one zero-day in the past from \u003Ca href=\u0022https:\/\/www.cyberscoop.com\/middle-eastern-hacking-group-using-finfisher-malware-conduct-international-espionage\/\u0022\u003Eprivate company Gamma Group\u003C\/a\u003E, demonstrated similarly frequent access to zero-day vulnerabilities.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EWe also noted examples of zero-day exploitation that have not been attributed to tracked groups but that appear to have been leveraged in tools provided by private offensive security companies, for instance:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EIn 2019, a zero-day exploit in WhatsApp (CVE-2019-3568) was \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.itpro.co.uk\/spyware\/33632\/whatsapp-call-hack-installs-spyware-on-users-phones\u0022\u003Ereportedly used to distribute spyware\u003C\/a\u003E developed by NSO group, an Israeli software company.\u003C\/li\u003E\n\u003Cli\u003EFireEye analyzed activity targeting a Russian healthcare organization that leveraged a 2018 Adobe Flash zero-day (CVE-2018-15982) that may be linked to leaked source code of Hacking Team.\u003C\/li\u003E\n\u003Cli\u003EAndroid zero-day vulnerability CVE-2019-2215 was \u003Ca href=\u0022https:\/\/thehackernews.com\/2019\/10\/android-kernel-vulnerability.html\u0022\u003Ereportedly being exploited in the wild\u003C\/a\u003E in October 2019 by NSO Group tools.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EZero-Day Exploitation by Major Cyber Powers\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EWe have continued to see exploitation of zero days by espionage groups of major cyber powers.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EAccording to researchers, the Chinese espionage group APT3 exploited CVE-2019-0703 in \u003Ca href=\u0022https:\/\/www.symantec.com\/blogs\/threat-intelligence\/buckeye-windows-zero-day-exploit\u0022\u003Etargeted attacks in 2016\u003C\/a\u003E.\u003C\/li\u003E\n\u003Cli\u003EFireEye observed North Korean group APT37 conduct a 2017 campaign that leveraged Adobe Flash vulnerability CVE-2018-4878. This group has also demonstrated an increased capacity to quickly exploit vulnerabilities shortly after they have been disclosed.\u003C\/li\u003E\n\u003Cli\u003EFrom December 2017 to January 2018, we observed multiple Chinese groups leveraging CVE-2018-0802 in a campaign targeting multiple industries throughout Europe, Russia, Southeast Asia, and Taiwan. At least three out of six samples were used before the patch for this vulnerability was issued.\u003C\/li\u003E\n\u003Cli\u003EIn 2017, Russian groups \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2017\/05\/eps-processing-zero-days.html\u0022\u003EAPT28 and Turla leveraged multiple zero-days\u003C\/a\u003E in Microsoft Office products.\u0026nbsp;\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EIn addition, we believe that some of the most dangerous state sponsored intrusion sets are increasingly demonstrating the ability to quickly exploit vulnerabilities that have been made public. In multiple cases, groups linked to these countries have been able to weaponize vulnerabilities and incorporate them into their operations, aiming to take advantage of the window between disclosure and patch application.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EZero-Day Use by Financially Motivated Actors\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EFinancially motivated groups have and continue to \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2016\/05\/windows-zero-day-payment-cards.html\u0022\u003Eleverage zero-days in their operations\u003C\/a\u003E, though with less frequency than espionage groups.\u003C\/p\u003E\n\u003Cp\u003EIn May 2019, we reported that FIN6 used a Windows server 2019 use-after-free zero-day (CVE-2019-0859) in a targeted intrusion in February 2019. Some evidence suggests that the group may have used the exploit since August 2018. While open sources have suggested that the group potentially acquired the zero-day from criminal underground actor \u0026quot;\u003Ca href=\u0022https:\/\/www.ibtimes.com\/hacker-selling-windows-zero-days-worlds-most-dangerous-hacker-groups-2789374\u0022\u003EBuggiCorp\u003C\/a\u003E,\u0026quot; we have not identified direct evidence linking this actor to this exploit\u0027s development or sale.\u003C\/p\u003E\n\u003Ch4\u003EConclusion\u003C\/h4\u003E\n\u003Cp\u003EWe surmise that access to zero-day capabilities is becoming increasingly commodified based on the proportion of zero-days exploited in the wild by suspected customers of private companies. Possible reasons for this include:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EPrivate companies are likely creating and supplying a larger proportion of zero-days than they have in the past, resulting in a concentration of zero-day capabilities among highly resourced groups.\u003C\/li\u003E\n\u003Cli\u003EPrivate companies may be increasingly providing offensive capabilities to groups with lower overall capability and\/or groups with less concern for operational security, which makes it more likely that usage of zero-days will be observed.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EIt is likely that state groups will continue to support internal exploit discovery and development; however, the availability of zero-days through private companies may offer a more attractive option than relying on domestic solutions or underground markets. As a result, we expect that the number of adversaries demonstrating access to these kinds of vulnerabilities will almost certainly increase and will do so at a faster rate than the growth of their overall offensive cyber capabilities—provided they have the ability and will to spend the necessary funds.\u003C\/p\u003E\n\u003Cp\u003ERegister today\u0026nbsp;to hear FireEye Mandiant Threat Intelligence experts discuss the latest in \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/392772\u0022\u003Evulnerability threats, trends and recommendations\u003C\/a\u003E in our upcoming April 30 webinar.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003ESourcing Note: Some vulnerabilities and zero-days were identified based on FireEye research, Mandiant breach investigation findings, and other technical collections. This paper also references vulnerabilities and zero-days discussed in open sources including\u0026nbsp;\u003C\/i\u003E\u003Ca href=\u0022https:\/\/docs.google.com\/spreadsheets\/d\/1lkNJ0uQwbeC1ZTRrxdtuPLCIl7mlUreoKfSIgajnSyY\/view#gid=1123292625\u0022\u003E\u003Ci\u003EGoogle Project Zero\u0027s zero-day \u0026quot;In the Wild\u0026quot; Spreadsheet\u003C\/i\u003E\u003C\/a\u003E\u003Ci\u003E. While we believe these sources are reliable as used in this paper, we do not vouch for the complete findings of those sources. Due to the ongoing discovery of past incidents, we expect that this research will remain dynamic.\u003C\/i\u003E\u003C\/p\u003E\n",
        "jcr:lastModified": "Fri Apr 03 2020 20:27:41 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EFireEye Mandiant Threat Intelligence documented more zero-days exploited in 2019 than any of the previous three years.\u003C\/p\u003E\n",
      "jcr:lastModified": "Fri Apr 03 2020 19:55:09 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Fri Apr 03 2020 20:15:06 GMT+0000",
      "imageRotate": "0"
    }
  }
}
