{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Mon Mar 04 2019 08:02:13 GMT-0500",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "APT40: Examining a China-Nexus Espionage Actor",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "7ba4c594-aa5f-4a65-9521-c6f564893747",
    "author": "Fred Plan",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "adam.greenberg@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "82a7eeeb-4d00-4bb9-ba8a-62e8b33bf67c"
    ],
    "jcr:created": "Mon Mar 04 2019 11:21:15 GMT-0500",
    "cq:lastReplicated": "Mon Mar 04 2019 11:21:15 GMT-0500",
    "cq:lastModified": "Mon Mar 04 2019 11:21:05 GMT-0500",
    "jcr:baseVersion": "82a7eeeb-4d00-4bb9-ba8a-62e8b33bf67c",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:fred-plan",
      "fireeye-blog-authors:nalani-fraser",
      "fireeye-blog-authors:jacqueline-oleary",
      "fireeye-blog-authors:vincent-cannon",
      "fireeye-blog-authors:ben-read",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:apt",
      "fireeye-blog-tags:china",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest"
    ],
    "jcr:uuid": "a2db74b7-2039-4e6e-9076-8c5f651fc2bd",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Mar 04 2019 08:00:00 GMT-0500",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EFireEye is highlighting a cyber espionage operation targeting crucial technologies and traditional intelligence targets from a China-nexus state sponsored actor we call APT40. The actor has conducted operations since at least 2013 in support of China’s naval modernization effort. The group has specifically targeted engineering, transportation, and the defense industry, especially where these sectors overlap with maritime technologies. More recently, we have also observed specific targeting of countries strategically important to the Belt and Road Initiative including Cambodia, Belgium, Germany, Hong Kong, Philippines, Malaysia, Norway, Saudi Arabia, Switzerland, the United States, and the United Kingdom. This China-nexus cyber espionage group was previously reported as TEMP.Periscope and TEMP.Jumper.\u003C\/p\u003E\n\u003Ch4\u003EMission\u003C\/h4\u003E\n\u003Cp\u003EIn December 2016, China’s People Liberation Army Navy (PLAN) seized a U.S. Navy unmanned underwater vehicle (UUV) operating in the South China Sea. The incident paralleled China’s actions in cyberspace; within a year APT40 was observed masquerading as a UUV manufacturer, and targeting universities engaged in naval research. That incident was one of many carried out to acquire advanced technology to support the development of Chinese naval capabilities. We believe APT40’s emphasis on maritime issues and naval technology ultimately support China’s ambition to establish a blue-water navy.\u003C\/p\u003E\n\u003Cp\u003EIn addition to its maritime focus, APT40 engages in broader regional targeting against traditional intelligence targets, especially organizations with operations in Southeast Asia or involved in South China Sea disputes. Most recently, this has included \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/07\/chinese-espionage-group-targets-cambodia-ahead-of-elections.html\u0022\u003Evictims with connections to elections\u003C\/a\u003E in Southeast Asia, which is likely driven by events affecting China’s Belt and Road Initiative. China’s “One Belt, One Road” (一带一路) or “Belt and Road Initiative” (BRI) is a $1 trillion USD endeavor to build land and maritime trade routes across Asia, Europe, the Middle East, and Africa to develop a trade network that will project China’s influence across the greater region.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/APT40\/Figure%201c.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Countries and industries targeted. Countries include the United States, United Kingdom, Norway, Germany, Saudi Arabia, Cambodia and Indonesia\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EAttribution\u003C\/h4\u003E\n\u003Cp\u003EWe assess with moderate confidence that APT40 is a state-sponsored Chinese cyber espionage operation. The actor’s targeting is consistent with Chinese state interests and there are multiple technical artifacts indicating the actor is based in China. Analysis of the operational times of the group’s activities indicates that it is probably centered around China Standard Time (UTC +8). In addition, multiple APT40 command and control (C2) domains were initially registered by China based domain resellers and had Whois records with Chinese location information, suggesting a China based infrastructure procurement process.\u003C\/p\u003E\n\u003Cp\u003EAPT40 has also used multiple Internet Protocol (IP) addresses located in China to conduct its operations. In one instance, a log file recovered from an \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/07\/chinese-espionage-group-targets-cambodia-ahead-of-elections.html\u0022\u003Eopen indexed server\u003C\/a\u003E revealed that an IP address (112.66.188.28) located in Hainan, China had been used to administer the command and control node that was communicating with malware on victim machines. All of the logins to this C2 were from computers configured with Chinese language settings.\u003C\/p\u003E\n\u003Ch4\u003EAttack Lifecycle\u003C\/h4\u003E\n\u003Cp\u003E\u003Ci\u003EInitial Compromise\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAPT40 has been observed leveraging a variety of techniques for initial compromise, including web server exploitation, phishing campaigns delivering publicly available and custom backdoors, and strategic web compromises.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EAPT40 relies heavily on web shells for an initial foothold into an organization. Depending on placement, a web shell can provide continued access to victims\u0027 environments, re-infect victim systems, and facilitate lateral movement.\u003C\/li\u003E\n\u003Cli\u003EThe operation’s spear-phishing emails typically leverage malicious attachments, although Google Drive links have also been observed.\u003C\/li\u003E\n\u003Cli\u003EAPT40 leverages exploits in their phishing operations, often weaponizing vulnerabilities within days of their disclosure. Observed vulnerabilities include:\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/12-19517\u0022\u003ECVE-2012-0158\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/17-00003493\u0022\u003ECVE-2017-0199\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/17-00010114\u0022\u003ECVE-2017-8759\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/intelligence.fireeye.com\/reports\/17-00012724\u0022\u003ECVE-2017-11882\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/APT40\/Figure%202.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: APT40 attack lifecycle\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EEstablish Foothold\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAPT40 uses a variety of malware and tools to establish a foothold, many of which are either publicly available or used by other threat groups. In some cases, the group has used executables with code signing certificates to avoid detection.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EFirst-stage backdoors such as AIRBREAK, FRESHAIR, and BEACON are used before downloading other payloads.\u003C\/li\u003E\n\u003Cli\u003EPHOTO, BADFLICK, and CHINA CHOPPER are among the most frequently observed backdoors used by APT40.\u003C\/li\u003E\n\u003Cli\u003EAPT40 will often target VPN and remote desktop credentials to establish a foothold in a targeted environment. This methodology proves to be ideal as once these credentials are obtained, they may not need to rely as heavily on malware to continue the mission.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EEscalate Privileges\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAPT40 uses a mix of custom and publicly available credential harvesting tools to escalate privileges and dump password hashes.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EAPT40 leverages custom credential theft utilities such as HOMEFRY, a password dumper\/cracker used alongside the AIRBREAK and BADFLICK backdoors.\u003C\/li\u003E\n\u003Cli\u003EAdditionally, the Windows Sysinternals ProcDump utility and Windows Credential Editor (WCE) are believed to be used during intrusions as well.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EInternal Reconnaissance\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAPT40 uses compromised credentials to log on to other connected systems and conduct reconnaissance. The group also leverages RDP, SSH, legitimate software within the victim environment, an array of native Windows capabilities, publicly available tools, as well as custom scripts to facilitate internal reconnaissance.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EAPT40 used MURKYSHELL at a compromised victim organization to port scan IP addresses and conduct network enumeration.\u003C\/li\u003E\n\u003Cli\u003EAPT40 frequently uses native Windows commands, such as net.exe, to conduct internal reconnaissance of a victim’s environment.\u003C\/li\u003E\n\u003Cli\u003EWeb shells are heavily relied on for nearly all stages of the attack lifecycle. Internal web servers are often not configured with the same security controls as public-facing counterparts, making them more vulnerable to exploitation by APT40 and similarly sophisticated groups.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003ELateral Movement\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAPT40 uses many methods for lateral movement throughout an environment, including custom scripts, web shells, a variety of tunnelers, as well as Remote Desktop Protocol (RDP). For each new system compromised, the group usually executes malware, performs additional reconnaissance, and steals data.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EAPT40 also uses native Windows utilities such as at.exe (a task scheduler) and net.exe (a network resources management tool) for lateral movement.\u003C\/li\u003E\n\u003Cli\u003EPublicly available tunneling tools are leveraged alongside distinct malware unique to the operation.\u003C\/li\u003E\n\u003Cli\u003EAlthough MURKYTOP is primarily a command-line reconnaissance tool, it can also be used for lateral movement.\u003C\/li\u003E\n\u003Cli\u003EAPT40 also uses publicly available brute-forcing tools and a custom utility called DISHCLOTH to attack different protocols and services.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EMaintain Presence\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAPT40 primarily uses backdoors, including web shells, to maintain presence within a victim environment. These tools enable continued control of key systems in the targeted network.\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EAPT40 strongly favors web shells for maintaining presence, especially publicly available tools.\u003C\/li\u003E\n\u003Cli\u003ETools used during the Establish Foothold phase also continue to be used in the Maintain Presence phase; this includes AIRBREAK and PHOTO.\u003C\/li\u003E\n\u003Cli\u003ESome APT40 malware tools can evade typical network detectiona by leveraging legitimate websites, such as GitHub, Google, and Pastebin for initial C2 communications.\u003C\/li\u003E\n\u003Cli\u003ECommon TCP ports 80 and 443 are used to blend in with routine network traffic.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EComplete Mission\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ECompleting missions typically involves gathering and transferring information out of the target network, which may involve moving files through multiple systems before reaching the destination. APT40 has been observed consolidating files acquired from victim networks and using the archival tool rar.exe to compress and encrypt the data before exfiltration. We have also observed APT40 develop tools such as PAPERPUSH to aid in the effectiveness of their data targeting and theft.\u003C\/p\u003E\n\u003Ch4\u003EOutlook and Implications\u003C\/h4\u003E\n\u003Cp\u003EDespite increased public attention, APT40 continues to conduct cyber espionage operations following a regular tempo, and we anticipate their operations will continue through at least the near and medium term. Based on APT40’s broadening into election-related targets in 2017, we assess with moderate confidence that the group’s future targeting will affect additional sectors beyond maritime, driven by events such as China’s Belt and Road Initiative. In particular, as individual Belt and Road projects unfold, we are likely to see continued activity by APT40 which extends against the project’s regional opponents.\u003C\/p\u003E\n",
        "jcr:lastModified": "Mon Mar 04 2019 11:21:05 GMT-0500",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe provide details on APT40, a state-sponsored Chinese cyber espionage operation.\u003C\/p\u003E\n",
      "jcr:lastModified": "Tue Feb 26 2019 01:07:27 GMT-0500",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Sun Mar 03 2019 22:24:20 GMT-0500",
      "imageRotate": "0"
    }
  }
}
