{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Thu May 27 2021 16:59:57 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Re-Checking Your Pulse: Updates on Chinese APT Actors Compromising Pulse Secure VPN Devices",
    "jcr:versionHistory": "643535d2-43d9-424a-b3fe-662648fb3e41",
    "author": "Dan Perez",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "ab0a4d12-4490-42a1-8f54-dd5c5c435481"
    ],
    "jcr:created": "Wed Jul 14 2021 15:35:42 GMT+0000",
    "cq:lastModified": "Wed Jul 14 2021 15:35:35 GMT+0000",
    "jcr:baseVersion": "ab0a4d12-4490-42a1-8f54-dd5c5c435481",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:dan-perez",
      "fireeye-blog-authors:sarah-jones",
      "fireeye-blog-authors:greg-wood",
      "fireeye-blog-authors:stephen-eckels",
      "fireeye-blog-authors:emiel-haeghebaert",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:malware",
      "fireeye-blog-tags:TTPs"
    ],
    "jcr:uuid": "47921638-58e8-4190-b3a5-6bbd00cdfc92",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu May 27 2021 13:00:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EOn April 20, 2021, Mandiant published detailed results of our investigations into \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2021\/04\/suspected-apt-actors-leverage-bypass-techniques-pulse-secure-zero-day.html\u0022\u003Ecompromised Pulse Secure devices by suspected Chinese espionage operators\u003C\/a\u003E. This blog post is intended to provide an update on our findings, give additional recommendations to network defenders, and discuss potential implications for U.S.-China strategic relations.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EMandiant continues to gather evidence and respond to intrusions involving compromises of Pulse Secure VPN appliances at organizations across the defense, government, high tech, transportation, and financial sectors in the U.S. and Europe (Figure 1).\u003C\/li\u003E\n\u003Cli\u003EReverse engineers on the FLARE team have identified four additional code families specifically designed to manipulate Pulse Secure devices.\u0026nbsp;\u003C\/li\u003E\n\u003Cli\u003EWe now assess that espionage activity by UNC2630 and UNC2717 supports key Chinese government priorities. Many compromised organizations operate in verticals and industries aligned with Beijing’s strategic objectives outlined in China’s recent 14th Five Year Plan.\u003C\/li\u003E\n\u003Cli\u003EWhile there is evidence of data theft at many organizations, we have not directly observed the staging or exfiltration of any data by Chinese espionage actors that could be considered a violation of the Obama-Xi \u003Ca href=\u0022https:\/\/obamawhitehouse.archives.gov\/the-press-office\/2015\/09\/25\/fact-sheet-president-xi-jinpings-state-visit-united-states\u0022\u003Eagreement\u003C\/a\u003E.\u003C\/li\u003E\n\u003Cli\u003EMandiant Threat Intelligence assesses that Chinese cyber espionage activity has demonstrated a higher tolerance for risk and is less constrained by diplomatic pressures than previously characterized.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/pulse-update\/fig1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Organizations with compromised Pulse Secure devices by vertical and geographic location\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EPulse Secure continues to work closely with Mandiant, affected customers, government partners, and other forensic experts to address these issues. Pulse Secure’s parent company, Ivanti, has released patches to proactively address software vulnerabilities and issued updated \u003Ca href=\u0022https:\/\/kb.pulsesecure.net\/articles\/Pulse_Security_Advisories\/SA44784\u0022\u003ESecurity Advisories\u003C\/a\u003E\u0026nbsp;and\u0026nbsp;\u003Ca href=\u0022https:\/\/kb.pulsesecure.net\/articles\/Pulse_Secure_Article\/KB44755\u0022\u003EKnowledge\u0026nbsp;Articles\u003C\/a\u003E to assist customers. (Please see the Forensics, Remediation, and Hardening Guidelines section for additional details.)\u003C\/p\u003E\n\u003Ch4\u003EUNC2630 and UNC2717 Tradecraft and Response to Disclosure\u003C\/h4\u003E\n\u003Cp\u003EMandiant is tracking 16 malware families exclusively designed to infect Pulse Secure VPN appliances and used by several cyber espionage groups which we believe are affiliated with the Chinese government. Between April 17\u0026nbsp;and April 20, 2021, Mandiant incident responders observed UNC2630 access dozens of compromised devices and remove webshells like ATRIUM and SLIGHTPULSE.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EUnder certain conditions, the Integrity Checker Tool (ICT) will show no evidence of compromise on appliances which may have had historical compromise. This false negative may be returned because the ICT cannot scan the rollback partition. If a backdoor or persistence patcher exists on the rollback partition and a Pulse Secure appliance is rolled back to the prior version, the backdoor(s) will be present on the appliance. Please see the Forensics, Remediation, and Hardening Guidelines section for important information regarding the ICT and upgrade process.\u003C\/li\u003E\n\u003Cli\u003EIn at least one instance, UNC2630 deleted their webshell(s) but did not remove the persistence patcher, making it possible to regain access when the device was upgraded. \u0026nbsp;The remaining persistence patcher causes the malicious code to be executed later during a system upgrade, re-inserts webshell logic into various files on the appliance, and recompromises the device.\u003C\/li\u003E\n\u003Cli\u003EIt is unusual for Chinese espionage actors to remove a large number of backdoors across several victim environments on or around the time of public disclosure. This action displays an interesting concern for operational security and a sensitivity to publicity.\u003Cbr\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EBoth UNC2630 and UNC2717 display advanced tradecraft and go to impressive lengths to avoid detection. The actors modify file timestamps and regularly edit or delete forensic evidence such as logs, web server core dumps, and files staged for exfiltration. They also demonstrate a deep understanding of network appliances and advanced knowledge of a targeted network. This tradecraft can make it difficult for network defenders to establish a complete list of tools used, credentials stolen, the initial intrusion vector, or the intrusion start date.\u003C\/p\u003E\n\u003Ch4\u003EUpdates from Incident Response Investigations\u003C\/h4\u003E\n\u003Cp\u003EWe continue to suspect that multiple groups including UNC2630 and UNC2717 are responsible for this activity, despite the use of similar exploits and tools. There is a high degree of variation in attacker actions within victim environments, with actors inconsistently using a combination of tools and command and control IP addresses.\u003C\/p\u003E\n\u003Cp\u003EReverse engineers on the FLARE team have identified four additional malware families specifically designed to manipulate Pulse Secure devices (Table 1). These utilities have similar functions to the 12 previously documented malware families: harvesting credentials and sensitive system data, allowing arbitrary file execution, and removing forensic evidence. Please see the Technical Annex for detailed analysis of these code families.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EMalware Family\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022418\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EDescription\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002278\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EActor\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EBLOODMINE\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022418\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EBLOODMINE is a utility for parsing Pulse Secure Connect log files. It extracts information related to logins, Message IDs and Web Requests and copies the relevant data to another file.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002278\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EUNC2630\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EBLOODBANK\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022418\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EBLOODBANK is a credential theft utility that parses two files containing password hashes or plaintext passwords and expects an output file to be given at the command prompt.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002278\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EUNC2630\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECLEANPULSE\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022418\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ECLEANPULSE is a memory patching utility that may be used to prevent certain log events from occurring. It was found in close proximity to an ATRIUM webshell.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002278\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EUNC2630\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERAPIDPULSE\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022418\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ERAPIDPULSE is a webshell capable of arbitrary file read. As is common with other webshells, RAPIDPULSE exists as a modification to a legitimate Pulse Secure file. RAPIDPULSE can serve as an encrypted file downloader for the attacker.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002278\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EUNC2630\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 1: New malware families identified\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EInitial Compromise\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe actors leveraged several vulnerabilities in Pulse Secure VPN appliances. Mandiant observed the use of the recently patched vulnerability CVE-2021-22893 to compromise fully patched Pulse Secure appliances as well as previously disclosed vulnerabilities from 2019 and 2020. In many cases, determining the initial exploitation vector and timeframe was not possible to determine because the actors altered or deleted forensic evidence, or the appliance had undergone subsequent code upgrades thereby destroying evidence related to the initial exploitation.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EEstablish Foothold\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EIn some cases, Mandiant observed the actors create their own Local Administrator account outside of established credential management controls on Windows servers of strategic value. This allowed the actor to maintain access to systems with short-cycle credential rotation policies and provided a sufficient level of access to operate freely within their target environment. The actors also maintained their foothold into the targeted environments exclusively through Pulse Secure webshells and malware without relying on backdoors deployed on internal Windows or Linux endpoints.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EEscalate Privileges\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EMandiant observed the actors use three credential harvesting techniques on Windows systems:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ETargeting of clear text passwords and hashes from memory using the credential harvesting tool Mimikatz. Instead of being copied locally and executed on the target system, Mandiant saw evidence of the Mimikatz binary on the source system of an RDP session (i.e. the threat actor’s system that was connected to the VPN) through an RDP mapped drive.\u003C\/li\u003E\n\u003Cli\u003ECopying and exfiltration of the SAM, SECURITY, and SYSTEM registry hives which contained cached NTLM hashes for Local and Domain accounts.\u003C\/li\u003E\n\u003Cli\u003ELeveraging the Windows Task Manager process to target the Local Security Authority Subsystem Service (LSASS) process memory for NTLM hashes.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EIn addition to these privilege escalation techniques, the actors specifically targeted separate privileged accounts belonging to individuals whose unprivileged accounts were previously compromised (likely through the Pulse Secure credential harvesting malware families). It is unclear how the account associations were made by the actor.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EInternal Reconnaissance\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EMandiant found evidence that the actors renamed their own workstations that they connected to the VPN of victim networks to mimic the naming convention of their target environment. This practice aligns with the actor’s objective for long-term persistence and evading detection and demonstrates a familiarity with the internal hostnames in the victim environment.\u003C\/p\u003E\n\u003Cp\u003EThe actors operated solely by utilizing Windows-based utilities to carry out tasks. Some of the utilities observed were net.exe, quser.exe, powershell.exe, powershell_ise.exe, findstr.exe, netstat.exe, cmd.exe, reg.exe and tasklist.exe.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EMove Laterally\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EMost lateral movement originated from compromised Pulse Secure VPN appliances to internal systems within the environment. \u0026nbsp;While connected to the Pulse VPN appliance, the actor’s system was assigned an IP address from the Pulse VPN DHCP pool and they moved laterally throughout the environments by leveraging the Remote Desktop Protocol (RDP), the Secure Shell Protocol (SSH), and browser-based communication to HTTPS hosted resources. The actors also accessed other resources such as Microsoft M365 cloud environments using stolen credentials they had previously acquired.\u003C\/p\u003E\n\u003Cp\u003EMandiant also observed the actors targeting ESXi host servers. The actor enabled SSH on ESXi hosts that were previously disabled via the web interface. When their operations on the system were finished, the actors disabled SSH on the ESXi host again and cleared or preemptively disabled all relevant logging associated with the performed activities. This includes authentication, command history, and message logging on the system.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EMaintain Presence\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EMandiant observed the threat actor maintain persistence by compromising the upgrade process on the Pulse Secure Appliance.\u0026nbsp; Persistence was primarily achieved by modifying the legitimate DSUpgrade.pm file to install the ATRIUM webshell across each upgrade performed by an administrator.\u0026nbsp; The actor likely chose DSUpgade.pm to host their patch logic as it is a core file in the system upgrade procedure, ensuring the patch is applied during updates. The patcher modifies content in \/tmp\/data as this directory holds the extracted upgrade image the newly upgraded system will boot into. This results in a persistence mechanism which allows the actor to maintain access to the system across updates.\u003C\/p\u003E\n\u003Cp\u003EThe actors also achieved persistence in other cases by prepending a bash script to the file \/bin\/umount normally used to unmount a Linux filesystem. This binary was targeted by the actor because it is executed by the Pulse Secure appliance during a system upgrade. The actor’s script verifies that the umount binary executes with a specific set of arguments, which are identical to the arguments used by the Pulse Secure appliance to executes the binary. The inserted malicious bash script remounts the filesystem as read-write and iterates through a series of bash routines to inject the ATRIUM webshell, hide SLOWPULSE from a legacy file integrity bash script, remove or add itself from the umount file, and validate the web process was running after a reboot to return the filesystem back to read-only.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EComplete Mission\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe threat actor’s objectives appear to be stealing credentials, maintaining long-term persistent access to victim networks, and accessing or exfiltrating sensitive data. Mandiant has observed the attackers:\u003Ci\u003E\u003C\/i\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EStaging data related to sensitive projects, often in C:\\Users\\Public\u003C\/li\u003E\n\u003Cli\u003ENaming exfiltration archives to resemble Windows Updates (KB) or to match the format KB\u0026lt;digits\u0026gt;.zip\u003C\/li\u003E\n\u003Cli\u003EUsing the JAR\/ZIP file format for data exfiltration\u003C\/li\u003E\n\u003Cli\u003EDeleting exfiltrated archives\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EAnalysis of new malware families is included in the Technical Annex to enable defenders to quickly assess if their respective appliances have been affected. Relevant MITRE ATT\u0026amp;CK techniques, Yara rules and hashes are published on \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/github.com\/fireeye\/pulsesecure_exploitation_countermeasures\u0022\u003EMandiant’s GitHub page\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003EForensics, Remediation, and Hardening Guidelines\u003C\/h4\u003E\n\u003Cp\u003ETo begin an investigation, Pulse Secure users should contact their Customer Support Representative for assistance completing the following steps:\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003ECapture memory and a forensic image of the appliance\u003C\/li\u003E\n\u003Cli\u003ERun the Pulse Integrity Checker Tool found online\u003C\/li\u003E\n\u003Cli\u003ERequest a decrypted image of each partition and a memory dump\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003ETo remediate a compromised Pulse Secure appliance: \u0026nbsp;\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003ECaution must be taken when determining if a Pulse Secure device was compromised at any previous date. If the Integrity Checker Tool (ICT) was not run before the appliance was updated, the only evidence of compromise will exist in the system rollback partition which cannot be scanned by the ICT. If an upgrade was performed without first using the ICT, a manual inspection of the rollback partition is required to determine if the device was previously compromised.\u003C\/li\u003E\n\u003Cli\u003ETo ensure that no malicious logic is copied to a clean device, users must perform upgrades from the appliance console rather than the web interface. The console upgrade process follows a separate code path that will not execute files such as DSUpgrade.pm.\u003Cu\u003E\u003C\/u\u003E\u003C\/li\u003E\n\u003Cli\u003EPrevious versions of the ICT will exit if run on an unsupported software version. For every ICT scan, ensure that the ICT would have supported the device\u0027s version number.\u003Cu\u003E\u003C\/u\u003E\u003C\/li\u003E\n\u003Cli\u003EReset all passwords in the environment.\u003C\/li\u003E\n\u003Cli\u003EUpgrade to the most recent software version.\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003ETo secure the appliance and assist with future investigations, consider implementing the following:\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003EEnable unauthenticated logging and configure syslog for Events, User \u0026amp; Admin Access\u003C\/li\u003E\n\u003Cli\u003EForward all logs to a central log repository\u003C\/li\u003E\n\u003Cli\u003EReview logs for unusual authentications and evidence of exploitation\u003C\/li\u003E\n\u003Cli\u003ERegularly run the Integrity Checker Tool\u003C\/li\u003E\n\u003Cli\u003EApply patches as soon as they are made available\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Ch4\u003EGeopolitical Context and Implications for U.S.-China Relations\u003C\/h4\u003E\n\u003Cp\u003EIn collaboration with intelligence analysts at BAE Systems Applied Intelligence, Mandiant has identified dozens of organizations across the defense, government, telecommunications, high tech, education, transportation, and financial sectors in the U.S. and Europe that have been compromised via vulnerabilities in Pulse Secure VPNs. Historic Mandiant and BAE investigations identified a significant number of these organizations as previous APT5 targets.\u003C\/p\u003E\n\u003Cp\u003ENotably, compromised organizations operate in verticals and industries aligned with Beijing’s strategic objectives as outlined in China’s 14th Five Year Plan. Many manufacturers also compete with Chinese businesses in the high tech, green energy, and telecommunications sectors. Despite this, we have not directly observed the staging or exfiltration of any data by Chinese espionage actors that could be considered a violation of the Obama-Xi agreement.\u003C\/p\u003E\n\u003Cp\u003ETargets of Chinese cyber espionage operations are often selected for their alignment with national strategic goals, and there is a strong correlation between pillar industries listed in policy white papers and targets of Chinese cyber espionage activity.\u003C\/p\u003E\n\u003Cp\u003EChina has outlined eight key areas of vital economic interest for development and production which it views as essential to maintaining global competitiveness, under the following categories: energy, healthcare, railway transportation, telecommunications, national defense and stability, advanced manufacturing, network power, and sports and culture.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EHistorical Context\u003Cu\u003E\u003Cb\u003E\u003C\/b\u003E\u003C\/u\u003E\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EIn the \u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/current-threats\/pdfs\/rpt-china-espionage.pdf\u0022\u003E\u003Ci\u003ERed Line Drawn\u003C\/i\u003E\u003C\/a\u003E\u003Ci\u003E \u003C\/i\u003Ereport, Mandiant documented a significant decline in the volume of Chinese cyberespionage activity in 2014 and assessed that the restructuring of China\u0027s military and civilian intelligence agencies significantly impacted Chinese cyber operations. Then, in September 2015, President Xi of China concluded a bilateral agreement with U.S. President Obama to prohibit state-sponsored theft of intellectual property for the purpose of providing commercial advantage. Commercial IP theft has historically been a prominent characteristic of Chinese cyber espionage activity.\u003C\/p\u003E\n\u003Cp\u003EIn 2018 we conducted an extensive \u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/summit\/cds-2018\/presentations\/cds18-executive-s05-redline-redrawn.pdf\u0022\u003Ereview\u003C\/a\u003E of Chinese cyber espionage operations, both before and after the official announcement of the PLA reforms and bilateral agreement to determine if there were any corresponding changes in the tactics, techniques, and procedures (TTPs) used during Chinese cyberespionage operations. We observed two important changes in the type of information stolen and the geographic distribution of the targets.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EDespite examining hundreds of incidents from January 2016 through mid 2019, we did not find definitive evidence of purely commercial application intellectual property theft in the US. Recent \u003Ca href=\u0022https:\/\/www.justice.gov\/opa\/pr\/two-chinese-hackers-working-ministry-state-security-charged-global-computer-intrusion\u0022\u003Eindictments\u003C\/a\u003E by the US Department of Justice suggest that this theft did occur. While we observed other malicious activity, including geopolitical targeting, theft of intellectual property with military applications, and theft of confidential business information, we did not find evidence that these cyber operations violated the Obama-Xi agreement.\u003C\/li\u003E\n\u003Cli\u003EBetween January 2016 and mid-2019, the geographic focus of Chinese cyber operations shifted dramatically to Asia and away from the U.S. and Europe. While the U.S. remained the single most frequently targeted country, it became a much smaller percentage of observed activity. From 2012–2015, U.S. targeting constituted nearly 70 percent of all observed Chinese cyber espionage, while from January 2016 through August 2019, U.S. targeting fell to approximately 20 percent of Chinese activity. Targeting of Europe represented a similar proportion of overall Chinese activity to targeting of the Americas.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003EChanges in Chinese Espionage Activity between 2019 and 2021\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EBased on developments observed between 2019-2021, Mandiant Threat Intelligence assesses that most Chinese APT actors now concentrate on lower-volume but more-sophisticated, stealthier operations collecting strategic intelligence to support Chinese strategic political, military, and economic goals. While some of the technical changes may be the result of the restructuring of China\u0027s military and civilian organizations, some changes possibly reflect larger technical trends in cyber operations overall.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EBefore the reorganization, it was common to observe multiple Chinese espionage groups targeting the same organization, often targeting the same types of information. Post-2015, this duplication of efforts is rare.\u003C\/li\u003E\n\u003Cli\u003EChinese espionage groups developed more efficient and purposeful targeting patterns by transitioning away from spearphishing and relying on end user software vulnerabilities and instead began exploiting networking devices and web facing applications in novel ways. Chinese APT actors also began to leverage supply chain vulnerabilities and to target third party providers to gain access to primary targets.\u003C\/li\u003E\n\u003Cli\u003ERecently observed Chinese cyber espionage activity exhibits an increased diligence in operational security, familiarity with network defender investigation techniques, and cognizance of the forensic evidence they leave behind.\u003C\/li\u003E\n\u003Cli\u003EWe observe the resurgence of older Chinese espionage groups, including APT4 and APT5 after long periods of dormancy and currently active groups engage in frequent and widespread campaigns.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ci\u003ERedline Withdrawn?\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe Obama-Xi agreement prohibits the theft of intellectual property with purely commercial applications for the purpose of gaining a competitive advantage. It does not cover government or diplomatic information, sensitive business communications, IT data, PII, or intellectual property with military or dual use applications.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWe have direct evidence of UNC2630, UNC2717 and other Chinese APT actors stealing credentials, email communications, and intellectual property with dual commercial and military applications.\u003C\/li\u003E\n\u003Cli\u003EThroughout our investigations, we did not directly observe the staging or exfiltration of any data by Chinese espionage actors that could be considered a violation of the Obama-Xi agreement.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EGiven the narrow definition of commercial intellectual property theft and the limited availability of forensic evidence, it is possible that our assessment will change with the discovery of new information.\u003C\/p\u003E\n\u003Cp\u003EEvidence collected by Mandiant over the past decade suggests that norms and diplomatic agreements do not significantly limit China\u0027s use of its cyber threat capabilities, particularly when serving high-priority missions.\u003C\/p\u003E\n\u003Cp\u003EThe greater ambition and risk tolerance demonstrated by Chinese policymakers since 2019 indicates that the tempo of Chinese state-sponsored activity may increase in the near future and that the Chinese cyber threat apparatus presents a renewed and serious threat to US and European commercial entities.\u003C\/p\u003E\n\u003Ch4\u003EAcknowledgements\u003C\/h4\u003E\n\u003Cp\u003EMandiant would like to thank analysts at BAE Systems Applied Intelligence, Stroz Friedberg, and Pulse Secure for their hard work, collaboration and partnership. The team would also like to thank Scott Henderson, Kelli Vanderlee, Jacqueline O\u0027Leary, Michelle Cantos, and all the analysts who worked on Mandiant’s \u003Ci\u003ERed Line Redrawn\u003C\/i\u003E project. The team would also like to thank Mike Dockry, Josh Villanueva, Keith Knapp, and all the incident responders who worked on these engagements.\u003C\/p\u003E\n\u003Ch4\u003EAdditional Resources\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/us-cert.cisa.gov\/ncas\/alerts\/aa-21-110a\u0022\u003ECISA Alert (AA21-110A): Exploitation of Pulse Connect Secure Vulnerabilities\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/kb.pulsesecure.net\/articles\/Pulse_Security_Advisories\/SA44101\/\u0022\u003EPulse Secure Advisory SA44101: Multiple vulnerabilities resolved in Pulse Connect Secure \/ Pulse Policy Secure 9.0RX\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/kb.pulsesecure.net\/articles\/Pulse_Secure_Article\/SA44784\/\u0022\u003EPulse Secure Advisory SA44784: Multiple Vulnerabilities Resolved in Pulse Connect Secure 9.1R11.4\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/kb.pulsesecure.net\/articles\/Pulse_Secure_Article\/KB44764\u0022\u003EPulse Secure Customer FAQ\u0026nbsp;KB44764: PCS Security Integrity Tool Enhancements\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/kb.pulsesecure.net\/articles\/Pulse_Secure_Article\/KB44755\u0022\u003EPulse Secure KB44755: Pulse Connect Secure (PCS) Integrity Assurance\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EDetecting the Techniques\u003C\/h4\u003E\n\u003Cp\u003EThe following table contains specific FireEye product detection names for the malware families associated with this updated information.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EPlatform(s)\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EDetection Name\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENetwork Security\u003C\/p\u003E\n\u003Cp\u003EEmail Security\u003C\/p\u003E\n\u003Cp\u003EDetection On Demand\u003C\/p\u003E\n\u003Cp\u003EMalware File Scanning\u003C\/p\u003E\n\u003Cp\u003EMalware File Storage Scanning\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EFE_APT_Tool_Linux32_BLOODMINE_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Tool_Linux_BLOODMINE_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Tool_Linux32_BLOODBANK_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Tool_Linux_BLOODBANK_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Tool_Linux32_CLEANPULSE_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Tool_Linux_CLEANPULSE_1\u003C\/li\u003E\n\u003Cli\u003EFE_APT_Webshell_PL_RAPIDPULSE_1\u003C\/li\u003E\n\u003Cli\u003EFEC_APT_Webshell_PL_RAPIDPULSE_1\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EEndpoint Security\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EReal-Time Detection (IOC)\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EBLOODBANK (UTILITY)\u003C\/li\u003E\n\u003Cli\u003EBLOODMINE (UTILITY)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHelix\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022312\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EEstablish Foothold\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [User Account Created]\u003C\/li\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [User Created - Net Command]\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EEscalate Privileges\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [Mimikatz Args]\u003C\/li\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [Invoke-Mimikatz Powershell Artifacts]\u003C\/li\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [LSASS Memory Access]\u003C\/li\u003E\n\u003Cli\u003EWINDOWS METHODOLOGY [LSASS Generic Dump Activity]\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EInternal Reconnaissance\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWINDOWS ANALYTICS [Recon Commands]\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cb\u003EMove Laterally\u003C\/b\u003E\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EWINDOWS ANALYTICS [Abnormal RDP Logon]\u003C\/li\u003E\n\u003Cli\u003EOFFICE 365 ANALYTICS [Abnormal Logon]\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003ETechnical Annex\u003C\/h4\u003E\n\u003Cp\u003E\u003Ci\u003EBLOODMINE\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EBLOODMINE is a utility for parsing Pulse Secure Connect log files. It extracts information related to logins, Message IDs and Web Requests and copies the relevant data to another file.\u003C\/p\u003E\n\u003Cp\u003EThe sample takes three command line arguments\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003EFilename to read\u003C\/li\u003E\n\u003Cli\u003EFilename to write\u003C\/li\u003E\n\u003Cli\u003ETimeout interval\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003EIt parses the input file for login status codes:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAUT31504\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAUT24414\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAUT22673\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAUT22886\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAUT23574\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EIt parses the input file for web results code WEB20174. If it finds a web result code, it looks for file extensions:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.css\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.jpg\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.png\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.gif\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.ico\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.js\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.jsp\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThese strings indicate the type of data that is collected from web requests:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EWeb login, IP: %s, User: %s, Realm: %s, Roles: %s, Browser: %s\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAgent login, IP: %s, User: %s, Realm: %s, Roles: %s, Client: %s\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ELogout, IP: %s, User: %s, Realm: %s, Roles: %s\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ESession end, IP: %s, User: %s, Realm: %s, Roles: %s\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENew session, IP: %s, User: %s, Realm: %s, Roles: %s, New IP: %s\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHost check, Policy: %s\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EWebRequest completed, IP: %s, User: %s, Realm: %s, Roles: %s, %s to %s:\/\/%s:%s\/%s from %s\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Ci\u003EBLOODBANK\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EBLOODBANK is a credential theft utility that parses two LMDB (an in memory database) files and expects an output file to be given at the command prompt. BLOODBANK takes advantage of a legitimate process that supports Single Sign On functionality and looks for plaintext passwords when they are briefly loaded in memory.\u003C\/p\u003E\n\u003Cp\u003EThe utility parses the following two files containing password hashes or plaintext passwords:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\/home\/runtime\/mtmp\/lmdb\/data0\/data.mdb\u003C\/li\u003E\n\u003Cli\u003E\/home\/runtime\/mtmp\/system\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EBLOODBANK expects an output file as a command line parameter, otherwise it prints file open error. It contains the following strings which it likely tries to extract and target.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EPRIMARY\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ESECONDARY\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Eremoteaddr\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Euser@\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ElogicUR\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ElogicTim\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Epassw@\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EuserAge\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Erealm\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ESourc\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Ci\u003ECLEANPULSE\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ECLEANPULSE is a memory patching utility that may be used to prevent certain log events from occurring. The utility inserts two strings from the command line into the target process and patches code to conditionally circumvent a function call in the original executable.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003EFile Name\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003EFile Type\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003ESize\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003ECompile Time\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003Edsrlog\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003EELF.X86\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003E13332\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThe utility expects to be run from the command line as follows:\u003C\/p\u003E\n\u003Cp style=\u0022margin-left: 40px;\u0022\u003Edrslog \u0026lt;pid\u0026gt; \u0026lt;code2_string\u0026gt; \u0026lt;code3_string\u0026gt; \u0026lt;command\u0026gt;\u003C\/p\u003E\n\u003Cp\u003EWhere \u0026lt;pid\u0026gt; is the pid process ID to patch in memory, \u0026lt;code2_string\u0026gt; and \u0026lt;code3_string\u0026gt; are two strings to write into the target process, and \u0026lt;command\u0026gt; is either \u0027e\u0027 or \u0027E\u0027 for installation or \u0027u\u0027 or \u0027U\u0027 for uninstallation.\u003C\/p\u003E\n\u003Cp\u003EDuring installation (using the \u0027e\u0027 or \u0027E\u0027 \u0026lt;command\u0026gt;), the \u0026lt;code2_string\u0026gt; \u0026lt;code3_string\u0026gt; command line strings are written to the target process at hard-coded memory addresses, a small amount of code is written, and a jump instruction to the code snippet is patched in memory of the target process. The added code checks whether an argument is equal to either \u0026lt;code2_string\u0026gt; \u0026lt;code3_string\u0026gt; strings, and if, so skips a function call in the target process.\u003C\/p\u003E\n\u003Cp\u003EDuring uninstall (using the \u0027u\u0027 or \u0027U\u0027 \u0026lt;command\u0026gt;) the patch jump location is overwritten with what appears to be the original 8 bytes of instructions, and the two additional memory buffers and the code snippet appear to be overwritten with zeros.\u003C\/p\u003E\n\u003Cp\u003EThe CLEANPULSE utility is highly specific to a victim environment. It does not contain any validation code when patching (i.e. verifying that code is expected prior to modifying it), and it contains hard-coded addresses to patch.\u003C\/p\u003E\n\u003Cp\u003EThe target code to patch appears to be the byte sequence: 89 4C 24 08 FF 52 04. This appears as the last bytes in the patched code, and is the 8-bytes written when the uninstall \u0027u\u0027 command is given.\u003C\/p\u003E\n\u003Cp\u003EThese bytes correspond to the following two instructions:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.data:0804B138 89 4C 24 08\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; mov\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; [esp+8], ecx\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022624\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E.data:0804B13C FF 52 04\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; call\u0026nbsp;\u0026nbsp;\u0026nbsp; dword ptr [edx+4]\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThis byte sequence occurs at the hard-coded patch address the utility expects, dslogserver. Based on status and error messages in nearby functions the executable dslogserver appears to be related to log event handling, and the purpose of the CLEANPULSE utility may be to prevent certain events from being logged.\u003C\/p\u003E\n\u003Cp\u003EThere are several un-referenced functions that appear to have been taken from the open source project PUPYRAT. It is likely that the actor re-purposed this open source code, using PUPYRAT as a simple template project.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003ERAPIDPULSE\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ERAPIDPULSE is a webshell capable of arbitrary file read. As is common with other webshells, RAPIDPULSE exists as a modification to a legitimate Pulse Secure file.\u003C\/p\u003E\n\u003Cp\u003EThe webshell modifies the legitimate file\u0027s main routine which compares the HTTP query parameter with key name: deviceid to a specific \u0026nbsp;key with value. If the parameter matches, then the sample uses an RC4 key\u0026nbsp; to decrypt HTTP query parameter with key name: hmacTime. This decrypted value is a filename which the sample then opens, reads, RC4 encrypts with the same key, base64 encodes, then writes to stdout. The appliance redirects stdout as the response to HTTP requests. This serves as an encrypted file download for the attacker.\u003C\/p\u003E\n\u003Ch4\u003EIntegrity Checker Tool and Other Validation Checks\u003C\/h4\u003E\n\u003Cp\u003EIn our public report, we noted two code families that manipulate\u0026nbsp;check_integrity.sh, a legitimate script used during a normal system upgrade. This validation script was modified by the actor to exit early so that it would not perform the intended checks.\u003C\/p\u003E\n\u003Cp\u003EPer Ivanti, the validation provided by check_integrity.sh is a separate validation feature and not the same as the \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/kb.pulsesecure.net\/articles\/Pulse_Secure_Article\/KB44755\u0022\u003EIntegrity Checker Tool (ICT)\u003C\/a\u003E available on their website. They recommend that organizations use the online ICT to confirm that hashes of files on their Pulse Secure devices match Ivanti’s list of known good hashes. Please note that the ICT does not\u0026nbsp;scan the rollback partition.\u003C\/p\u003E\n",
        "jcr:lastModified": "Wed Jul 14 2021 15:35:35 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe provide an update on our investigation into compromised Pulse Secure devices by suspected Chinese espionage operators.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu May 27 2021 16:43:53 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Thu May 27 2021 16:54:29 GMT+0000",
      "imageRotate": "0"
    }
  }
}
