{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed May 04 2016 09:04:24 GMT-0400",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "China-based Cyber Threat Group Uses Dropbox for Malware Communications and Targets Hong Kong Media Outlets",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "8cf42b61-75d4-4fd3-a9f2-24d18c2b4958",
    "author": "FireEye Threat Intelligence",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "lynda.hall@fireeye.com",
    "focusKeyword": "Dropbox",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "13f1bb62-f1f2-48cb-a9a8-4f9fef4d102c"
    ],
    "jcr:created": "Wed Apr 05 2017 20:43:01 GMT-0400",
    "cq:lastReplicated": "Wed Apr 05 2017 20:43:00 GMT-0400",
    "cq:lastModified": "Wed Apr 05 2017 20:43:00 GMT-0400",
    "cq:distribute": true,
    "jcr:baseVersion": "13f1bb62-f1f2-48cb-a9a8-4f9fef4d102c",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-tags:malware",
      "fireeye-blog-tags:news",
      "fireeye-doctypes:blog",
      "fireeye-blog-threat-research:threat-research\/threat-intelligence",
      "fireeye-blog-tags:command-and-control",
      "fireeye-blog-authors:cap-fireEye-threat-intelligence",
      "fireeye-blog-threat-research:threat-research"
    ],
    "jcr:uuid": "d8687c93-b1e7-4784-adee-d32124bdee1b",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Tue Dec 01 2015 08:00:00 GMT-0500",
    "_charset_": "UTF-8",
    "cq:lastModifiedBy": "admin",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "lynn.thorne@fireeye.com",
        "text": "\u003Cp\u003EFireEye Threat Intelligence analysts identified a spear phishing campaign carried out in August 2015 targeting Hong Kong-based media organizations. A China-based cyber threat group, which FireEye tracks as an uncategorized advanced persistent threat (APT) group and other researchers refer to as “admin@338,” may have conducted the activity.\u003Ca name=\u0022_ednref1\u0022\u003E\u003C\/a\u003E[1] The email messages contained malicious documents with a malware payload called LOWBALL. LOWBALL abuses the Dropbox cloud storage service for command and control (CnC). We collaborated with Dropbox to investigate the threat, and our cooperation revealed what may be a second, similar operation. The attack is part of a trend where threat groups hide malicious activity by communicating with legitimate web services such as social networking and cloud storage sites to foil detection efforts.\u003Ca name=\u0022_ednref2\u0022\u003E\u003C\/a\u003E[2]\u003Ca name=\u0022_ednref3\u0022\u003E\u003C\/a\u003E[3]\u003C\/p\u003E\n\u003Ch3\u003EA Cyber Campaign Likely Intended to Monitor Hong Kong Media During a Period of Crisis\u003C\/h3\u003E\n\u003Cp\u003EThe threat group has previously used newsworthy events as lures to deliver malware.\u003Ca name=\u0022_ednref4\u0022\u003E\u003C\/a\u003E[4] They have largely targeted organizations involved in financial, economic and trade policy, typically using publicly available RATs such as Poison Ivy, as well some non-public backdoors.\u003Ca name=\u0022_ednref5\u0022\u003E\u003C\/a\u003E[5]\u003C\/p\u003E\n\u003Cp\u003EThe group started targeting Hong Kong media companies, probably in response to political and economic challenges in Hong Kong and China. The threat group’s latest activity coincided with the announcement of criminal charges against democracy activists.\u003Ca name=\u0022_ednref6\u0022\u003E\u003C\/a\u003E[6] During the past 12 months, Chinese authorities have faced several challenges, including large-scale protests in Hong Kong in late 2014, the precipitous decline in the stock market in mid-2015, and the massive industrial explosion in Tianjin in August 2015. In Hong Kong, the pro-democracy movement persists, and the government recently denied a professor a post because of his links to a pro-democracy leader.\u003Ca name=\u0022_ednref7\u0022\u003E\u003C\/a\u003E[7]\u003C\/p\u003E\n\u003Cp\u003EMultiple China-based cyber threat groups have targeted international media organizations in the past. The targeting has often focused on Hong Kong-based media, particularly those that publish pro-democracy material. The media organizations targeted with the threat group’s well-crafted Chinese language lure documents are precisely those whose networks Beijing would seek to monitor. Cyber threat groups’ access to the media organization’s networks could potentially provide the government advance warning on upcoming protests, information on pro-democracy group leaders, and insights needed to disrupt activity on the Internet, such as what occurred in mid-2014 when several websites were brought down in denial of service attacks.\u003Ca name=\u0022_ednref8\u0022\u003E\u003C\/a\u003E[8]\u003C\/p\u003E\n\u003Ch3\u003E\u003Cspan class=\u0022type-L\u0022\u003EThreat Actors Use Spear Phishing Written in Traditional Chinese Script in Attempted Intrusions\u003C\/span\u003E\u003C\/h3\u003E\n\u003Cp\u003EIn August 2015, the threat actors sent spear phishing emails to a number of Hong Kong-based media organizations, including newspapers, radio, and television. The first email references the creation of a Christian civil society organization to coincide with the anniversary of the 2014 protests in Hong Kong known as the Umbrella Movement. The second email references a Hong Kong University alumni organization that fears votes in a referendum to appoint a Vice-Chancellor will be co-opted by pro-Beijing interests.\u003Ca name=\u0022_ednref9\u0022\u003E\u003C\/a\u003E[9]\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/hongkongdropbox\/hongkongdropboxfig1.jpg\u0022\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Lure Screenshots\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe group’s previous activities against financial and policy organizations have largely focused on spear phishing emails written in English, destined for Western audiences. This campaign, however, is clearly designed for those who read the traditional Chinese script commonly used in Hong Kong.\u003C\/p\u003E\n\u003Ch3\u003E\u003Cspan class=\u0022type-L\u0022\u003ELOWBALL Malware Analysis\u003C\/span\u003E\u003C\/h3\u003E\n\u003Cp\u003EThe spear phishing emails contained three attachments in total, each of which exploited an older vulnerability in Microsoft Office (CVE-2012-0158):\u003C\/p\u003E\n\u003Ctable cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMD5\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFilename\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Eb9208a5b0504cb2283b1144fc455eaaa\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E使命公民運動 我們的異象.doc\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Eec19ed7cddf92984906325da59f75351\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E新聞稿及公佈.doc\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E6495b384748188188d09e9d5a0c401a4\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E(代發)[采訪通知]港大校友關注組遞信行動.doc\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EIn all three cases, the payload was the same:\u003C\/p\u003E\n\u003Ctable cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMD5\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFilename\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ed76261ba3b624933a6ebb5dd73758db4\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Etime.exe\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThis backdoor, known as LOWBALL, uses the legitimate Dropbox cloud-storage\u003Cbr\u003E\nservice to act as the CnC server. It uses the Dropbox API with a hardcoded bearer access token and has the ability to download, upload, and execute files. The communication occurs via HTTPS over port 443.\u003C\/p\u003E\n\u003Cp\u003EAfter execution, the malware will use the Dropbox API to make an HTTP GET request using HTTPS over TCP port 443 for the files:\u003C\/p\u003E\n\u003Ctable cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMD5\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EFilename\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ed76261ba3b624933a6ebb5dd73758db4\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EWmiApCom\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E79b68cdd0044edd4fbf8067b22878644\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022221\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EWmiApCom.bat\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThe “WmiApCom.bat” file is simply used to start “WmiApCom”, which happens to be the exact same file as the one dropped by the malicious Word documents. However, this is most likely meant to be a mechanism to update the compromised host with a new version of the LOWBALL malware.\u003C\/p\u003E\n\u003Cp\u003EThe threat group monitors its Dropbox account for responses from compromised computers. Once the LOWBALL malware calls back to the Dropbox account, the attackers will create a file called “[COMPUTER_NAME]_upload.bat” which contains commands to be executed on the compromised computer. This batch file is then executed on the target computer, with the results uploaded to the attackers’ Dropbox account in a file named “[COMPUTER_NAME]_download”.\u003C\/p\u003E\n\u003Cp\u003EWe observed the threat group issue the following commands:\u003C\/p\u003E\n\u003Ctable width=\u0022100%\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E@echo off\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;dir c:\\ \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;ipconfig \/all \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;net user \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;net user \/domain \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;ver \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;del %0\u0026nbsp;\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E@echo off\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;dir \u0026quot;c:\\Documents and Settings\u0026quot; \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;dir \u0026quot;c:\\Program Files\\\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;\u0026quot; \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;net start \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;net localgroup administrator \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;netstat -ano \u0026gt;\u0026gt; %temp%\\download\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThese commands allow the threat group to gain information about the compromised computer and the network to which it belongs. Using this information, they can decide to explore further or instruct the compromised computer to download additional malware.\u003C\/p\u003E\n\u003Cp\u003EWe observed the threat group upload a second stage malware, known as BUBBLEWRAP (also known as Backdoor.APT.FakeWinHTTPHelper) to their Dropbox account along with the following command:\u003C\/p\u003E\n\u003Ctable width=\u0022100%\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E@echo off\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;ren \u0026quot;%temp%\\upload\u0026quot; audiodg.exe\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;start %temp%\\audiodg.exe\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;dir d:\\ \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;systeminfo \u0026gt;\u0026gt; %temp%\\download\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;del %0\u0026nbsp;\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EWe have previously observed the admin@338 group use BUBBLEWRAP. This particular sample connected to the CnC domain accounts.serveftp[.]com, which resolved to an IP address previously used by the threat group, although the IP had not been used for some time prior to this most recent activity:\u003C\/p\u003E\n\u003Ctable cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022148\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMD5\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022148\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022148\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022148\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E0beb957923df2c885d29a9c1743dd94b\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022148\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Eaccounts.serveftp.com\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022148\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E59.188.0.197\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EBUBBLEWRAP is a full-featured backdoor that is set to run when the system boots, and can communicate using HTTP, HTTPS, or a SOCKS proxy. This backdoor collects system information, including the operating system version and hostname, and includes functionality to check, upload, and register plugins that can further enhance its capabilities.\u003C\/p\u003E\n\u003Ch3\u003E\u003Cspan class=\u0022type-L\u0022\u003EA Second Operation\u003C\/span\u003E\u003C\/h3\u003E\n\u003Cp\u003EFireEye works closely with security researchers and industry partners to mitigate cyber threats, and we collaborated with Dropbox to respond to this activity. The Dropbox security team was able to identify this abuse and put countermeasures in place.\u003C\/p\u003E\n\u003Cp\u003EOur cooperation uncovered what appears to be a second, ongoing operation, though we lack sufficient evidence to verify if admin@338 is behind it. The attack lifecycle followed the same pattern, though some of the filenames were different, which indicates that there may be multiple versions of the malware. In addition, while the operation targeting Hong Kong-based media involved a smaller number of targets and a limited duration, we suspect this second operation involves up to 50 targets. At this time, we are unable to identify the victims.\u003C\/p\u003E\n\u003Cp\u003EIn this case, after the payload is delivered via an exploit the threat actor places files (named upload.bat, upload.rar, and period.txt, download.txt or silent.txt) in a directory on a Dropbox account. The malware beacons to this directory using the hardcoded API token and attempts to download these files (which are deleted from the Dropbox account after the download):\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003Eupload.bat, a batch script that the compromised machine will execute\u003C\/li\u003E\n\u003Cli\u003Eupload.rar, a RAR archive that contains at least two files: a batch script to execute, and often an executable (sometimes named rar.exe) \u0026nbsp;which the batch script will run and almost always uploads the results of download.rar to the cloud storage account\u003C\/li\u003E\n\u003Cli\u003Esilent.txt and period.txt, \u0026nbsp;small files sizes of 0-4 bytes that dictate the frequency to check in with the CnC\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe threat actor will then download the results and then delete the files from the cloud storage account.\u003C\/p\u003E\n\u003Ch1\u003E\u003Cspan class=\u0022type-L\u0022\u003EConclusion\u003C\/span\u003E\u003C\/h1\u003E\n\u003Cp\u003ELOWBALL is an example of malware that abuses cloud storage services to mask its activity from network defenders. The LOWBALL first stage malware allows the group to collect information from victims and then deliver the BUBBLEWRAP second stage malware to their victims after verifying that they are indeed interesting targets.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EA version of this article appeared first on the \u003C\/i\u003E\u003Ca href=\u0022\/content\/dam\/fireeye-www\/products\/pdfs\/pf\/intel\/ds-fireeye-intelligence-center.pdf\u0022\u003E\u003Ci\u003EFireEye Intelligence Center\u003C\/i\u003E\u003C\/a\u003E\u003Ci\u003E. The FireEye Intelligence Center provides access to strategic intelligence, analysis tools, intelligence sharing capabilities, and institutional knowledge based on over 10 years of FireEye and Mandiant experience detecting, responding to and tracking advanced threats. FireEye uses a proprietary intelligence database, along with the expertise of our Threat Intelligence Analysts, to power the Intelligence Center.\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn1\u0022\u003E\u003C\/a\u003E[1] FireEye currently tracks this activity as an “uncategorized” group, a cluster of related threat activity about which we lack information to classify with an advanced persistent threat number.\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn2\u0022\u003E\u003C\/a\u003E[2] FireEye. Hiding in Plain Sight: FireEye and Microsoft Expose Obfuscation Tactic. \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www2.fireeye.com\/rs\/fireye\/images\/APT17_Report.pdf\u0022\u003Ehttps:\/\/www2.fireeye.com\/rs\/fireye\/images\/APT17_Report.pdf\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn3\u0022\u003E\u003C\/a\u003E[3] FireEye. \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2015\/07\/hammertoss_stealthy.html\u0022\u003EHAMMERTOSS: Stealthy Tactics Define a Russian Cyber Threat Group\u003C\/a\u003E. \u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn4\u0022\u003E\u003C\/a\u003E[4] Moran, Ned and Alex Lanstein. FireEye. “Spear Phishing the News Cycle: APT Actors Leverage Interest in the Disappearance of Malaysian Flight MH 370.” 25 March 2014. https:\/\/www.fireeye.com\/blog\/threat-research\/2014\/03\/spear-phishing-the-news-cycle-apt-actors-leverage-interest-in-the-disappearance-of-malaysian-flight-mh-370.html.\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn5\u0022\u003E\u003C\/a\u003E[5] Moran, Ned and Thoufique Haq. FireEye. “\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2013\/10\/know-your-enemy-tracking-a-rapidly-evolving-apt-actor.html\u0022\u003EKnow Your Enemy: Tracking a Rapidly Evolving APT Actor\u003C\/a\u003E.” 31 October 2013. \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/dam\/fireeye-www\/global\/en\/current-threats\/pdfs\/rpt-poison-ivy.pdf.\u0022\u003EFireEye. Poison Ivy: Assessing Damage and Extracting Intelligence\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn6\u0022\u003E\u003C\/a\u003E[6] BBC News. “Hong Kong student leaders charged over Umbrella Movement.’” 27 August 2015. http:\/\/www.bbc.com\/news\/world-asia-china-34070695.\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn7\u0022\u003E\u003C\/a\u003E[7] Zhao, Shirley, Joyce Ng, and Gloria Chan. “University of Hong Kong’s council votes 12-8 to reject Johannes Chan’s appointment as pro-vice-chancellor.” 30 September 2015. http:\/\/www.scmp.com\/news\/hong-kong\/education-community\/article\/1862423\/surprise-move-chair-university-hong-kong.\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn8\u0022\u003E\u003C\/a\u003E[8] Wong, Alan. Pro-Democracy Media Company’s Websites Attacked.\u0026nbsp; “Pro-Democracy Media Company’s Websites Attacked.” New York Times. 18 June 2014. http:\/\/sinosphere.blogs.nytimes.com\/2014\/06\/18\/pro-democracy-media-companys-websites-attacked\/.\u003C\/p\u003E\n\u003Cp\u003E\u003Ca name=\u0022_edn9\u0022\u003E\u003C\/a\u003E[9] “HKU concern group raises proxy fears in key vote.” EIJ Insight. 31 August 2015. http:\/\/www.ejinsight.com\/20150831-hku-concern-group-raises-proxy-fears-in-key-vote\/.\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\n",
        "jcr:lastModified": "Tue Dec 01 2015 10:54:38 GMT-0500",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "alt": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "comments": {
        "jcr:primaryType": "nt:unstructured",
        "sling:resourceType": "social\/commons\/components\/comments"
      },
      "trackback": {
        "jcr:primaryType": "nt:unstructured",
        "sling:resourceType": "social\/blog\/components\/trackback"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "matthew.sawicki@fireeye.com",
      "text": "\u003Cp\u003EA spear-phishing campaign that targets Hong Kong-based media organizations is using Dropbox for its malware communications.\u003Cbr\u003E\n\u003C\/p\u003E\n",
      "jcr:lastModified": "Mon Nov 30 2015 17:02:09 GMT-0500",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    }
  }
}
