{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed Apr 18 2018 02:01:45 GMT-0400",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "How the Rise of Cryptocurrencies Is Shaping the Cyber Crime Landscape: Blockchain Infrastructure Use",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "7eb70cf8-6177-4f72-a761-6abc5b42e486",
    "author": "Randi Eitzman",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "adam.greenberg@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "190df24e-a2cd-47bb-8fd0-131864232830"
    ],
    "jcr:created": "Thu May 31 2018 13:19:47 GMT-0400",
    "cq:lastReplicated": "Thu May 31 2018 13:19:47 GMT-0400",
    "cq:lastModified": "Thu May 31 2018 13:19:07 GMT-0400",
    "jcr:baseVersion": "190df24e-a2cd-47bb-8fd0-131864232830",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:randi-eitzman",
      "fireeye-blog-authors:kimberly-goody",
      "fireeye-blog-authors:jessa-valdez",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:blockchain",
      "fireeye-blog-tags:command-and-control",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest"
    ],
    "jcr:uuid": "17b5e5bf-a5c0-4416-9445-6c575ca01a11",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Wed Apr 18 2018 02:00:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003E\u003Ci\u003EUPDATE (May 31, 2018): A section of the post on commonly used OpenNIC IPs has been removed to avoid any implication that the OpenNIC IPs are inherently malicious, which is not the case.\u003C\/i\u003E\u003C\/p\u003E\n\u003Ch4\u003EIntroduction\u003C\/h4\u003E\n\u003Cp\u003ECyber criminals have always been attracted to cryptocurrencies because it provides a certain level of anonymity and can be easily monetized. This interest has increased in recent years, stemming far beyond the desire to simply use cryptocurrencies as a payment method for illicit tools and services. Many actors have also attempted to capitalize on the growing popularity and subsequent rising price of cryptocurrencies by conducting various operations aimed at them, such as malicious cryptocurrency mining, collection of cryptocurrency wallet credentials, extortion activity, and the targeting of cryptocurrency exchanges.\u003C\/p\u003E\n\u003Cp\u003ECoinciding with the rising interest in stealing cryptocurrencies, distributed ledger technology (DLT), the technology that underpins cryptocurrencies, has also provided cyber criminals with a unique means of hosting their malicious content. This blog covers the growing trend of cyber criminals using blockchain domains for malicious infrastructure.\u003C\/p\u003E\n\u003Ch4\u003EBlockchain Infrastructure Use\u003C\/h4\u003E\n\u003Cp\u003ETraditionally, cyber criminals have used various methods to obfuscate malicious infrastructure that they use to host additional payloads, store stolen data, and\/or function as command and control (C2) servers. Traditional methods include using bulletproof hosting, fast-flux, Tor infrastructure, and\/or domain generation algorithms (DGAs) to help obfuscate the malicious infrastructure. While we expect cyber criminals to continue to use these techniques for the foreseeable future, another trend is emerging: the use of blockchain infrastructure.\u003C\/p\u003E\n\u003Ch4\u003EUnderground Interest in Blockchain Infrastructure\u003C\/h4\u003E\n\u003Cp\u003EFireEye iSIGHT Intelligence has identified eCrime actor interest in cryptocurrency infrastructure-related topics dating back to at least 2009 within underground communities. While searches for certain keywords fail to provide context, the frequency of specific words, such as blockchain, Namecoin, and .bit, show a sharp increase in conversations surrounding these topics beginning in 2015 (Figure 1).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig1.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Underground keyword mentions\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ENamecoin Domains\u003C\/h4\u003E\n\u003Cp\u003ENamecoin is a cryptocurrency based on the Bitcoin code that is used to register and manage domain names with the top-level domain (TLD) .bit. Everyone who registers a Namecoin domain is essentially their own domain registrar; however, domain registration is not associated with an individual\u0026#39;s name or address. Rather, domain ownership is based on the unique encrypted hash of each user. This essentially creates the same anonymous system as Bitcoin for internet infrastructure, in which users are only known through their cryptographic identity. Figure 2 illustrates the Namecoin domain name generation process.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig2.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Namecoin domain creation process\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EAs Namecoin is decentralized, with no central authority managing the network, domains registered with Namecoin are resistant to being hijacked or shut down. These factors, coupled with the comparative anonymity, make Namecoin an increasingly attractive option for cyber criminals in need of supporting infrastructure for their malicious operations.\u003C\/p\u003E\n\u003Ch4\u003ENavigating to Namecoin Domains\u003C\/h4\u003E\n\u003Cp\u003EDomains registered with Namecoin use the TLD .bit, and are not managed by standard DNS providers. Consequently, a client will be unable to establish a connection to these blockchain domains unless additional configurations are made. According to the \u003Ca href=\u0022https:\/\/wiki.namecoin.org\/index.php?title=Welcome\u0022\u003ENamecoin wiki\u003C\/a\u003E, individuals can take one of the steps shown in Figure 3 to browse .bit domains.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig3.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Options for navigating to Namecoin domains outlined on Namecoin wiki\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThese options are not ideal for cyber criminals, as downloading the entire blockchain onto an infected host would require significant space and bandwidth, and routing their malicious traffic through an unknown third party could result in their traffic being blocked by the resolver. As a result, many have configured their malware to query their own privately managed Namecoin-compatible OpenNIC DNS (Figure 4), or to query other compatible servers they\u0026#39;ve purchased through underground infrastructure offerings. Bulletproof hosting providers, such as Group 4, have capitalized on the increased demand for .bit domains by adding support to allow malicious actors to query compatible servers.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig4.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: Blockchain domain support advertised on OpenNIC website\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EUnderground Advertisements for Namecoin Support\u003C\/h4\u003E\n\u003Cp\u003EThe following underground advertisements relating to the use of .bit domains have been observed by researchers over the past several years. These posts range from actors offering .bit compatible modules or configuration updates for popular banking Trojans to .bit infrastructure offerings.\u003C\/p\u003E\n\u003Ch5\u003ESample Advertisement #1\u003C\/h5\u003E\n\u003Cp\u003EFigure 5 shows an advertisement, observed in late 2015, posted by the actor \u0026quot;wachdog\u0026quot; in a popular Russian-speaking marketplace. The actor advertised a small utility (10 KB in size) that is compatible with both Windows and Android operating systems, and would allow for the communication to and from .bit domains.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022575\u0022\u003E\u003Cp\u003E\u003Cb\u003EAdvertisement Translated Text:\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe code is written in C+ for WinAPI or Java for Android\u003Cb\u003E. It can be used for small stealth applications to access .bit domains.\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThe registration of new domain costs 0.02 NMC, update of a record - 0.005 NMC.\u003C\/p\u003E\n\u003Cp\u003ESo, the price for domain registration and update will be approximately 0.0072$ and 0.0018$.\u003C\/p\u003E\n\u003Cp\u003EThe code works in all Windows starting from XP, it doesn\u0026#39;t require additional libraries, admin privileges, it doesn\u0026#39;t download a lot of data. The size of compiled code is 10 KB. It\u0026#39;s easy to write it in asm, paskal, c#, java etc. It also works for Android (all versions).\u003C\/p\u003E\n\u003Cp\u003EYou should download the Namecoin wallet, credit it with the minimum amount of NMC and register your own domain using the wallet. IP of C\u0026amp;C can be linked to the domain also using the wallet (one of many, everything works as for normal DNS). Create a build of your software locked to .bit domain. In case the IP of your server is listed, just change the DNS record and assign your domain a new IP for just for 0.005 NMC. No need in new rebuild or registration of new domains. .bit domain cannot be taken, botnet cannot be stolen.\u003C\/p\u003E\n\u003Cp\u003EPrice:\u003C\/p\u003E\n\u003Cp\u003ETechnology + code in C: $300 USD\u003C\/p\u003E\n\u003Cp\u003ETechnology + code in C + code in Java for Android: $400 USD\u003Cbr\u003E\nPayment methods: BTC, PerfectMoney\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: Actor \u0026quot;wachdog\u0026quot; advertises utility to connect to .bit domains in late 2015\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch5\u003ESample Advertisement #2\u003C\/h5\u003E\n\u003Cp\u003EIn late 2017, actor \u0026quot;Discomrade\u0026quot; advertised a new HTTP distributed denial of service (DDoS) malware named \u0026quot;Coala\u0026quot; on a prominent Russian-language underground forum (Figure 6). According to the advertisement, Coala focuses on L7 (HTTP) attacks and can overcome Cloudflare, OVH, and BlazingFast DDoS protections. The original posting stated that the actor was working on adding support for .bit domains, and later updated the forum post to specify that Coala was able to support .bit domain communications.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022575\u0022\u003E\u003Cp\u003E\u003Cb\u003EAdvertisement Translated Text:\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003ECoala - Http DDoS Bot, .net 2.0, bypass cloudflare\/ovh\/blazi...\u003Cbr\u003E\nThe sale resumed.\u003C\/p\u003E\n\u003Cp\u003EI changed my decision to rewrite the bot from the scratch on native language.\u003Cbr\u003E\nI\u0026#39;m looking forward to hearing any ideas \/ comments\/ questions you have about improving this DDoS bot.\u003Cbr\u003E\nI updated and enhanced the bot using your previous comments and requests (changed communication model between server and bot, etc)\u003C\/p\u003E\n\u003Cp\u003EI added the following features\/options\/abilities:\u003C\/p\u003E\n\u003Cp\u003E- to customize the HTTP-headers (user-agent, cookie, referrer)\u003Cbr\u003E\n- to set task limits\u003Cbr\u003E\n- to count the number of bots used for particular task\u003Cbr\u003E\n- to read the answer from a server\u003Cbr\u003E\n- to use async sockets\u003Cbr\u003E\n- to set the number of sockets per timeout\u003Cbr\u003E\n- to set the number of HTTP-requests per socket\u003Cbr\u003E\n- to set custom waiting time\u003Cbr\u003E\n- to set an attack restart periods\u003Cbr\u003E\n- to count the requests per second for particular task\u003C\/p\u003E\n\u003Cp\u003EI removed the feature related to DDoS attacks against TOR sites because of its improper functioning and AV detects.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003ECurrently I am working on .bit domains support.\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EThe price: $400\u003Cbr\u003E\n \u0026nbsp;\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003EFigure 6: Discomrade advertising Coala DDoS malware support for .bit domains\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch5\u003ESample Advertisement #3\u003C\/h5\u003E\n\u003Cp\u003EThe AZORult malware, which was discovered in mid-2016, is offered in underground marketplaces by the actor \u0026quot;CrydBrox.\u0026quot; In early 2017, CrydBrox offered an updated variant of the AZORult malware that included .bit support (Figure 7).\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022575\u0022\u003E\u003Cp\u003E\u003Cb\u003EAdvertisement Translated Text:\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E\u0026nbsp;AZORult V2\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E[+] added .bit domains support\u003Cbr\u003E\n \u003C\/b\u003E[+] added CC stealing feature (for Chrome-based browsers)\u003Cbr\u003E\n[+] added passwords grabbing from FTP-client WinSCP\u003Cbr\u003E\n[+] added passwords grabbing from Outlook (up to the last version)\u003Cbr\u003E\n[+] fixed passwords grabbing from Firefox and Thunderbird\u003Cbr\u003E\n[+] added the feature to examine what privileges were used to run stealer\u003Cbr\u003E\n[+] provided encrypted communication between management panel and the stealer\u003Cbr\u003E\n[+] added AntiVirtualMachine, AntiSandbox, AntiDebug techniques\u003Cbr\u003E\n[+] fixed logs collection feature (excluded info about file operations)\u003Cbr\u003E\n[+] accelerated the work of stealer process\u003Cbr\u003E\n[+] removed .tls section from binary file\u003Cbr\u003E\n[+] added ability to search logs by cookies content (in management panel)\u003Cbr\u003E\n[+] added the view of the numbers of passwords\/CC\/CoinsWallet and files in logs to management panel\u003Cbr\u003E\n[+] added the commenting feature to logs\u003Cbr\u003E\n[+] added viewing of the stats by country, architecture, system version, privileges, collected passwords\u003Cbr\u003E\n[+] added new filters and improved of old filters\u003C\/p\u003E\n\u003Cp\u003EThere are 4 variants of the stealer:\u003Cbr\u003E\nAU2_EXE.exe - run and send the report\u003Cbr\u003E\nAU2_EXEsd.exe - run, send the report and remove itself\u003Cbr\u003E\nAU2_DLL.dll - collect info after the load into the process, send data and return the control to the process\u003Cbr\u003E\nAU2_DLLT.dll - after the loading of the DLL into the process it creates the separate thread for stealer work\u003Cbr\u003E\n*DLL versions successfully work with all popular bots.\u003Cbr\u003E\nThe size – 495 KB, packed with UPX – 220 KB\u003C\/p\u003E\n\u003Cp\u003EThe prices:\u003Cbr\u003E\n1 build - $100\u003Cbr\u003E\nrebuild - $30\u003Cbr\u003E\n\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003EFigure 7: CrydBrox advertising AZORult support for .bit domains\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ENamecoin Usage Analysis\u003C\/h4\u003E\n\u003Cp\u003ECoinciding with malicious actors\u0026#39; increasing interest in using .bit domains is a growing number of malware families that are being configured to use them. Malware families that we have observed using Namecoin domains as part of their C2 infrastructure include:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003ENecurs\u003C\/li\u003E\n\u003Cli\u003EAZORult\u003C\/li\u003E\n\u003Cli\u003ENeutrino (aka Kasidet, MWZLesson)\u003C\/li\u003E\n\u003Cli\u003ECorebot\u003C\/li\u003E\n\u003Cli\u003ESNATCH\u003C\/li\u003E\n\u003Cli\u003ECoala DDoS\u003C\/li\u003E\n\u003Cli\u003ECHESSYLITE\u003C\/li\u003E\n\u003Cli\u003EEmotet\u003C\/li\u003E\n\u003Cli\u003ETerdot\u003C\/li\u003E\n\u003Cli\u003EGandcrab Ransomware\u003C\/li\u003E\n\u003Cli\u003ESmokeLoader (aka Dofoil)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EBased on our analysis of samples configured to used .bit, the following methods are commonly used by malware families to connect to these domains:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EQuery hard-coded OpenNIC IP address(es)\u003C\/li\u003E\n\u003Cli\u003EQuery hard-coded DNS server(s)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EAZORult\u003C\/h4\u003E\n\u003Cp\u003EThe AZORult sample (MD5: 3a3f739fceeedc38544f2c4b699674c5) was configured to support the use of .bit communications, although it did not connect to a Namecoin domain during analysis. The sample first checks if the command and control (C2) domain contains the string \u0026quot;.bit\u0026quot; and, if so, the malware will query the following hard-coded OpenNIC IP addresses to try to resolve the domain (Figure 8 and Figure 9):\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003E89.18.27.34\u003C\/li\u003E\n\u003Cli\u003E87.98.175.85\u003C\/li\u003E\n\u003Cli\u003E185.121.177.53\u003C\/li\u003E\n\u003Cli\u003E193.183.98.154\u003C\/li\u003E\n\u003Cli\u003E185.121.177.177\u003C\/li\u003E\n\u003Cli\u003E5.9.49.12\u003C\/li\u003E\n\u003Cli\u003E62.113.203.99\u003C\/li\u003E\n\u003Cli\u003E130.255.73.90\u003C\/li\u003E\n\u003Cli\u003E5.135.183.146\u003C\/li\u003E\n\u003Cli\u003E188.165.200.156\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig8.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 8: Hard-coded OpenNIC IP addresses - AZORult\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig9.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 9: AZORult code for resolving C\u0026amp;C domains\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ECHESSYLITE\u003C\/h4\u003E\n\u003Cp\u003EThe analyzed CHESSYLITE sample (MD5: ECEA3030CCE05B23301B3F2DE2680ABD) contains the following hard-coded .bit domains:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003ELeomoon[.]bit\u003C\/li\u003E\n\u003Cli\u003Elookstat[.]bit\u003C\/li\u003E\n\u003Cli\u003Esysmonitor[.]bit\u003C\/li\u003E\n\u003Cli\u003Evolstat[.]bit\u003C\/li\u003E\n\u003Cli\u003Exoonday[.]bit\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe malware attempts to resolve those domains by querying the following list of hard-coded OpenNIC IP addresses:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003E69.164.196.21\u003C\/li\u003E\n\u003Cli\u003E107.150.40.234\u003C\/li\u003E\n\u003Cli\u003E89.18.27.34\u003C\/li\u003E\n\u003Cli\u003E193.183.98.154\u003C\/li\u003E\n\u003Cli\u003E185.97.7.7\u003C\/li\u003E\n\u003Cli\u003E162.211.64.20\u003C\/li\u003E\n\u003Cli\u003E217.12.210.54\u003C\/li\u003E\n\u003Cli\u003E51.255.167.0\u003C\/li\u003E\n\u003Cli\u003E91.121.155.13\u003C\/li\u003E\n\u003Cli\u003E87.98.175.85\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EOnce the .bit domain has been resolved, the malware will issue an encoded beacon to the server (Figure 10).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig10.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 10: CHESSYLITE sample connecting to xoonday.bit and issuing beacon\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ENeutrino (aka Kasidet, MWZLesson)\u003C\/h4\u003E\n\u003Cp\u003EThe analyzed Neutrino sample (MD5: C102389F7A4121B09C9ACDB0155B8F70) contains the following hard-coded Namecoin C2 domain:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003Ebrownsloboz[.]bit\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EInstead of using hard-coded OpenNIC IP addresses to resolve its C2 domain, the sample issues \u003Ci\u003EDnsQuery_A\u003C\/i\u003E API calls to the following DNS servers:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003E8.8.8.8\u003C\/li\u003E\n\u003Cli\u003Esourpuss.[]net\u003C\/li\u003E\n\u003Cli\u003Ens1.opennameserver[.]org\u003C\/li\u003E\n\u003Cli\u003Efreya.stelas[.]de\u003C\/li\u003E\n\u003Cli\u003Ens.dotbit[.]me\u003C\/li\u003E\n\u003Cli\u003Ens1.moderntld[.]com\u003C\/li\u003E\n\u003Cli\u003Ens1.rodgerbruce[.]com\u003C\/li\u003E\n\u003Cli\u003Ens14.ns.ph2network[.]org\u003C\/li\u003E\n\u003Cli\u003Enewton.bambusoft[.]mx\u003C\/li\u003E\n\u003Cli\u003Esecondary.server.edv-froehlich[.]de\u003C\/li\u003E\n\u003Cli\u003Ephilipostendorf[.]de\u003C\/li\u003E\n\u003Cli\u003Ea.dnspod[.]com\u003C\/li\u003E\n\u003Cli\u003Eb.dnspod[.]com\u003C\/li\u003E\n\u003Cli\u003Ec.dnspod[.]com\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe malware is configured to run through the list in the aforementioned order. Hence, if a \u003Ci\u003EDnsQuery_A\u003C\/i\u003E call to 8.8.8.8 fails, the malware will try sourpuss[.]net, and so on (Figure 11). Through network emulation techniques, we simulated a resolved connection in order to observe the sample\u0026#39;s behavior with the .bit domain.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig11.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 11: Modified 8.8.8.8 to 8.8.8.5 to force query failure\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EMonero Miner\u003C\/h4\u003E\n\u003Cp\u003EThe analyzed Monero cryptocurrency miner (MD5: FA1937B188CBB7fD371984010564DB6E) revealed the use of .bit for initial beacon communications. This miner uses the \u003Ci\u003EDnsQuery_A\u003C\/i\u003E API call and connects to the OpenNIC IP address 185.121.177.177 to resolve the domain flashupd[.]bit (Figure 12 and Figure 13).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig12.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 12: Code snippet for resolving the .bit domain\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig13.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 13: DNS request to OpenNIC IP 185.121.177.177\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ETerdot (aka ZLoader, DELoader)\u003C\/h4\u003E\n\u003Cp\u003EThe analyzed Terdot sample (MD5: 347c574f7d07998e321f3d35a533bd99) includes the ability to communicate with .bit domains, seemingly to download additional payloads. It attempts resolution by querying the following list of OpenNIC and public DNS IP addresses:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003E185.121.177.53\u003C\/li\u003E\n\u003Cli\u003E185.121.177.177\u003C\/li\u003E\n\u003Cli\u003E45.63.25.55\u003C\/li\u003E\n\u003Cli\u003E111.67.16.202\u003C\/li\u003E\n\u003Cli\u003E142.4.204.111\u003C\/li\u003E\n\u003Cli\u003E142.4.205.47\u003C\/li\u003E\n\u003Cli\u003E31.3.135.232\u003C\/li\u003E\n\u003Cli\u003E62.113.203.55\u003C\/li\u003E\n\u003Cli\u003E37.228.151.133\u003C\/li\u003E\n\u003Cli\u003E144.76.133.38\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThis sample iterates through the hard-coded IPs in attempts to access the domain cyber7[.]bit (Figure 14). If the domain resolves, it will connect to https:\/\/cyber7[.]bit\/blog\/ajax.php to download data that is RC4 encrypted and expected to contain a PE file.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig14.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 14: DNS requests for cyber7.bit domain\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EGandcrab Ransomware\u003C\/h4\u003E\n\u003Cp\u003EThe analyzed Gandcrab ransomware sample (MD5: 9abe40bc867d1094c7c0551ab0a28210) also revealed the use of .bit domains. Unlike previously mentioned families, it spawns a new \u003Ci\u003Enslookup\u003C\/i\u003E process via an anonymous pipe to resolve the following blockchain domains:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EBleepingcomputer[.]bit\u003C\/li\u003E\n\u003Cli\u003ENomoreransom[.]bit\u003C\/li\u003E\n\u003Cli\u003Eesetnod32[.]bit\u003C\/li\u003E\n\u003Cli\u003Eemsisoft[.]bit\u003C\/li\u003E\n\u003Cli\u003Egandcrab[.]bit\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe spawned \u003Ci\u003Enslookup\u003C\/i\u003E process contains the following command (as seen in Figure 15):\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003Enslookup \u0026lt;\u003Ci\u003Edomain\u003C\/i\u003E\u0026gt;\u0026nbsp; a.dnspod.com\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig15.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 15: GandCrab nslookup process creation and command\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EEmercoin Domains\u003C\/h4\u003E\n\u003Cp\u003EFireEye iSIGHT Intelligence researchers have identified other blockchain domains being used by cyber criminals, including Emercoin domains .bazar and .coin. Similar to the Namecoin TLD, all records are completely decentralized, un-censorable, and cannot be altered, revoked, or suspended.\u003C\/p\u003E\n\u003Ch4\u003ENavigating to Emercoin Domains\u003C\/h4\u003E\n\u003Cp\u003EEmercoin also maintains a peering agreement with OpenNIC, meaning domains registered with the Emercoin\u0026#39;s EMCDNS service are accessible to all users of OpenNIC DNS servers. Current root zones supported by EMCDNS are shown in Table 3.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u002265\u0022\u003E\u003Cp\u003E\u003Cb\u003EZone\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022426\u0022\u003E\u003Cp\u003E\u003Cb\u003EIntended Purpose\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002265\u0022\u003E\u003Cp\u003E.coin\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022426\u0022\u003E\u003Cp\u003Edigital currency and commerce websites\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002265\u0022\u003E\u003Cp\u003E.emc\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022426\u0022\u003E\u003Cp\u003Ewebsites associated with the Emercoin project\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002265\u0022\u003E\u003Cp\u003E.lib\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022426\u0022\u003E\u003Cp\u003Efrom the words Library and Liberty - that is, knowledge and freedom\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002265\u0022\u003E\u003Cp\u003E.bazar\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022426\u0022\u003E\u003Cp\u003Emarketplace\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 3: Emercoin-supported DNS zones (Emercoin Wiki)\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EUsers also have the option of installing compatible browser plugins that will navigate to Emercoin domains, or routing their traffic through emergate[.]net, which is a gateway maintained by the Emercoin developers.\u003C\/p\u003E\n\u003Ch4\u003EEmercoin Domain Usage\u003C\/h4\u003E\n\u003Cp\u003EFireEye iSIGHT Intelligence has observed eCrime actors using Emercoin domains for malicious infrastructure, albeit to a lesser extent. Examples of these operations include:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EOperators of Joker\u0026#39;s Stash, a prolific and well-known card data shop, frequently change the site\u0026#39;s URL. Recently, they opted for using a blockchain domain (jstash[.]bazar) instead of Tor, ostensibly for greater operational security.\u003C\/li\u003E\n\u003Cli\u003ESimilarly, the following card shops have also moved to .bazar domains:\u003Cul\u003E\n\u003Cli\u003Ebuybest[.]bazar\u003C\/li\u003E\n\u003Cli\u003EFRESHSTUFF[.]bazar\u003C\/li\u003E\n\u003Cli\u003Eswipe[.]bazar\u003C\/li\u003E\n\u003Cli\u003Egoodshop[.]bazar\u003C\/li\u003E\n\u003Cli\u003Eeasydeals[.]bazar\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EIn addition to the hard-coded Namecoin domain, the aforementioned Neutrino sample also contained several hard-coded Emercoin domains:\u003Cul\u003E\n\u003Cli\u003Ehttp:\/\/brownsloboz[.]bazar\u003C\/li\u003E\n\u003Cli\u003Ehttp:\/\/brownsloboz[.]lib\u003C\/li\u003E\n\u003Cli\u003Ehttp:\/\/brownsloboz[.]emc\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EFireEye iSIGHT Intelligence identified a Gandcrab ransomware sample (MD5: a0259e95e9b3fd7f787134ab2f31ad3c) that leveraged the Emercoin TLD .coin for its C2 communications (Figure 16 and Figure 17).\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig17.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 16: DNS query for nomoreransom[.]coin\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/Blockchain\/Fig18.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 17: Gandcrab POST request to nomoreransom[.]coin\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EOutlook\u003C\/h4\u003E\n\u003Cp\u003EWhile traditional methods of infrastructure obfuscation such as Tor, bulletproof, and fast-flux hosting will most likely continue for the foreseeable future, we assess that the usage of blockchain domains for malicious infrastructure will continue to gain popularity and usage among cyber criminals worldwide. Coinciding with the expected increase in demand, there will likely be an increasing number of malicious infrastructure offerings within the underground communities that support blockchain domains.\u003C\/p\u003E\n\u003Cp\u003EDue to the decentralized and replicated nature of a blockchain, law enforcement takedowns of a malicious domain would likely require that the entire blockchain be shut down – something that is unfeasible to do as many legitimate services run on these blockchains. If law enforcement agencies can identify the individual(s) managing specific malicious blockchain domains, the potential for these takedowns could occur; however, the likelihood for this to happen is heavily reliant on the operational security level maintained by the eCrime actors. Further, as cyber criminals continue to develop methods of infrastructure obfuscation and protection, blockchain domain takedowns will continue to prove difficult.\u003C\/p\u003E\n",
        "jcr:lastModified": "Thu May 31 2018 13:19:07 GMT-0400",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EThis blog covers the growing trend of cyber criminals using blockchain domains for malicious infrastructure.\u003C\/p\u003E\n",
      "jcr:lastModified": "Mon Apr 09 2018 18:39:21 GMT-0400",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Wed Apr 18 2018 00:31:31 GMT-0400",
      "imageRotate": "0"
    }
  }
}
