{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Mon Mar 16 2020 15:24:02 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "They Come in the Night: Ransomware Deployment Trends",
    "jcr:versionHistory": "12a1c235-5eb5-4592-abf2-af7d1c561b00",
    "author": "Kelli Vanderlee",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "a8ef1f46-db3d-4f67-992e-752a4fd08966"
    ],
    "jcr:created": "Mon Mar 16 2020 15:24:02 GMT+0000",
    "cq:lastModified": "Mon Mar 16 2020 15:23:54 GMT+0000",
    "jcr:baseVersion": "a8ef1f46-db3d-4f67-992e-752a4fd08966",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:kelli-vanderlee",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:ransomware",
      "fireeye-blog-tags:intelligence",
      "fireeye-blog-tags:trends"
    ],
    "jcr:uuid": "f2c42e96-59a9-487f-b89c-3ecd8a0f934e",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Mar 16 2020 11:30:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003ERansomware is a remote, digital shakedown. It is disruptive and expensive, and it affects all kinds of organizations, from cutting edge \u003Ca href=\u0022https:\/\/news.sky.com\/story\/spacex-and-tesla-documents-leaked-online-by-hackers-11947792\u0022\u003Espace technology\u003C\/a\u003E firms, to the \u003Ca href=\u0022https:\/\/www.itnews.com.au\/news\/australian-wool-sales-stopped-by-ransomware-attack-538657\u0022\u003Ewool industry\u003C\/a\u003E, to \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/02\/ransomware-against-machine-learning-to-disrupt-industrial-production.html\u0022 adhocenable=\u0022false\u0022\u003Eindustrial environments\u003C\/a\u003E. Infections have forced hospitals to \u003Ca href=\u0022https:\/\/arstechnica.com\/information-technology\/2019\/10\/hamstrung-by-ransomware-10-hospitals-are-turning-away-some-patients\/\u0022\u003Eturn away patients\u003C\/a\u003E and law enforcement to \u003Ca href=\u0022https:\/\/www.zdnet.com\/article\/six-suspected-drug-dealers-went-free-after-police-lost-evidence-in-ransomware-attack\/\u0022\u003Edrop cases\u003C\/a\u003E against drug dealers. Ransomware operators have recently begun combining encryption with the threat of \u003Ca href=\u0022https:\/\/www.bleepingcomputer.com\/news\/security\/doppelpaymer-ransomware-launches-site-to-post-victims-data\/\u0022\u003Edata leak and exposure\u003C\/a\u003E in order to increase leverage against victims. There may be a silver lining, however; Mandiant Intelligence research suggests that focusing defensive efforts in key areas and acting quickly may allow organizations to stop ransomware before it is deployed.\u003C\/p\u003E\n\u003Cp\u003EMandiant Intelligence examined dozens of ransomware incident response investigations from 2017 to 2019. Through this research, we identified a number of common characteristics in initial intrusion vectors, dwell time, and time of day of ransomware deployment. We also noted threat actor innovations in tactics to maximize profits (Figure 1). Incidents affected organizations across North America, Europe, Asia Pacific, and the Middle East in nearly every sector category, including financial services, chemicals and materials, legal and professional services, local government, and healthcare. We observed intrusions attributed to financially motivated groups such as \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/04\/pick-six-intercepting-a-fin6-intrusion.html\u0022\u003EFIN6\u003C\/a\u003E, TEMP.MixMaster, and dozens of additional activity sets.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/ransomwaretrends\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Themes Observed in Ransomware Incidents\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThese incidents provide us with enhanced insight into ransomware trends that can be useful for network defenders, but it is worth bearing in mind that this data represents only a sample of all activity. For example, Mandiant ransomware investigations increased 860% from 2017 to 2019. The majority of these incidents appeared to be post-compromise infections, and we believe that threat actors are accelerating use of tactics including post compromise deployment to increase the likelihood of ransom payment. We also observed incidents in which ransomware was executed immediately, for example GANDCRAB and GLOBEIMPOSTER incidents, but most of the intrusions examined were longer duration and more complex post-compromise deployments.\u003C\/p\u003E\n\u003Ch4\u003ECommon Initial Infection Vectors\u003C\/h4\u003E\n\u003Cp\u003EWe noted several initial infection vectors across multiple ransomware incidents, including RDP, phishing with a malicious link or attachment, and drive by download of malware facilitating follow-on activity. RDP was more frequently observed in 2017 and declined in 2018 and 2019. These vectors demonstrate that ransomware can enter victim environments by a variety of means, not all of which require user interaction.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u002296\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003ERDP or other remote access\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022528\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EOne of the most frequently observed vectors was an attacker logging on to a system in a victim environment via Remote Desktop Protocol (RDP). In some cases, the attacker brute forced the credentials (many failed authentication attempts followed by a successful one). In other cases, a successful RDP log on was the first evidence of malicious activity prior to a ransomware infection. It is possible that the targeted system used default or weak credentials, the attackers acquired valid credentials via other unobserved malicious activity, or the attackers purchased RDP access established by another threat actor. In \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2019\/04\/pick-six-intercepting-a-fin6-intrusion.html\u0022\u003EApril 2019\u003C\/a\u003E, we noted that FIN6 used stolen credentials and RDP to move laterally in cases resulting in ransomware deployment.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002296\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EPhishing with link or attachment\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022528\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EA significant number of ransomware cases were linked to phishing campaigns delivering some of the most prolific malware families in financially motivated operations: TRICKBOT, EMOTET, and FLAWEDAMMYY. In \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2019\/01\/a-nasty-trick-from-credential-theft-malware-to-business-disruption.html\u0022\u003EJanuary 2019\u003C\/a\u003E, we described TEMP.MixMaster TrickBot infections that resulted in interactive deployment of Ryuk.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002296\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EDrive-by-download\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022528\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003ESeveral ransomware infections were traced back to a user in the victim environment navigating to a compromised website that resulted in a DRIDEX infection. In \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2019\/10\/head-fake-tackling-disruptive-ransomware-attacks.html\u0022\u003EOctober 2019\u003C\/a\u003E, we documented compromised web infrastructure delivering FAKEUPDATES, then DRIDEX, and ultimately BITPAYMER or DOPPELPAYMER infections.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EMost Ransomware Deployments Take Place Three or More Days After Initial Infection\u003C\/h4\u003E\n\u003Cp\u003EThe number of days elapsed between the first evidence of malicious activity and the deployment of ransomware ranged from zero to 299 days (Figure 2). That is, dwell times range quite widely, and in most cases, there was a time gap between first access and ransomware deployment. For 75 percent of incidents, at least three days passed between the first evidence of malicious activity and ransomware deployment.\u003C\/p\u003E\n\u003Cp\u003EThis pattern suggests that for many organizations, \u003Cb\u003Eif initial infections are detected, contained, and remediated quickly, the significant damage and cost associated with a ransomware infection could be avoided. \u003C\/b\u003EIn fact, in a handful of cases, Mandiant incident responders and FireEye Managed Defense contained and remediated malicious activity, likely preventing ransomware deployment. Several investigations discovered evidence of ransomware installed into victim environments but not yet successfully executed.\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/ransomwaretrends\/Picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Days elapsed between initial access and ransomware deployment\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ERansomware Deployed Most Often After Hours\u003C\/h4\u003E\n\u003Cp\u003EIn 76% of incidents we reviewed, ransomware was executed in victim environments after hours, that is, on a weekend or before 8:00 a.m. or after 6:00 p.m. on a weekday, using the time zone and customary work week of the victim organization (Figure 3 and Figure 4). This observation underscores that threat actors continue working even when most employees may not be.\u003C\/p\u003E\n\u003Cp\u003ESome attackers possibly intentionally deploy ransomware after hours, on weekends, or during holidays, to maximize the potential effectiveness of the operation on the assumption that any remediation efforts will be implemented more slowly than they would be during normal work hours. In other cases, attackers linked ransomware deployment to user actions. For example, in 2019 incidents at retail and professional services firms, attackers created an Active Directory Group Policy Object to trigger ransomware execution based on user log on and log off.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/ransomwaretrends\/Picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Ransomware execution frequently takes place after hours\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/ransomwaretrends\/Picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: Ransomware execution by hour of the day\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EMitigation Recommendations\u003C\/h4\u003E\n\u003Cp\u003EOrganizations seeking to prevent or mitigate the effects of ransomware infections could consider the following steps. For more comprehensive recommendations for addressing ransomware, please refer to our blog post: \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/09\/ransomware-protection-and-containment-strategies.html\u0022 adhocenable=\u0022false\u0022\u003E\u003Ci\u003ERansomware Protection and Containment Strategies: Practical Guidance for Endpoint Protection, Hardening, and Containment\u003C\/i\u003E\u003C\/a\u003E and the linked \u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/current-threats\/pdfs\/wp-ransomware-protection-and-containment-strategies.pdf\u0022\u003Ewhite paper\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u002296\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EAddress Infection Vectors\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022528\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EUse enterprise network, email, and host-based security products with up-to-date detections to prevent and detect many common malware strains such as TRICKBOT, DRIDEX, and EMOTET.\u003C\/li\u003E\n\u003Cli\u003EContain and remediate infections quickly to prevent attackers from conducting follow-on activity or selling access to other threat actors for further exploitation.\u003C\/li\u003E\n\u003Cli\u003EPerform regular network perimeter and firewall rule audits to identify any systems that have inadvertently been left accessible to the internet. Disable RDP and other protocols to systems where this access is not expressly required. Enable multi-factor authentication where possible, particularly to internet-accessible connections, see pages 4-15 of the white paper for more details.\u003C\/li\u003E\n\u003Cli\u003EEnforce multi-factor authentication, that is, where enabled, do not allow single factor authentication for users who have not set up the multi-factor mechanism.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002296\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EImplement Best Practices\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022528\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EFor example, carry out regular anti-phishing training for all employees that operate a device on the company network. Ensure employees are aware of threat, their role in preventing it, and the potential cost of a successful infection.\u003C\/li\u003E\n\u003Cli\u003EImplement network segmentation when possible to prevent a potential infection from spreading.\u003C\/li\u003E\n\u003Cli\u003ECreate regular backups of critical data necessary to ensure business continuity and, if possible, store them offsite, as attackers often target backups.\u003C\/li\u003E\n\u003Cli\u003ERestrict Local Administrator accounts from specific log on types, see page 18 of the white paper for more details.\u003C\/li\u003E\n\u003Cli\u003EUse a solution such as LAPS to generate a unique Local Administrator password for each system.\u003C\/li\u003E\n\u003Cli\u003EDisallow cleartext passwords to be stored in memory in order to prevent Mimikatz credential harvesting, see p. 20 of the white paper for more details.\u003C\/li\u003E\n\u003Cli\u003EConsider cyber insurance that covers ransomware infection.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002296\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Cb\u003EEstablish Emergency Plans\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022528\u0022 valign=\u0022top\u0022\u003E\u003Cul\u003E\n\u003Cli\u003EEnsure that after-hours coverage is available to respond within a set time period in the case of an emergency.\u003C\/li\u003E\n\u003Cli\u003EInstitute after-hours emergency escalation plans that include redundant means to contact multiple stakeholders within the organization and 24-hour emergency contact information for any relevant third-party vendors.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EOutlook\u003C\/h4\u003E\n\u003Cp\u003ERansomware is disruptive and costly. Threat actor innovations have only increased the potential damage of ransomware infections in recent years, and this trend shows no sign of slowing down. We expect that financially motivated actors will continue to evolve their tactics to maximize profit generated from ransomware infections. We anticipate that post-compromise ransomware infections will continue to rise and that attackers will increasingly couple ransomware deployment with other tactics, such as data theft and extortion, increasing ransom demands, and targeting critical systems.\u003C\/p\u003E\n\u003Cp\u003EThe good news is that particularly with post-compromise infections, there is often a window of time between the first malicious action and ransomware deployment. If network defenders can detect and remediate the initial compromise quickly, it is possible to avoid the significant damage and cost of a ransomware infection.\u003C\/p\u003E\n\u003Cp\u003ERegister for our upcoming \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/389929\u0022\u003Eransomware webinar\u003C\/a\u003E to learn more.\u003C\/p\u003E\n",
        "jcr:lastModified": "Mon Mar 16 2020 15:18:33 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe expect financially motivated actors will continue to change their tactics to maximize profit generated from ransomware infections.\u003C\/p\u003E\n",
      "jcr:lastModified": "Mon Mar 16 2020 10:11:44 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon Mar 16 2020 15:23:54 GMT+0000",
      "imageRotate": "0"
    }
  }
}
