{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed Jan 23 2019 08:58:20 GMT-0500",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Cryptocurrency and Blockchain Networks: Facing New Security Paradigms",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "1aa26b52-eef7-4386-841b-bb2eea0be478",
    "author": "Randi Eitzman",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "adam.greenberg@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "8619ec52-5742-4950-b82a-64999ca2b910"
    ],
    "jcr:created": "Wed Jan 23 2019 10:48:42 GMT-0500",
    "cq:lastReplicated": "Wed Jan 23 2019 10:48:41 GMT-0500",
    "cq:lastModified": "Wed Jan 23 2019 10:48:00 GMT-0500",
    "jcr:baseVersion": "8619ec52-5742-4950-b82a-64999ca2b910",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:randi-eitzman",
      "fireeye-blog-authors:anna-dunin-underwood",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:blockchain",
      "fireeye-blog-tags:crypto",
      "fireeye-blog-tags:cryptocurrency",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest"
    ],
    "jcr:uuid": "e27721e2-801a-4096-9a1e-136b1a369c70",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Wed Jan 23 2019 09:00:00 GMT-0500",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EOn Jan. 22, FireEye participated in a panel focused on cryptocurrencies and blockchain technology during the World Economic Forum. The panel addressed issues raised in a \u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/partners\/pdfs\/rpt-marsh-fireeye-crypto-paper.pdf\u0022\u003Ereport\u003C\/a\u003E developed by FireEye, together with our partner Marsh \u0026amp; McLennan (a global professional services firm) and Circle (a global crypto finance company). The report touched on some of the security considerations around crypto-assets – today and in the future, and in this blog post, we delve deeper into the security paradigms surrounding cryptocurrencies and blockchain networks.\u003C\/p\u003E\n\u003Cp\u003EFirst, some background that will provide context for this discussion.\u003C\/p\u003E\n\u003Ch5\u003ECryptocurrencies – A Primer\u003C\/h5\u003E\n\u003Cp\u003EBy its simplest definition, cryptocurrency is digital money that operates on its own decentralized transaction network. When defined holistically, many argue that cryptocurrencies and their distributed ledger (blockchain) technology is powerful enough to radically change the basic economic pillars of society and fundamentally alter the way our systems of trust, governance, trade, ownership, and business function. However, the technology is new, subject to change, and certain headwinds related to scalability and security still need to be navigated. It is safe to assume that the ecosystem we have today will evolve. Since the final ecosystem is yet to be determined, as new technology develops and grows in user adoption, the associated risk areas will continually shift – creating new cyber security paradigms for all network users to consider, whether you are an individual user of cryptocurrency, a miner, a service-provider (e.g., exchange, trading platform, or key custodian), a regulator, or a nation-state with vested political interest.\u003C\/p\u003E\n\u003Cp\u003EMalicious actors employ a wide variety of tactics to steal cryptocurrencies. These efforts can target users and their wallets, exchanges and\/or key custodial services, and underlying networks or protocols supporting cryptocurrencies. FireEye has observed successful attacks that steal from users and cryptocurrency exchanges over the past several years. And while less frequent, attacks targeting cryptocurrency networks and protocols have also been observed. We believe cryptocurrency exchanges and\/or key custodial services are, and will continue to be, attractive targets for malicious operations due to the potentially large profits, their often-lax physical and network security, and the lack of regulation and oversight.\u003C\/p\u003E\n\u003Cp\u003EThis blog post will highlight some of the various risk areas to consider when developing and adopting cryptocurrency and blockchain technology.\u003C\/p\u003E\n\u003Ch3\u003EWallet \u0026amp; Key Management\u003C\/h3\u003E\n\u003Ch4\u003EPublic and Private Keys\u003C\/h4\u003E\n\u003Cp\u003EThere are two types of keys associated with each wallet: a public key and a private key. Each of these keys provides a different function, and it is the security of the private key that is paramount to securing cryptocurrency funds.\u003C\/p\u003E\n\u003Cp\u003EThe private key is a randomly generated number used to \u003Ci\u003Esign transactions\u003C\/i\u003E and \u003Ci\u003Espend\u003C\/i\u003E funds within a specific wallet, and the public key (which is derived from the private key) is used to generate a wallet address to which they can \u003Ci\u003Ereceive\u003C\/i\u003E funds.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/CryptoBlockchain\/Crypto%20Figure1.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Private key, public key, and address generation flow\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe private key must be kept secret at all times and, unfortunately, revealing it to third-parties (or allowing third-parties to manage and store private keys) increases convenience at the expense of security. In fact, some of the most high-profile exchange breaches have occurred in large part due to a lack of operational controls relating to the storage of private keys. Maintaining the confidentiality, integrity, and availability of private keys requires fairly robust controls.\u003C\/p\u003E\n\u003Cp\u003EHowever, from an individual user perspective, a large number of user-controlled software wallet solutions store the private and public keys in a wallet file on the user’s hard drive that is located in a well-known directory, making it an ideal target for actors that aim to steal private keys. Easily available tools such as commercial keyloggers and remote access tools (RATs) can be used to steal funds by stealing (or making copies of) a user’s wallet file. FireEye has observed myriad malware families, traditionally aimed at stealing banking credentials, incorporate the ability to target cryptocurrency wallets and online services. FireEye Intelligence subscribers may be familiar with this already, as we’ve published about these malware families use in targeting cryptocurrency assets on our FireEye Intelligence Portal. The following are some of the more prominent crimeware families we have observed include such functionality:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EAtmos\u003C\/li\u003E\n\u003Cli\u003EDridex\u003C\/li\u003E\n\u003Cli\u003EGozi\/Ursnif\u003C\/li\u003E\n\u003Cli\u003ERamnit\u003C\/li\u003E\n\u003Cli\u003ETerdot\u003C\/li\u003E\n\u003Cli\u003ETrickbot\u003C\/li\u003E\n\u003Cli\u003EZeusPanda\/PandaBot\u003C\/li\u003E\n\u003Cli\u003EIcedID\u003C\/li\u003E\n\u003Cli\u003ESmokeLoader\u003C\/li\u003E\n\u003Cli\u003ENeptune EK\u003C\/li\u003E\n\u003Cli\u003EBlackRuby Ransomware\u003C\/li\u003E\n\u003Cli\u003EAndromeda\/Gamarue\u003C\/li\u003E\n\u003Cli\u003EImminentMonitor RAT\u003C\/li\u003E\n\u003Cli\u003EjRAT\u003C\/li\u003E\n\u003Cli\u003ENeutrino\u003C\/li\u003E\n\u003Cli\u003ECorebot\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EWallet Solutions\u003C\/h4\u003E\n\u003Cp\u003EBy definition, cryptocurrency wallets are used to store a user’s keys, which can be used to unlock access to the funds residing in the associated blockchain entry (address). Several types of wallets exist, each with their own level of security (pros) and associated risks (cons). Generally, wallets fall into two categories: hot (online) and cold (offline).\u003C\/p\u003E\n\u003Ch5\u003EHot Wallets\u003C\/h5\u003E\n\u003Cp\u003EA wallet stored on a general computing device connected to the internet is often referred to as a “hot” wallet. This type of storage presents the largest attack surface and is, consequently, the riskiest way to store private keys. Types of hot wallets typically include user-controlled and locally stored wallets (also referred to as desktop wallets), mobile wallets, and web wallets. If remote access on any hot wallet device occurs, the risk of theft greatly increases. As stated, many of these solutions store private keys in a well-known and\/or unencrypted location, which can make for an attractive target for bad actors. While many of these wallet types offer the user high levels of convenience, security is often the trade-off.\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022\u003E\u003Cp\u003E\u003Cb\u003EWallet Type\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cp\u003E\u003Cb\u003EExamples\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022\u003E\u003Cp\u003EDesktop\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EBitcoin Core\u003C\/li\u003E\n\u003Cli\u003EAtomic\u003C\/li\u003E\n\u003Cli\u003EExodus\u003C\/li\u003E\n\u003Cli\u003EElectrum\u003C\/li\u003E\n\u003Cli\u003EJaxx\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022\u003E\u003Cp\u003EMobile\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EBRD\u003C\/li\u003E\n\u003Cli\u003EInfinito\u003C\/li\u003E\n\u003Cli\u003EJaxx\u003C\/li\u003E\n\u003Cli\u003EAirbitz\u003C\/li\u003E\n\u003Cli\u003ECopay\u003C\/li\u003E\n\u003Cli\u003EFreewallet\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022138\u0022\u003E\u003Cp\u003EWeb\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022156\u0022\u003E\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EMyEtherWallet\u003C\/li\u003E\n\u003Cli\u003EMetaMask\u003C\/li\u003E\n\u003Cli\u003ECoinbase\u003C\/li\u003E\n\u003Cli\u003EBTC Wallet\u003C\/li\u003E\n\u003Cli\u003EBlockchain.info\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 1: Types of hot wallets\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EIf considering the use of hot wallet solutions, FireEye recommends some of the following ways to help mitigate risk:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EUse two-factor authentication when available (as well as fingerprint authentication where applicable).\u003C\/li\u003E\n\u003Cli\u003EUse strong passwords.\u003C\/li\u003E\n\u003Cli\u003EEnsure that your private keys are stored encrypted (if possible).\u003C\/li\u003E\n\u003Cli\u003EConsider using an alternative or secondary device to access funds (like a secondary mobile device or computer not generally used every day) and kept offline when not in use.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ECold Wallets\u003C\/h5\u003E\n\u003Cp\u003EOffline, also called cold wallets, are those that generate and store private keys offline on an air-gapped computer without network interfaces or connections to the outside internet. Cold wallets work by taking the unsigned transactions that occur online, transferring those transactions offline to be verified and signed, and then pushing the transactions back online to be broadcasted onto the Bitcoin network. Managing private keys in this way is considered to be more secure against threats such as hackers and malware. These types of offline vaults used for storing private keys is becoming the industry security standard for key custodians such as Coinbase, Bittrex, and other centralized cryptocurrency companies. Even recently, Fidelity Investments \u003Ca href=\u0022https:\/\/institutional.fidelity.com\/app\/literature\/press-release\/9883768\/fidelity-launches-new-company-fidelity-digital-assets.html\u0022\u003Ereleased a statement\u003C\/a\u003E regarding their intentions to play an integral part of the Bitcoin’s custodial infrastructure landscape.\u003C\/p\u003E\n\u003Cp style=\u0022text-align: center;\u0022\u003E\u003Ci\u003E\u0026quot;Fidelity Digital Assets will provide a secure, compliant, and institutional-grade omnibus storage solution for bitcoin, ether and other digital assets. This consists of vaulted cold storage, multi-level physical and cyber controls – security protocols that have been created leveraging Fidelity’s time-tested security principles and best practices combined with internal and external digital asset experts.\u0026quot;\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp style=\u0022text-align: right;\u0022\u003E\u003Ci\u003E-Fidelity Investments\u003C\/i\u003E\u0026nbsp; \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003EWhile more security-conscious exchanges employ this type of key storage for their users, cold wallets are still susceptible to exploitation:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EIn November 2017, \u003Ca href=\u0022https:\/\/www.zdnet.com\/article\/stealing-data-from-air-gapped-computers\/\u0022\u003EZDnet published an article\u003C\/a\u003E describing four methods hackers use to steal data from air-gapped computers through what they call “covert channels.” These channels can be broken down into four groups:\u003Cul\u003E\n\u003Cli\u003EElectromagnetic\u003C\/li\u003E\n\u003Cli\u003EAcoustic\u003C\/li\u003E\n\u003Cli\u003EThermal\u003C\/li\u003E\n\u003Cli\u003EOptical\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EIn addition to those four types of attacks, WikiLeaks revealed, as part of its ongoing Vault 7 leak, a tool suite (dubbed Brutal Kangaroo, formerly EZCheese) allegedly \u003Ca href=\u0022https:\/\/thehackernews.com\/2017\/06\/wikileaks-Brutal-Kangaroo-airgap-malware.html\u0022\u003Eused by the CIA\u003C\/a\u003E for targeting air-gapped networks.\u003C\/li\u003E\n\u003Cli\u003EIn February 2018, security researchers with the Cybersecurity Research Center at Israel\u0027s Ben-Gurion University made use of a \u003Ca href=\u0022https:\/\/thehackernews.com\/2018\/02\/airgap-computer-hacking.html\u0022\u003Eproof-of-concept (PoC) malware\u003C\/a\u003E that allowed for the exfiltration of data from computers placed inside a Faraday cage (an enclosure used to block electromagnetic fields). According to their research, attackers can exfiltrate data from any infected computer, regardless if air-gapped or inside a Faraday cage. The same group of researchers also revealed additional ways to exploit air-gapped computers:\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/thehackernews.com\/2017\/09\/airgap-network-malware-hacking.html\u0022\u003EaIR-Jumper attack\u003C\/a\u003E that steals sensitive information from air-gapped computers with the help of infrared-equipped CCTV cameras that are used for night vision\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/thehackernews.com\/2016\/09\/usbee-airgap-computer.html\u0022\u003EUSBee attack\u003C\/a\u003E that can be used steal data from air-gapped computers using radio frequency transmissions from USB connectors\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/thehackernews.com\/2016\/08\/air-gapped-computer-hacking.html\u0022\u003EDiskFiltration attack\u003C\/a\u003E that can steal data using sound signals emitted from the hard disk drive (HDD) of the targeted air-gapped computer\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/thehackernews.com\/2015\/03\/hacking-air-gapped-computer.html\u0022\u003EBitWhisper\u003C\/a\u003E that relies on heat exchange between two computer systems to stealthily siphon passwords or security keys\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/thehackernews.com\/2014\/10\/airhopper-hacking-into-isolated.html\u0022\u003EAirHopper\u003C\/a\u003E that turns a computer\u0027s video card into an FM transmitter to capture keystrokes\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/arxiv.org\/ftp\/arxiv\/papers\/1606\/1606.05915.pdf\u0022\u003EFansmitter\u003C\/a\u003E technique that uses noise emitted by a computer fan to transmit data\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.usenix.org\/system\/files\/conference\/usenixsecurity15\/sec15-paper-guri-update.pdf\u0022\u003EGSMem attack\u003C\/a\u003E that relies on cellular frequencies\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/arxiv.org\/abs\/1804.04014\u0022\u003EPowerHammer\u003C\/a\u003E, a malware that leverages power lines to exfiltrate data from air-gapped computers.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EHardware Wallets\u003C\/h5\u003E\n\u003Cp\u003EHardware wallets are typically a small peripheral device (such as USB drives) used to generate and store keys, as well as verify and sign transactions. The device signs the transactions internally and only transmits the signed transactions to the network when connected to a networked computer. It is this separation of the private keys from the vulnerable online environment that allows a user to transact on the blockchain with reduced risk.\u003C\/p\u003E\n\u003Cp\u003EHowever, hardware wallets are susceptible to exploitation as well, such as man-in-the-middle (MitM) supply chain attacks, wherein a compromised device is purchased. Such an event obstenibly \u003Ca href=\u0022https:\/\/news.bitcoin.com\/mans-life-savings-stolen-from-hardware-wallet-supplied-by-a-reseller\/\u0022\u003Eoccurred in early 2018\u003C\/a\u003E, when an individual purchased a compromised Nano Ledger off of eBay, and consequently lost $34,000 USD worth of cryptocurrency stored on the device as the attacker created their own recovery seed to later retrieve the funds stored on the device. In order to trick the victim, the attacker included a fake recovery seed form inside the compromised device packaging (as seen in Figure 2).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/CryptoBlockchain\/Crypto%20Figure2.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Fraudulent recovery seed document for Ledger Nano\u0026nbsp;(image source: Reddit)\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ETo help mitigate the risk of such an attack, FireEye recommends only purchasing a hardware wallet from the manufacturer directly or through authorized resellers.\u003C\/p\u003E\n\u003Cp\u003EIn addition to supply-chain attacks, security researchers with Wallet.fail have \u003Ca href=\u0022https:\/\/wallet.fail\/wallets\/nanos\/\u0022\u003Erecently disclosed\u003C\/a\u003E two vulnerabilities in the Ledger Nano S device. One of these vulnerabilities allows an attacker to execute arbitrary code from the boot menu, and the other allows physical manipulation without the user knowing due to a lack of tamper evidence. In both cases, physical access to the device is required, and thus deemed less likely to occur if proper physical security of the device is maintained and unauthorized third-party purchasing is avoided.\u003C\/p\u003E\n\u003Ch5\u003EPaper Wallets\u003C\/h5\u003E\n\u003Cp\u003ETypically, wallet software solutions hide the process of generating, using, and storing private keys from the user. However, a paper wallet involves using an open-source wallet generator like BitAddress[.]org and WalletGenerator[.]net to generate the user’s public and private keys. Those keys are then printed to a piece of paper. While many view this form of key management as more secure because the keys do not reside on a digital device, there are still risks.\u003C\/p\u003E\n\u003Cp\u003EBecause the private key is printed on paper, theft, loss, and physical damage present the highest risk to the user. Paper wallets are one of the only forms of key management that outwardly display the private key in such a way and should be used with extreme caution. It is also known that many printers keep a cache of printed content, so the possibility of extracting printed keys from exploited printers should also be considered.\u003C\/p\u003E\n\u003Ch3\u003EExchanges \u0026amp; Key Custodians\u003C\/h3\u003E\n\u003Cp\u003EAccording to recent \u003Ca href=\u0022https:\/\/www.jbs.cam.ac.uk\/fileadmin\/user_upload\/research\/centres\/alternative-finance\/downloads\/2017-global-cryptocurrency-benchmarking-study.pdf\u0022\u003ECambridge University\u003C\/a\u003E research, in 2013 there were approximately 300,000 to 1.3 million users of cryptocurrency. By 2017 there were between 2.9 million and 5.8 million users. To facilitate this expedited user growth, a multitude of companies have materialized that offer services enabling user interaction with the various cryptocurrency networks. A majority of these businesses function as an exchange and\/or key custodians. Consequently, this can make the organization an ideal candidate for intrusion activity, whether it be spear phishing, distributed denial of service (DDoS) attacks, ransomware, or extortion threats (from both internal and external sources).\u003C\/p\u003E\n\u003Cp\u003EMany cryptocurrency exchanges and services around the world have reportedly suffered breaches and thefts in recent years that resulted in substantial financial losses and, in many cases, closures (Figure 3). One 2013 study found that out of 40 bitcoin exchanges analyzed, over 22 percent had experienced security breaches, forcing 56 percent of affected exchanges to go out of business.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/CryptoBlockchain\/Crypto%20Figure3.png\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Timeline of publicly reported cryptocurrency service compromises\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003ESome of the more notable cryptocurrency exchange attacks that have been observed are as follows:\u003C\/p\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003E\u003Cb\u003ETime Frame\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003E\u003Cb\u003EEntity\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003E\u003Cb\u003EDescription\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EJuly 2018\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBancor\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/mashable.com\/2018\/07\/10\/bancor-hacked\/#NnzZUuHRW5qC\u0022\u003EBancor admitted\u003C\/a\u003E that unidentified actors compromised a wallet that was used to upgrade smart contracts. The actors purportedly withdrew 24,984 ETH tokens ($12.5 million USD) and 229,356,645 NPXS (Pundi X) tokens (approximately $1 million USD). The hackers also stole 3,200,000 of Bancor\u0027s own BNT tokens (approximately $10 million USD). Bancor did not comment on the details of the compromise or security measures it planned to introduce.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EJune 2018\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBithumb\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/cointelegraph.com\/news\/bithumb-details-still-sketchy-after-30-mln-hack\u0022\u003EAttackers stole\u003C\/a\u003E cryptocurrencies worth $30 million USD from South Korea\u0027s largest cryptocurrency exchange, Bithumb. According to Cointelegraph Japan, the attackers hijacked Bithumb\u0027s hot (online) wallet.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EJune 2018\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003ECoinrail\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022https:\/\/www.koreatimes.co.kr\/www\/biz\/2018\/06\/488_250462.html\u0022\u003ECoinrail admitted\u003C\/a\u003E there was a \u0026quot;cyber intrusion\u0026quot; in its system and an estimated 40 billion won ($37.2 million USD) worth of coins were stolen. Police are investigating the breach, but no further details were released.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EFebruary 2018\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBitGrail\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003E\u003Ca href=\u0022http:\/\/fortune.com\/2018\/02\/11\/bitgrail-cryptocurrency-claims-hack\/\u0022\u003EBitGrail claimed\u003C\/a\u003E $195 million USD worth of customers\u0027 cryptocurrency in Nano (XRB) was stolen.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EJanuary 2018\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003ECoincheck\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EUnidentified attackers stole 523 million NEM coins (approximately $534 million USD) from the exchange\u0027s hot wallet. \u003Ca href=\u0022https:\/\/cointelegraph.com\/news\/coincheck-to-refund-all-customers-affected-by-hack-faced-by-community-support\u0022\u003ECoincheck stated\u003C\/a\u003E that NEM coins were kept on a single-signature hot wallet rather than a more secure multi-signature wallet and confirmed that stolen coins belonged to Coincheck customers.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EJuly 2017\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003ECoindash\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EUnidentified actors \u003Ca href=\u0022https:\/\/motherboard.vice.com\/en_us\/article\/zmvg58\/hacker-allegedly-steals-dollar74-million-in-ethereum-with-incredibly-simple-trick\u0022\u003Ereportedly stole\u003C\/a\u003E $7.4 million USD from users attempting to invest during a Coindash (app platform) ICO. Coindash, which offers a trading platform for ether, launched its ICO by posting an Ethereum address to which potential investors could send funds. However, malicious actors compromised the website and replaced the legitimate address with their own ether wallet address. Coindash realized the manipulation and warned users only three minutes after the ICO began, but multiple individuals had already sent funds to the wrong wallet. This incident was the first known compromise of an ICO, which indicates the persistent creativity of malicious actors in targeting cryptocurrencies.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EJune 2017\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBithumb\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EBithumb, a large exchange for ether and bitcoin, \u003Ca href=\u0022http:\/\/fortune.com\/2017\/07\/05\/bitcoin-ethereum-bithumb-hack\/\u0022\u003Eadmitted that\u003C\/a\u003E malicious actors stole a user database from a computer of an employee that allegedly includes the names, email addresses, and phone numbers of more than 31,800 customers. Bithumb stated that its internal network was not compromised. Bithumb suggested that actors behind this compromise used the stolen data to conduct phishing operations against the exchange\u0027s users in an attempt to steal currency from its wallets, allegedly stealing cryptocurrency worth more than $1 million USD.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EApril 2017\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EYapizon\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EUnidentified actor(s) \u003Ca href=\u0022https:\/\/www.hackread.com\/south-korean-bitcoin-exchange-yapizon-hacked\/\u0022\u003Ereportedly compromised\u003C\/a\u003E four hot wallets belonging to a South Korean Bitcoin exchange, Yapizon, and stole more than 3,816 bitcoins (approximately $5 million USD). The identity of the responsible actor(s) and the method used to access the wallets remain unknown. However, Yapizon stated that there was no insider involvement in this incident.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EAugust 2016\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBitfinex\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EMalicious actor(s) stole almost \u003Ca href=\u0022http:\/\/www.reuters.com\/article\/us-bitfinex-hacked-hongkong-idUSKCN10E0KP\u0022\u003E120,000 bitcoins\u003C\/a\u003E ($72 million USD at the time), from clients\u0027 accounts at Bitfinex, an exchange platform in Hong Kong. How the breach occurred remains unknown, but the exchange made some changes to its systems after regulatory scrutiny. However, \u003Ca href=\u0022https:\/\/qz.com\/749789\/bitcoin-exchanges-cant-stop-getting-hacked-no-matter-what-security-system-they-use\/\u0022\u003Esome speculate\u003C\/a\u003E that complying with the regulators\u0027 recommendations made Bitfinex vulnerable to theft.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EMay 2016\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EGatecoin\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EThe Hong Kong-based Gatecoin \u003Ca href=\u0022https:\/\/www.coindesk.com\/gatecoin-2-million-bitcoin-ether-security-breach\/\u0022\u003Eannounced\u003C\/a\u003E that as much as $2 million USD in ether and bitcoin were lost following an attack that occurred over multiple days. The company claimed that a malicious actor altered its system so ether deposit transfers went directly to the attacker\u0027s wallet during the breach.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EFebruary 2015\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EKipCoin\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EThe Chinese exchange KipCoin \u003Ca href=\u0022https:\/\/coinjournal.net\/chinese-exchange-kipcoin-hacked\/\u0022\u003Eannounced\u003C\/a\u003E that an attacker gained access to its server in 2014 and downloaded the wallet.dat file. The malicious actor stole more than 3,000 bitcoins months later.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EFebruary 2015\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBTER\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EBTER \u003Ca href=\u0022https:\/\/www.coindesk.com\/bter-nxt-bitcoin-exchange-hack\/\u0022\u003Eannounced\u003C\/a\u003E via its website that it lost 7,170 bitcoins, ($1.75 million USD at the time). The company claimed that the bitcoins were stolen from its cold wallet.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EDecember 2015\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBitstamp\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EBitstamp \u003Ca href=\u0022https:\/\/www.coindesk.com\/unconfirmed-report-5-million-bitstamp-bitcoin-exchange\/\u0022\u003Ereported\u003C\/a\u003E that multiple operational wallets were compromised, which resulted in the loss of 19,000 bitcoins. The company received multiple phishing attempts in the months prior to the theft. One employee allegedly downloaded a malicious file that gave the attacker access to servers that contained the wallet.dat file and passphrase for the company\u0027s hot wallet.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EAugust 2014\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EBTER\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EThe China-based exchange BTER \u003Ca href=\u0022https:\/\/www.coindesk.com\/bter-nxt-bitcoin-exchange-hack\/\u0022\u003Eclaimed\u003C\/a\u003E that an attacker stole 50 million NXT, ($1.65 million USD at the time). The company claims the theft was possible following an attack on one of its hosting servers. The company \u003Ca href=\u0022https:\/\/cointelegraph.com\/news\/exclusive-key-negotiator-in-bter-nxt-hack-speaks-out\u0022\u003Ereportedly\u003C\/a\u003E negotiated the return of 85 percent of the stolen funds from the attacker.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EJuly 2014\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EMintPal\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EMintPal \u003Ca href=\u0022https:\/\/www.coindesk.com\/bitcoin-protected-vericoin-stolen-mintpal-wallet-breach\/\u0022\u003Eadmitted\u003C\/a\u003E that an attacker accessed 8 million VeriCoins ($1.8 million USD) in the company\u0027s hot wallet. The attackers exploited a vulnerability in its withdrawal system that allowed them to bypass security controls to withdraw the funds.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u0022114\u0022\u003E\u003Cp\u003EEarly 2014\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u002296\u0022\u003E\u003Cp\u003EMt. Gox\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022414\u0022\u003E\u003Cp\u003EMt. Gox, one of the largest cryptocurrency exchanges, filed for bankruptcy following a theft of 850,000 bitcoins (approximately $450 million USD at the time) and more than $24 million USD from its bank accounts. A bug in the exchange\u0027s system that went unidentified for years allegedly enabled this compromise. Additionally, some speculated that an insider could have conducted the theft. Notably, recent \u003Ca href=\u0022https:\/\/www.cryptocoinsnews.com\/suspect-of-mt-gox-hack-and-money-laundering-is-alleged-btc-e-admin-arrested-in-greece\/\u0022\u003Ereports\u003C\/a\u003E revolving around the arrest of the founder of BTC-e (Alexander Vinnik) suggest he was responsible for the attack on Mt. Gox.\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003ETable 2: Sample of observed exchange breaches\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EAs little oversight is established for cryptocurrency exchanges and no widely accepted security standards exist for them, such incidents will likely persist. Notably, while these incidents may involve outsiders compromising exchanges\u0027 and services\u0027 systems, many of the high-profile compromises have also sparked speculations that insiders have been involved.\u003C\/p\u003E\n\u003Ch3\u003ESoftware Bugs\u003C\/h3\u003E\n\u003Cp\u003EWhile there has yet to be an in-the-wild attack that has caused significant harm to the Bitcoin network itself, remember the Bitcoin software is just that: software. Developers have identified \u003Ca href=\u0022https:\/\/en.bitcoin.it\/wiki\/Common_Vulnerabilities_and_Exposures\u0022\u003E30 common vulnerabilities and exposures (CVEs)\u003C\/a\u003E since at least 2010, many of which could have caused denial of service attacks on the network, exposure of user information, degradation of transaction integrity, or theft of funds.\u003C\/p\u003E\n\u003Cp\u003EThe most recent software bug was a \u003Ca href=\u0022https:\/\/bitcoincore.org\/en\/2018\/09\/18\/release-0.16.3\/\u0022\u003Etransaction validation bug\u003C\/a\u003E that affected the consensus rules; essentially allowing miners to create transactions that weren’t properly validated and contained an extra input – which could have ultimately been exploited to create an amount of bitcoin from nothing. This vulnerability went unnoticed for two years, and fortunately was responsibly disclosed.\u003C\/p\u003E\n\u003Cp\u003ERunning any peer-to-peer (P2P) or decentralized and distributed software is risky because each individual user has the responsibility to upgrade software when bugs are found. The more people who fail to update their software in a timely manner, the greater the chance of those nodes being exploited or used to attack the network.\u003C\/p\u003E\n\u003Ch3\u003EScaling \u0026amp; Attack Surface\u003C\/h3\u003E\n\u003Cp\u003EAt the time of this post, scaling blockchain networks to the size required to support a truly global payment system still presents a problem for the new technology and is an area of contention among developers and industry players. To address this, many developers are working on various scaling solutions. The following are some of the proposed solutions and the risks associated with each:\u003C\/p\u003E\n\u003Ch4\u003EOn-chain Scaling\u003C\/h4\u003E\n\u003Cp\u003EOne proposed suggestion is to increase the block size, which consequently shifts the cost of scaling to miners and those who operate nodes. Some argue that this could introduce the risk of centralization, because the only larger organizations that can meet the bandwidth and storage demands of ever-increasing block sizes can support this type of solution.\u003C\/p\u003E\n\u003Ch4\u003EOff-chain Scaling\u003C\/h4\u003E\n\u003Cp\u003ESome of the more popular blockchain scaling solutions for crypto-assets often depend on layering networks and system architectures on top of the base protocol – also referred to as “layer two” (L2) scaling. This allows users to conduct transactions “off-chain” and only occasionally synchronize them with the Bitcoin blockchain. Many argue that this is similar to how legal contracts are enforced; you don’t need to go to court each time a legal contract is written, agreed upon, and executed. And this is something that already occurs frequently in Bitcoin, as the vast majority of transactions happen offline and off-chain within large exchanges’ and merchant providers’ cold storage solutions.\u003C\/p\u003E\n\u003Cp\u003EHowever, two choices for off-chain scaling exist:\u003C\/p\u003E\n\u003Ch5\u003EOff-chain Private Databases\u003C\/h5\u003E\n\u003Cp\u003EThis solution involves pushing transactions off-chain to a privately managed database where transaction can be settled and then occasionally synced with the Bitcoin blockchain. However, in creating this second layer of private “off-chain” transaction processing, an element of trust is introduced to the system, which unfortunately introduces risk. When transactions occur “off-chain” in a centralized private database, there is risk of improperly secured centralized ledgers that can be falsified or targeted for attack.\u003C\/p\u003E\n\u003Ch5\u003EOff-chain Trustless Payment Channels\u003C\/h5\u003E\n\u003Cp\u003EAnother L2 solution would be to push transactions off-chain – not onto a private database, but to a trustless decentralized routing network. There are two primary L2 solutions being developed: The Liquid Network (for Bitcoin) and Raiden (for Ethereum).\u003C\/p\u003E\n\u003Cp\u003EHowever, a critique of this type of scaling solution is that the accounts used on this layer are considered hot wallets, which presents the largest attack surface. This makes it the riskiest way to store funds while also creating a valuable target for hackers. If an attacker is able to identify and access a user’s L2 node and associated wallet, they could transmit all funds out of the user’s wallet.\u003C\/p\u003E\n\u003Cp\u003ELightning and Raiden as scaling solutions are still relatively new and experimental, so it’s unknown whether the they will be globally accepted as the preferred industry scaling solution. Additionally, because this layered development is still new and not widely implemented, at the time of this post there has not yet been an instance or proof of concept attack against L2 networks.\u003C\/p\u003E\n\u003Ch3\u003ENetwork \u0026amp; Protocol Attacks\u003C\/h3\u003E\n\u003Cp\u003EActors may also attempt to directly exploit a cryptocurrency P2P network or cryptographic protocol to either steal cryptocurrency or disrupt a cryptocurrency network. Albeit rare, successful attacks of this nature have been observed. Examples of attack vectors that fall into this category include the following:\u003C\/p\u003E\n\u003Ch4\u003E51% Attack\u003C\/h4\u003E\n\u003Cp\u003EThe 51% attack refers to the concept that if a single malicious actor or cohesive group of miners controlled more than 50 percent of the computing capability validating a cryptocurrency\u0027s transactions, they could reverse their own transactions or prevent transactions from being validated. While previously considered theoretical, 51% attacks have been recently observed:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EIn early April 2018, the cryptocurrency Verge \u003Ca href=\u0022https:\/\/coincentral.com\/verge-suffers-51-attack-hard-forks-in-response\/\u0022\u003Ereportedly suffered\u003C\/a\u003E a 51% attack, which resulted in the attacker being able to mine 1,560 Verge coins (XVG) every second for a duration of three hours.\u003C\/li\u003E\n\u003Cli\u003EIn May 2018, developers notified various cryptocurrency exchanges of a 51% attack on Bitcoin Gold. According to a report by \u003Ca href=\u0022https:\/\/bitcoinist.com\/51-percent-attack-hackers-steals-18-million-bitcoin-gold-btg-tokens\/\u0022\u003EBitcoinist\u003C\/a\u003E, the attack cost exchanges nearly $18 million.\u003C\/li\u003E\n\u003Cli\u003EFollowing the Bitcoin Gold attack, in June 2018, \u003Ca href=\u0022https:\/\/blog.zencash.com\/zencash-leads-the-fight-against-the-51-attack\/\u0022\u003EZenCash\u003C\/a\u003E became another target of the 51% attack, in which attackers siphoned $550,000 USD worth of currency from exchanges.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003ECompanies such as\u0026nbsp;\u003Ca href=\u0022https:\/\/www.nicehash.com\/\u0022\u003ENiceHash\u003C\/a\u003E offer a marketplace for cryptocurrency cloud mining in which individuals can rent hashing power. Couple the information available from sites like \u003Ca href=\u0022https:\/\/www.crypto51.app\/\u0022\u003ECrypto51\u003C\/a\u003E, which calculates the cost of performing 51% attacks, and it presents an attractive option for criminals seeking to disrupt cryptocurrency networks. While these types of attacks have been observed, and are no longer theoretical, they have historically posed the most risk to various alt-coins with lower network participation and hash rate. Larger, more robust, proof-of-work (PoW) networks are less likely to be affected, as the cost to perform the attack outweighs potential profit.\u003C\/p\u003E\n\u003Cp\u003EWe anticipate that as long as the cost to perform the 51% attack and the likelihood of getting caught remains low, while the potential profit remains high, actors will continue showing interest in these types of attacks across less-robust cryptocurrency networks.\u0026nbsp;\u003C\/p\u003E\n\u003Ch4\u003ESybil Attack\u003C\/h4\u003E\n\u003Cp\u003EA Sybil attack occurs when a \u003Ci\u003Esingle\u003C\/i\u003E node claims to be \u003Ci\u003Emultiple\u003C\/i\u003E nodes on the P2P network, which many see as one of the greatest security risks among all large-scale, peer-to-peer networks. A notable Sybil attack (in conjunction with a traffic confirmation attack) \u003Ca href=\u0022https:\/\/blog.torproject.org\/tor-security-advisory-relay-early-traffic-confirmation-attack\u0022\u003Eagainst the Tor anonymity network\u003C\/a\u003E occurred in 2014, spanned the course of five months, and was conducted by unknown actors.\u003C\/p\u003E\n\u003Cp\u003EAs it pertains to cryptocurrency networks in particular, attackers performing this type of attack could perform the following:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EBlock honest users from the network by outnumber honest nodes on the network, and refusing to receive or transmit blocks.\u003C\/li\u003E\n\u003Cli\u003EChange the order of transactions, prevent them from being confirmed, or even reverse transactions that can lead to double spending by controlling a majority of the network computing power in large-scale attacks.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/www.microsoft.com\/en-us\/research\/publication\/the-sybil-attack\/\u0022\u003EAs described\u003C\/a\u003E by Microsoft researcher John Douceur, many P2P networks rely on redundancy to help lower the dependence on potential hostile nodes and reduce the risk of such attacks. However, this method of mitigation falls short if an attacker impersonates a substantial fraction of the network nodes, rendering redundancy efforts moot. The suggested solution to avoiding Sybil attacks in P2P networks, as presented in the research, is to implement a logically centralized authority that can perform node identity\/verification. According to the research, without implementing such a solution, Sybil attacks will always remain a threat “except under extreme and unrealistic assumptions of resource parity and coordination among entities.”\u003C\/p\u003E\n\u003Ch4\u003EEclipse Attack\u003C\/h4\u003E\n\u003Cp\u003EAn eclipse attack involves an attacker or group controlling a significant number of nodes and then using those nodes to monopolize inbound and outbound connections to other victim nodes, effectively obscuring the victim node’s view of the blockchain and isolating it from other legitimate peers on the network. According to \u003Ca href=\u0022https:\/\/eprint.iacr.org\/2015\/263.pdf\u0022\u003Esecurity researchers\u003C\/a\u003E, aside from disrupting the network and filtering the victim node’s view of the blockchain, eclipse attacks can be useful in launching additional attacks once successfully executed. Some of these attacks include:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EEngineered Block Races:\u0026nbsp;Block races occur in mining when two miners discover blocks at the same time. Generally, one block will be added to the chain, yielding mining rewards, while the other block is orphaned and ignored, yielding no mining reward. If an attacker can successfully eclipse attack miners, the attacker can engineer block races by hoarding blocks until a competing block has been found by non-eclipsed miners – effectively causing the eclipsed miners to waste efforts on orphaned blocks.\u003C\/li\u003E\n\u003Cli\u003ESplitting Mining Power: An attacker could use eclipse attacks to effectively cordon off fractions of miners on a network, thereby eliminating their hashing power from the network. Removing hashing power from a network allows for easier 51% attacks to occur given enough miners are effectively segmented from the network to make a 51% attack profitable.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EOn Jan. 5, 2019, the cryptocurrency company \u003Ca href=\u0022https:\/\/blog.coinbase.com\/ethereum-classic-etc-is-currently-being-51-attacked-33be13ce32de\u0022\u003ECoinbase detected\u003C\/a\u003E a possible eclipse + 51% attack effecting the Ethereum Classic (ETC) blockchain. The attack involved malicious nodes surrounding Coinbase nodes, presenting them with several deep chain reorganizations and multiple double spends – totaling 219,500 ETC (worth at the time of this reporting roughly $1.1 million USD).\u003C\/p\u003E\n\u003Cp\u003EWhile eclipse attacks are difficult to mitigate across large-scale P2P networks, some fixes can make them more difficult to accomplish. FireEye recommends implementing the following, where applicable, to help reduce the risk of eclipse attacks:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003ERandomized node selection when establishing connections.\u003C\/li\u003E\n\u003Cli\u003ERetain information on other nodes previously deemed \u003Ci\u003Ehonest\u003C\/i\u003E, and implement preferential connection to those nodes prior to randomized connections (this increases the likelihood of connecting to at least one honest node).\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch3\u003EHow the Public and Private Sector Can Help Mitigate Risk\u003C\/h3\u003E\n\u003Ch4\u003EPublic Sector Priorities\u003C\/h4\u003E\n\u003Cp\u003EAs blockchain technology continues to develop, and issues like scaling, security, and identity management are addressed, it is safe to assume the ecosystem we have today will not look like the ecosystem of tomorrow. Due to this, the public sector has generally maintained a hands-off approach to allow the space to mature and innovate before implementing firm regulations. However, in the future, there are likely to be certain key areas of regulation the public sector could focus on:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EVirtual Currencies (tax implications, asset classification)\u003C\/li\u003E\n\u003Cli\u003EData encryption\u003C\/li\u003E\n\u003Cli\u003EPrivacy\u003C\/li\u003E\n\u003Cli\u003EIdentity Management (KYC and FCC)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EPrivate Sector’s Role\u003C\/h4\u003E\n\u003Cp\u003EBecause of the public sector’s wait-and-see approach to regulation, it could be argued that the private sector should have a more active role in securing the technology as it continues to mature. Private sector leaders in software and network development, hardware manufacturing, and cyber security all have the ability to weigh in on blockchain development as it progresses to ensure user security and privacy are top priorities. Universities and independent research groups should continue to study this emerging technology as it develops.\u003C\/p\u003E\n\u003Cp\u003EWhile no widely promoted and formal security standards exist for cryptocurrency networks at the time of this post, The Cryptocurrency Certification Consortium (C4) is actively developing the \u003Ca href=\u0022https:\/\/cryptoconsortium.github.io\/CCSS\/\u0022\u003ECryptocurrency Security Standard (CCSS)\u003C\/a\u003E, a set of requirements and framework to complement existing information security standards as it relates to cryptocurrencies, including exchanges, web applications, and cryptocurrency storage solutions.\u003C\/p\u003E\n\u003Ch4\u003ECyber Security Community\u003C\/h4\u003E\n\u003Cp\u003EFrom a cyber security perspective, we should learn from the vulnerabilities of TCP\/IP development in the early days of the internet, which focused more on usability and scale than security and privacy – and insist that if blockchain technology is to help revolutionize the way business and trade is conducted that those two areas of focus (security and privacy) are held at the forefront of blockchain innovation and adoption. This can be achieved through certain self-imposed (and universally agreed upon) industry standards, including:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EForced encryption of locally stored wallet files (instead of opt-in options).\u003C\/li\u003E\n\u003Cli\u003ECode or policy rule that requires new wallet and key generation when user performs password changes.\u003C\/li\u003E\n\u003Cli\u003EContinued development and security hardening of multi-sig wallet solutions.\u003C\/li\u003E\n\u003Cli\u003EEmphasis on and clear guidelines for responsible bug disclosure.\u003C\/li\u003E\n\u003Cli\u003EContinued security research and public reporting on security implications of both known and hypothetical vulnerabilities regarding blockchain development.\u003Cul\u003E\n\u003Cli\u003EAnalyzing protocols and implementations to determine what threats they face, and providing guidance on best practices.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch3\u003EOutlook\u003C\/h3\u003E\n\u003Cp\u003EWhile blockchain technology offers the promise of enhanced security, it also presents its own challenges. Greater responsibility for security is often put into the hands of the individual user, and while some of the security challenges facing exchanges and online wallet providers can be addressed through existing best practices in cyber security, linking multiple users, software solutions, and integration into complex legacy financial systems creates several new cyber security paradigms.\u003C\/p\u003E\n\u003Cp\u003ETo maintain strong network security, the roles and responsibilities of each type of participant in a blockchain network must be clearly defined and enforced, and the cyber security risks posed by each type of participant must be identified and managed. It is also critical that blockchain development teams understand the full range of potential threats that arise from interoperating with third parties and layering protocols and applications atop the base protocols.\u003C\/p\u003E\n\u003Cp\u003EThe value and popularity of cryptocurrencies has grown significantly in the recent years, making these types of currencies a very attractive target for financially motivated actors. Many of the aforementioned examples of the various attack vectors can be of high utility in financially motivated operations. We expect cyber crime actors will continue to demonstrate high interest in targeting cryptocurrencies and their underlying network protocols for the foreseeable future.\u003C\/p\u003E\n",
        "jcr:lastModified": "Wed Jan 23 2019 10:48:00 GMT-0500",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EBlockchain technology offers the promise of enhanced security, but also presents its own challenges.\u003C\/p\u003E\n",
      "jcr:lastModified": "Tue Jan 22 2019 16:42:26 GMT-0500",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Wed Jan 23 2019 08:56:58 GMT-0500",
      "imageRotate": "0"
    }
  }
}
