{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed May 04 2016 09:03:32 GMT-0400",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Chasing CnC Servers - False positives",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "ce54ddc3-b92b-4115-bcef-873cd0eca185",
    "author": "Atif Mushtaq",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "lynda.hall@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "4fc7dde8-bf9e-4238-af79-f59c310ac8f3"
    ],
    "jcr:created": "Fri Jun 03 2016 19:45:26 GMT-0400",
    "cq:lastReplicated": "Fri Jun 03 2016 19:45:26 GMT-0400",
    "cq:lastModified": "Mon May 09 2016 18:18:07 GMT-0400",
    "jcr:baseVersion": "4fc7dde8-bf9e-4238-af79-f59c310ac8f3",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-doctypes:blog",
      "fireeye-blog-authors:cap-atif-mushtaq"
    ],
    "jcr:uuid": "b84d2535-74c1-43c2-ac87-f055d30d9227",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Thu Sep 23 2010 13:06:18 GMT-0400",
    "cq:lastModifiedBy": "lynda.hall@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
        "text": "\u003Cp\u003EIn my \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2010\/08\/chasing-cncs-part1.html\u0022 target=\u0022_blank\u0022\u003Elast article\u003C\/a\u003E, I discussed how tricky it can be to track botnets through their command and control (CnC) servers. My last article was more focused on the false negatives (missed detections) aspect of this approach. Today, I will discuss the false positive (incorrect alerts\/detections) issue in detail.\u003C\/p\u003E\n\u003Cp\u003ETracking botnets through the CnC servers requires a few assumptions. One such assumption is that \u0026quot;every CnC is a bad resource or is at least distinguishable from the good ones\u0026quot;.\u0026nbsp; That\u0027s not completely true. Sounds strange?\u0026nbsp; Let me explain.\u003C\/p\u003E\n\u003Cp\u003EThere are many possible cases where a CnC server (IP and\/or domain) is not owned by or completely under the control of the bot herder(s).\u003C\/p\u003E\n\u003Cp\u003EThere are some key possible scenarios:\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E1. Shared Server DNS\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EBot herders often use compromised Web servers for hosting their CnCs. One directory under the document root might be used to keep botnet data and the rest of the server might be hosting the legitimate Web contents.\u0026nbsp; This creates a very tricky situation.\u0026nbsp; So, a DNS query for this server no longer means a bot is attempting to connect to its CnC server. Rather, an actual user may be legitimately browsing this Web server.\u0026nbsp; Taking actions on such alerts would not only declare a clean machine as infected, but may also block the user from accessing a legitimate resource.\u003C\/p\u003E\n\u003Cp\u003EThis is such a widespread case that Zeus\/Zbot tracker maintains a \u003Ca href=\u0022https:\/\/zeustracker.abuse.ch\/removals.php\u0022 target=\u0022_blank\u0022\u003Elist\u003C\/a\u003E of those domains which were used as the CnC at some point in time and were found to be cleaned after the investigation.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E2. Shared IPs\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThere are many botnets that don\u0027t use DNS queries to locate their CnC servers.\u0026nbsp; Let\u0027s look at big botnets like Rustock and Pushdo. In these cases, bots identify their CnC server using the direct IP address assigned to these CnC servers.\u0026nbsp; The CnC servers are typically purchased using stolen credit cards and are abandoned\u0026nbsp; by the bot herders very quickly. Once bot herders abandon these CnC servers, these IP blocks can be reassigned to a legitimate party.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E3. Public Web 2.0 sites\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EWe are seeing a trend where many bot herders have started using public services, like Web 2.0 sites, for hosting their CnCs. This includes, but is not limited to, \u003Ca href=\u0022http:\/\/sunbeltblog.blogspot.com\/2010\/05\/diy-twitter-botnet-creator.html\u0022 target=\u0022_blank\u0022\u003ETwitter\u003C\/a\u003E, Rapidshare, \u003Ca href=\u0022http:\/\/www.threatexpert.com\/report.aspx?md5=bd9208edf44d0ee32b974a2d9da7bc61\u0022 target=\u0022_blank\u0022\u003Emultimania.co.uk, lycos.co.uk\u003C\/a\u003E, \u003Ca href=\u0022http:\/\/news.cnet.com\/8301-1009_3-10413951-83.html\u0022 target=\u0022_blank\u0022\u003EAmazon.com\u0027s cloud services\u003C\/a\u003E and a huge list of IRC, FTP and SMTP servers. This type of CnC infrastructure makes CnC signature-based botnet detection very false positive prone and almost impossible from a practical standpoint because all the malware is doing is talking to legitimate servers\/domains.\u003C\/p\u003E\n\u003Cp\u003EThe recent \u0026quot;Here you have\u0026quot; email worm is a prime example of this.\u0026nbsp; Bot herders were hosting their files on members.lycos.uk and multimania.co.uk.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E4. p2p botnets\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003Ep2p botnets like Storm, Nugache and Waledac don\u0027t have a central command and control mechanism.\u0026nbsp; By not using centralized CnC servers, these botnets render CnC server based detection completely impossible.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E5. No CnC\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EThere are many malware which don\u0027t have any CnC mechanism. While most of these malware are viruses and worms were developed just for fun, there are some modern malware attacks that have also been seen without any CnC communication. Bot herders use \u0026quot;ransomware\u0026quot; to encrypt user\u0027s files and ask victims to talk to them via email in order to pay and recover their files.\u003C\/p\u003E\n\u003Cp\u003ESome academic research shows that its possible to detect CnC domains through statistical analysis of the domain.\u0026nbsp; This is an attempt to solve the false negative issues associated with CnC based botnet detection.\u0026nbsp; The problem is that, although this approach might solve some of the false negative issues, it makes false positive issues even worse.\u0026nbsp; This approach relies heavily on historical NS and domain whois records.\u0026nbsp; This approach might sometimes distinguish a bad domain from a legitimate domain, but the point is that not every bad domain is a CnC domain.\u0026nbsp; Everyday bad guys \u003Ca href=\u0022http:\/\/labs.m86security.com\/2010\/09\/russian-pro-spam-registrars\/\u0022 target=\u0022_blank\u0022\u003Eregister hundreds of spam\/phishing\u003C\/a\u003E domains to evade spam filters.\u0026nbsp; The occurrence of a bad domain is not always an indication of a machine hosting bots. For instance many spam filters scan through email contents and sometimes lookup the domains inside email bodies.\u0026nbsp; This scanning would result in generating lots of DNS queries for bad domains.\u0026nbsp; These anomaly detector may take the DNS queries generated by the these filters as suspicious behavior and declare the source IP as an infected machine. A funny situation, isn\u0027t it?\u003C\/p\u003E\n\u003Cp\u003EAnother widespread case occurs when a user comes across a rogue, spam or exploit domain due to a pop up or Web page redirection.\u0026nbsp; In the case of a social engineering attack, a user may simply ignore it or due to system incompatibility the exploit may not work (Windows is not the only OS in town).\u0026nbsp; Resultant DNS queries would mislead such anomaly detectors.\u0026nbsp; To work around this fundamental problem these types of anomaly detectors often introduce a concept of \u0026quot;under observation\u0026quot; machine. These sensors initially mark a particular system as suspicious after seeing the first so called \u0026quot;bad domain\u0026quot; and assume that if it is a botted machine then it would do these DNS queries periodically.\u0026nbsp; Keeping a machine under observation for an extended period of time means that you are letting CnC communication go out until you are reasonably sure.\u0026nbsp; How long does it take for password stealers to upload stolen data? In a lab run of several Zbot samples, I noticed that on average it takes Zbot less than a minute to upload cached passwords.\u0026nbsp; Whats the use of a detection after crooks have emptied out your banking accounts?\u003C\/p\u003E\n\u003Cp\u003EWith this type of approach one would end up analyzing terabytes of unique Command and Control (CnC) data and still miss lots of detection.\u0026nbsp; This much data itself shows a race condition where security guys would keep on collecting new CnC data and in the meantime, the bad guys would move to new CnCs.\u003C\/p\u003E\n\u003Cp\u003EAntivirus vendors face a similar problem. They collect \u003Ca href=\u0022https:\/\/blogs.technet.com\/b\/mmpc\/archive\/2009\/04\/30\/protecting-our-customers-from-half-a-million-new-unique-malicious-files-every-day.aspx\u0022 target=\u0022_blank\u0022\u003Emillions of unique samples\u003C\/a\u003E on a daily basis and still miss a lot.\u0026nbsp; The theory that if the bad guys want to break in, they will, and stopping the CnC communication can prevent all the damage is like not opting for a vaccination but rather waiting for the infections to come and then fighting the disease with antibiotics.\u0026nbsp; We all know that sometimes antibiotics cause more damage than the actual disease. \u0026nbsp; A successful defense should be a multi-layered approach.\u003C\/p\u003E\n\u003Cp\u003EThis is how I define the ideal mlti-layered approach to defending today\u0027s networks:\u003C\/p\u003E\n\u003Cp\u003E1. Address the core problems via better policies, such as patching out-of-date software (to stop old exploits) and ongoing user training (to mitigate social engineering). Limiting these types of vulnerabilities as much as you can is a good first step.\u003C\/p\u003E\n\u003Cp\u003E2. However, threats like zero-day attacks will pass through this first line of defense. So, try to stop it at the network layer before it exploits endpoint software or human mistakes.\u003C\/p\u003E\n\u003Cp\u003E3. If both of the above approaches don\u0027t work and an infection sets in, then at least block the malware from communicating back to its CnCs and exfilrating data.\u0026nbsp; This is yet another mitigation step to stop malware from propagating and\/or stealing user credentials.\u003C\/p\u003E\n\u003Cp\u003EPlease note here that blocking CnC communication can\u0027t prevent other damages caused by modern malware like system resource consumption, \u003Ca href=\u0022http:\/\/www.microsoft.com\/security\/portal\/Threat\/Encyclopedia\/Entry.aspx?name=Win32%2fVirut\u0022 target=\u0022_blank\u0022\u003Ecorrupting\u003C\/a\u003E and\/or \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2009\/03\/a-new-method-to-monetize-scareware.html\u0022 target=\u0022_blank\u0022\u003Ehijacking\u003C\/a\u003E user\u0027s file \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2009\/04\/ransomware_on_the_loose.html\u0022 target=\u0022_blank\u0022\u003Eetc\u003C\/a\u003E.\u0026nbsp; Malware like Bancos edits the Windows hosts file to redirect users to fake banking Web sites. So, even if the CnC communication is stopped, the end user\u0027s hosts file still needs to be cleaned. Otherwise, the user would keep on visiting the phishing Web sites and losing his\/her valuable information and money.\u0026nbsp; Moreover, modern malware comes in the form of \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2009\/04\/botnetweb.html\u0022 target=\u0022_blank\u0022\u003Ewolf packs\u003C\/a\u003E.\u0026nbsp; The inability to stop even one CnC communication could result in having infection again.\u003C\/p\u003E\n\u003Cp\u003EIn order to backup my findings, I will finish my article with some real world malware examples.\u003C\/p\u003E\n\u003Cp\u003E\u003Cspan style=\u0022font-size: medium;\u0022\u003E\u003Cb\u003E\u0026quot;Here you have\u0026quot; email worm communicating to multimania.co.uk.\u003C\/b\u003E\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ca style=\u0022display: inline;\u0022 href=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef013487967251970c-800wi.png\u0022\u003E\u003Cimg border=\u00220\u0022 class=\u0022asset asset-image at-xid-6a00d835018afd53ef013487967251970c image-full  landscape-med\u0022 title=\u0022Here_you_have\u0022 alt=\u0022Here_you_have\u0022 src=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef013487967251970c-800wi.png\u0022\u003E\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003E\u003Cspan style=\u0022font-size: medium;\u0022\u003EIRC.Mechbot bot connecting to DAL IRC network\u003C\/span\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003EIt forms its own communication channel to send\/receive CnC commands.\u0026nbsp; You can never black list this CnC server without causing lots of false positive alarms.\u003C\/p\u003E\n\u003Cp\u003E\u003Ca style=\u0022display: inline;\u0022 href=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f476819b970b-800wi.png\u0022\u003E\u003Cimg border=\u00220\u0022 class=\u0022asset asset-image at-xid-6a00d835018afd53ef0133f476819b970b image-full  landscape-med\u0022 title=\u0022Irc\u0022 alt=\u0022Irc\u0022 src=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f476819b970b-800wi.png\u0022\u003E\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u003Cb\u003E\u003Cspan style=\u0022font-size: medium;\u0022\u003EWaledac a P2P botnet connecting to its peers\u003C\/span\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003ENo central server (DNS and\/or IP)\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u0026nbsp;\u003Ca style=\u0022display: inline;\u0022 href=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f4771d00970b-800wi.png\u0022\u003E\u003Cimg border=\u00220\u0022 class=\u0022asset asset-image at-xid-6a00d835018afd53ef0133f4771d00970b image-full  landscape-med\u0022 title=\u0022Waledac_p2p\u0022 alt=\u0022Waledac_p2p\u0022 src=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f4771d00970b-800wi.png\u0022\u003E\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u0026nbsp;\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u003Cspan style=\u0022font-size: medium;\u0022\u003E\u003Cb\u003EPushdo and Cutwail\u003C\/b\u003E\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003ENeither of these use DNS to locate their CnCs.\u0026nbsp; The absence of DNS requests makes DNS based statistical analysis useless.\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u003Ca style=\u0022display: inline;\u0022 href=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f47727ce970b-800wi.png\u0022\u003E\u003Cimg border=\u00220\u0022 class=\u0022asset asset-image at-xid-6a00d835018afd53ef0133f47727ce970b image-full  landscape-med\u0022 title=\u0022Pushdo_cutwail\u0022 alt=\u0022Pushdo_cutwail\u0022 src=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f47727ce970b-800wi.png\u0022\u003E\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u003Cb\u003E\u0026nbsp;\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u003Cspan style=\u0022font-size: medium;\u0022\u003E\u003Cb\u003EAbuse of Perfect Keylogger software\u003C\/b\u003E\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003EMany people are not aware of malware who communicate over SMTP.\u0026nbsp; Here is an example, a malware based on the Perfect Keylogger software package (\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2009\/03\/stealers.html\u0022 target=\u0022_blank\u0022\u003Eblog post on this\u003C\/a\u003E) is uploading stolen information directly to AOL\u0027s email service. Does it make AOL a CnC server?\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u0026nbsp;\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u003Ca style=\u0022display: inline;\u0022 href=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f4773531970b-800wi.jpg\u0022\u003E\u003Cimg border=\u00220\u0022 class=\u0022asset asset-image at-xid-6a00d835018afd53ef0133f4773531970b image-full  landscape-med\u0022 title=\u0022Aol\u0022 alt=\u0022Aol\u0022 src=\u0022\/content\/dam\/legacy\/blog\/2012\/11\/6a00d835018afd53ef0133f4773531970b-800wi.jpg\u0022\u003E\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003EThese are just few examples, time doesn\u0027t permit me to discuss each and every case. There are 100s of such cases where malware communicates to CnC servers which are almost impossible to blacklist. The time has come to leave this outdated black list approach and find new ways to detect modern malware.\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003E\u003Cb\u003EAtif Mushtaq\u003C\/b\u003E\u003Cspan class=\u0022Apple-converted-space\u0022\u003E\u0026nbsp;\u003C\/span\u003E@ FireEye Malware Intelligence Lab\u003C\/p\u003E\n\u003Cp style=\u0022margin-top: 10px; margin-bottom: 10px;\u0022\u003EDetailed Questions\/Comments : research SHIFT-2 fireeye DOT COM\u003C\/p\u003E\n",
        "jcr:lastModified": "Mon May 09 2016 18:18:07 GMT-0400",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    }
  }
}
