{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Wed Oct 28 2020 15:34:42 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Welcome to ThreatPursuit VM: A Threat Intelligence and Hunting Virtual Machine",
    "jcr:versionHistory": "8ff3d880-4066-442b-90e1-b0efea98c834",
    "author": "Dan Kennedy",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "92fd0a98-5d49-4673-9d11-fef60db02c94"
    ],
    "jcr:created": "Wed Oct 28 2020 15:34:42 GMT+0000",
    "cq:lastModified": "Wed Oct 28 2020 15:34:35 GMT+0000",
    "jcr:baseVersion": "92fd0a98-5d49-4673-9d11-fef60db02c94",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:dan-kennedy",
      "fireeye-blog-authors:nhan-huynh",
      "fireeye-blog-authors:blaine-stancill",
      "fireeye-blog-authors:jacob-barteaux",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:FLARE",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:malware",
      "fireeye-blog-tags:mandiant-advantage",
      "fireeye-blog-tags:threat-intelligence"
    ],
    "jcr:uuid": "2006a591-0bb0-4ee3-95c0-65a841c3df0f",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Wed Oct 28 2020 11:30:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/logo.png\u0022 alt=\u0022\u0022 class=\u0022float-right-small\u0022\u003ESkilled adversaries can deceive detection and often employ new measures in their tradecraft. Keeping a stringent focus on the lifecycle and evolution of adversaries allows analysts to devise new detection mechanisms and response processes. Access to the appropriate tooling and resources is critical to discover these threats within a timely and accurate manner. Therefore, we are actively compiling the most essential software packages into a Windows-based distribution: \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/github.com\/fireeye\/ThreatPursuit-VM\u0022\u003EThreatPursuit VM\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003EThreatPursuit Virtual Machine (VM) is a fully customizable, open-sourced Windows-based distribution focused on threat intelligence analysis and hunting designed for intel and malware analysts as well as threat hunters to get up and running quickly. The threat intelligence analyst role is a subset and specialized member of the blue team. Individuals in this role generally have a strong impetus for knowing the threat environment. Often their traits, skills and experiences will vary depending on training and subject matter expertise.\u003C\/p\u003E\n\u003Cp\u003ETheir expertise may not be technical and may include experiences and tradecraft earned by operating within a different domain (e.g., geospatial, criminal, signals intelligence, etc.). A key aspect of the role may include the requirement to hunt, study and triage previously undiscovered or recently emerging threats by discerning data for evil. Threat analysts apply a variety of structured analytical methods in order to develop meaningful and relevant products for their customers.\u003C\/p\u003E\n\u003Cp\u003EWith this distribution we aim to enable users to:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EConduct hunting activities or missions\u003C\/li\u003E\n\u003Cli\u003ECreate adversarial playbooks using evidence-based knowledge\u003C\/li\u003E\n\u003Cli\u003EDevelop and apply a range of analytical products amongst datasets\u003C\/li\u003E\n\u003Cli\u003EPerform analytical pivoting across forensic artifacts and elements\u003C\/li\u003E\n\u003Cli\u003EEmulate advanced offensive security tradecraft\u003C\/li\u003E\n\u003Cli\u003EEnable situational awareness through intelligence sharing and reporting\u003C\/li\u003E\n\u003Cli\u003EApplied data science techniques \u0026amp; visualize clusters of symbolic data\u003C\/li\u003E\n\u003Cli\u003ELeverage open intelligence sources to provide unique insights for defense and offense\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EAkin to both \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/11\/flare-vm-update.html\u0022\u003EFLARE-VM\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2019\/03\/commando-vm-windows-offensive-distribution.html\u0022\u003ECommando VM\u003C\/a\u003E, ThreatPursuit VM uses \u003Ca href=\u0022https:\/\/boxstarter.org\/\u0022\u003EBoxstarter\u003C\/a\u003E, \u003Ca href=\u0022https:\/\/chocolatey.org\/\u0022\u003EChocolatey\u003C\/a\u003E\u0026nbsp;and \u003Ca href=\u0022https:\/\/www.myget.org\/\u0022\u003EMyGet\u003C\/a\u003E packages to install software that facilitates the many aspects related to roles performed by analysts. The tools installed provide easy access to a broad range of tooling, including, but not limited to, threat analytics, statistics, visualisation, threat hunting, malware triage, adversarial emulation, and threat modelling. Here are some of the tools, but there are many more:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.misp-project.org\/\u0022\u003EMISP\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.opencti.io\/en\/\u0022\u003EOpenCTI\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.elastic.co\/\u0022\u003EElasticsearch, Kibana, Logstash\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.splunk.com\/\u0022\u003ESplunk\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/threathunterplaybook.com\/introduction.html\u0022\u003EThreat Hunter Playbook\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.constellation-app.com\/\u0022\u003ECSIRO Data61 Constellation\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.maltego.com\/\u0022\u003EMaltego\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/rstudio.com\/\u0022\u003ERStudio\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/github.com\/mitre\/caldera\u0022\u003EMITRE CALDERA\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/jupyter.org\/\u0022\u003EJupyter Notebook\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.python.org\/\u0022\u003EPython\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/github.com\/fireeye\/SilkETW\u0022\u003ESilkETW\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EFor a full list of tools, please visit our \u003Ca href=\u0022https:\/\/github.com\/fireeye\/ThreatPursuit-VM\u0022\u003EGitHub repository\u003C\/a\u003E.\u003C\/p\u003E\n\u003Ch4\u003EInstallation\u003C\/h4\u003E\n\u003Cp\u003ESimilar to\u0026nbsp;\u003Ca href=\u0022https:\/\/github.com\/fireeye\/flare-vm\u0022\u003EFLARE-VM\u003C\/a\u003E and \u003Ca href=\u0022https:\/\/github.com\/fireeye\/commando-vm\u0022\u003ECommando VM\u003C\/a\u003E, it\u0027s recommended to install ThreatPursuit VM in a virtual machine. The following is an overview of the minimal and recommended installation requirements.\u003C\/p\u003E\n\u003Ch5\u003ERequirements\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EWindows 10 1903 or greater\u003C\/li\u003E\n\u003Cli\u003E60 GB Hard Drive\u003C\/li\u003E\n\u003Cli\u003E4 GB RAM\u003Cbr\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003ERecommended\u003C\/h5\u003E\n\u003Cul\u003E\n\u003Cli\u003EWindows 10 1903\u003C\/li\u003E\n\u003Cli\u003E80+ GB Hard Drive\u003C\/li\u003E\n\u003Cli\u003E6+ GB RAM\u003C\/li\u003E\n\u003Cli\u003E1 network adapter\u003C\/li\u003E\n\u003Cli\u003EOpenGL Graphics Card 1024mb\u003C\/li\u003E\n\u003Cli\u003EEnable Virtualization support for VM\u003Cul\u003E\n\u003Cli\u003ERequired for Docker (MISP, OpenCTI)\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch5\u003EStandard Install\u003C\/h5\u003E\n\u003Cp\u003EThe easiest way to install ThreatPursuit VM is to use the following steps. This will install all the default tools and get you finding evil in no time!\u003Cbr\u003E\n\u003C\/p\u003E\n\u003Col\u003E\n\u003Cli\u003ECreate and configure a new Windows 10 VM with the aforementioned requirements.\u003Cul\u003E\n\u003Cli\u003EEnsure VM is updated completely. You may need to check for updates, reboot and check again until no more remain.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EInstall your specific VM guest tools (e.g., VMware Tools) to allow additional features such as copy\/paste and screen resizing.\u003C\/li\u003E\n\u003Cli\u003ETake a snapshot of your machine! This allows you to always have a clean state.\u003C\/li\u003E\n\u003Cli\u003EDownload and copy \u003Ci\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/raw.githubusercontent.com\/fireeye\/ThreatPursuit-VM\/install.ps1\u0022\u003Einstall.ps1\u003C\/a\u003E\u003C\/i\u003E to your newly configured VM.\u003C\/li\u003E\n\u003Cli\u003EOpen PowerShell as an administrator.\u003C\/li\u003E\n\u003C\/ol\u003E\n\u003Cp\u003ENext, unblock the install file by running:\u0026nbsp;\u003Ci\u003EUnblock-File .\\install.ps1\u003C\/i\u003E, as seen in Figure 1.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Unblock-File installation script\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EEnable script execution by running:\u0026nbsp;\u003Ci\u003ESet-ExecutionPolicy Unrestricted -f\u0026nbsp;\u003C\/i\u003E, as seen in Figure 2.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Set-ExecutionPolicy Unrestricted -f script\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EFinally, execute the installer script as follows:\u0026nbsp;\u003Ci\u003E.\\install.ps1\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAfter executing \u003Ci\u003Einstall.ps1\u003C\/i\u003E, you’ll be prompted for the administrator password in order to automate host restarts during installation as several reboots occur. Optionally, you may pass your password as a command-line argument via \u0026quot;\u003Ci\u003E.\\install.ps1 -password \u0026lt;password\u0026gt;\u0026quot;\u003C\/i\u003E. If you do not have a password set, hitting enter when prompted will also work.\u003C\/p\u003E\n\u003Cp\u003EThis will be the last thing you will need to do before the installation is unattended. The script will set up the Boxstarter environment and proceed to download and install the ThreatPursuit VM environment, as seen in Figure 3.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Installation script execution\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EThe installation process may take upwards of several hours depending on your internet connection speed and the web servers hosting the various files.\u0026nbsp;Figure 4 shows the post-installation desktop environment, featuring the logo and a desktop shortcut. You will know when the install is finished with the VM\u0027s logo placed on the background.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: ThreatPursuit VM desktop installed\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch5\u003ECustom Install\u003C\/h5\u003E\n\u003Cp\u003EIs the standard installation too much for you? We provide a custom installation method that allows you to choose which chocolatey packages get installed. For additional details, see the \u003Ca href=\u0022https:\/\/github.com\/fireeye\/ThreatPursuit-VM#custom-install\u0022\u003ECustom Install\u003C\/a\u003E steps at our GitHub repository.\u003C\/p\u003E\n\u003Ch5\u003EInstalling Additional Packages\u003C\/h5\u003E\n\u003Cp\u003ESince ThreatPursuit VM uses the Chocolatey Windows package manager, it\u0027s easy to install additional packages not included by default. For example, entering the command\u0026nbsp;\u003Ci\u003Ecinst github\u003C\/i\u003E as administrator installs GitHub Desktop on your system.\u003C\/p\u003E\n\u003Cp\u003ETo update all currently installed packages to their most recent versions, run the command\u0026nbsp;\u003Ci\u003Ecup all\u003C\/i\u003E as administrator.\u003C\/p\u003E\n\u003Ch4\u003EGetting Started: A Use Case\u003C\/h4\u003E\n\u003Cp\u003EAs threat analysts, what we choose to pursue will depend on the priorities and requirements of our current role. Often, they vary with each threat or adversary encountered such as financial crime, espionage, issue-motivated groups or individuals. The role broadly encompasses the collection and analysis of threat data (e.g., malware, indicators of attack\/compromise) with the goal of triaging the data and developing actionable intelligence. For example, one may want to produce detection signatures based on malware network communications to classify, share or disseminate indicators of compromise (IOCs) in standardized ways. We may also use these IOCs in order to develop and apply analytical products that establish clusters of analogous nodes such as MITRE ATT\u0026amp;CK tactics and techniques, or APT groups. On the other hand, our goal can be as simple as triaging a malware sample behavior, hunting for indicators, or proving or disproving a hypothesis. Let\u0027s look at how we might start.\u003C\/p\u003E\n\u003Ch4\u003EOpen Hunting\u003C\/h4\u003E\n\u003Cp\u003ETo start our use case, let’s say we are interested in reviewing latest threat actor activity reported for the quarter. We sign in to the\u0026nbsp;\u003Ca href=\u0022https:\/\/www.fireeye.com\/mandiant\/advantage.html\u0022\u003EMandiant Advantage\u003C\/a\u003E\u0026nbsp;portal (Figure 5) using our public subscription to get a snapshot view of any highlighted activity (Figure 6).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture5.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: Mandiant Advantage portal\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture6.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 6: Actor activity for Q3 2020\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EBased on Mandiant Advantage report, we notice a number of highly active APT and FIN actors. We choose to drill in to one of these actors by hovering our mouse and selecting the actor tag FIN11.\u003C\/p\u003E\n\u003Cp\u003EWe receive a high-level snapshot summary view of the threat actor, their targeted industry verticals, associated reports and much more, as seen in Figure 7. We also may choose to select the most recent report associated with\u0026nbsp;\u003Ca href=\u0022https:\/\/advantage.mandiant.com\/reports\/20-00011864\u0022\u003EFIN11\u003C\/a\u003E\u0026nbsp;for review.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture7.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 7: FIN11 actor summary\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EBy selecting the “View Full Page” button as seen at the top right corner of Figure 6, we can use the feature to download indicators, as seen in the top right corner of Figure 8.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture9.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 8: Full FIN11 page\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWithin the FIN11 report, we review the associated threat intelligence tags that contain finished intelligence products. However, we are interested in the collection of raw IOCs (Figure 9) that we could leverage to pivot off or enrich our own datasets.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture10.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 9: Downloaded FIN11 indicators\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EUsing the \u003Ca href=\u0022https:\/\/www.misp-project.org\/\u0022\u003EMalware Information Sharing Platform (MISP\u003C\/a\u003E)as our collection point, we are going to upload and triage our indicators using our local MISP instance running on ThreatPursuit VM.\u003C\/p\u003E\n\u003Cp\u003EPlease note you will need to ensure your local MISP instance is running correctly with the configuration of your choosing. We select the “Add Event” button, begin populating all needed fields to prepare our import, and then click “Submit”, as shown in Figure 10.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture11.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 10: MISP triage of events\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EUnder the tags section of our newly created FIN11 event, we apply relevant tags to begin associating aspects of contextual information related to our target, as seen in Figure 11.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture12.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 11: MISP Event setup for FIN11\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWe then select “Add Attribute” into our event, which will allow us to import our MD5 hashes into the MISP galaxy, as seen in Figure 12. Using both the category and type, we select the appropriate values that best represent our dataset and prepare to submit that data into our event.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture13.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 12: MISP import events into FIN11 event\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EMISP allows for a streamlined way to drill and tag indicators as well as enrich and pivot with threat intelligence. We can also choose to perform this enrichment process within MISP using a variety of open intelligence sources and their modules, such as \u003Ca href=\u0022https:\/\/www.fireeye.com\/mandiant\/advantage.html\u0022\u003EMandiant Advantage\u003C\/a\u003E, \u003Ca href=\u0022http:\/\/passivetotal.com\/\u0022\u003EPassiveTotal\u003C\/a\u003E, Shodan and \u003Ca href=\u0022https:\/\/www.virustotal.com\/\u0022\u003EVirusTotal\u003C\/a\u003E. We can also achieve the same result using similar tools already packaged in ThreatPursuit VM.\u003C\/p\u003E\n\u003Cp\u003EUsing Maltego CE, installed as part of the VM, we can automate aspects of targeted collection and analysis of our FIN11 malware families and associated infrastructure. The following are just some of the Maltego plugins that can be configured post installation to help with the enrichment and collection process:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/developers.virustotal.com\/v3.0\/reference\u0022\u003EVirusTotal Public API\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/github.com\/AlienVault-OTX\/ApiV2\u0022\u003EThreatCrowd\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/developer.shodan.io\/api\u0022\u003EShodan API\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003ETargeting the suspected payload, we attempt to pivot using its MD5 hash value (113dd1e3caa47b5a6438069b15127707) to discover additional artifacts, such as infrastructure, domain record history, previously triaged reports, similar malware samples, timestamps, and the rich headers.\u003C\/p\u003E\n\u003Cp\u003EImporting our hash\u0026nbsp;into Maltego CE, we can proceed to perform a range of queries to hunt and retrieve interesting information related to our FIN11 malware, as seen in Figure 13.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/figure15a.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 13: Maltego CE querying MD5 hash\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EQuite quickly we pull back indicators; in this case, generic named detection signatures from a range of anti-malware vendors. Using VirusTotalAPI Public, we perform a series of collection and triage queries across a variety of configured open sources, as shown in Figure 14.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture16.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 14: Automating enrichment and analysis of targeted infrastructure\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EA \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www.virustotal.com\/graph\/embed\/ga379f635a7fc4ea283b95be43fe12ad71c83f82543044735a883e21e8a16296e\u0022\u003Evisual link has been made public\u003C\/a\u003E for quick reference.\u0026nbsp;\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003EWith our newly identified information obtained by passively scraping those IOCs from a variety of data providers, we can identify additional hashes, delivery URLs and web command and control locations, as shown in Figure 15.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture17.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 15: Maltego visualization of FIN11 dropper\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EPivoting on the suspected FIN11 delivery domain near-fast[.]com, we have found several more samples that were uploaded to an online malware sandbox website \u003Ca href=\u0022https:\/\/app.any.run\/\u0022\u003EAppAnyRun\u003C\/a\u003E. Within the ThreatPursuit VM Google Chrome browser and in the Tools directory, there are shortcuts and bookmarks to a range of sandboxes to help with accessing and searching them quickly. We can use \u003Ca href=\u0022https:\/\/app.any.run\/\u0022\u003EAppAnyRun\u003C\/a\u003E to further analyze the heterogenous networks and execution behaviors of these acquired samples.\u003C\/p\u003E\n\u003Cp\u003EWe have identified another similar sample, which is an XLS document named “MONITIORING REPORT.xls” with the MD5 hash 5d7d2371668ad4a6484f76b0b6511961 (Figure 16). Let’s attempt to triage this newly discovered sample and qualify the relationship back to FIN11.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/figure19b.png\u0022 alt=\u0022\u0022\u003E\u003Cspan class=\u0022type-XS\u0022\u003E\u003Cbr\u003E\nFigure 16: VirusTotal execution report of 5d7d2371668ad4a6484f76b0b6511961\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EExtracting interesting strings and indicators from this sample allows us to compare these artifacts against our own dynamic analysis. If we can’t access the original malware sample, but we have other indicators to hunt with, we could also pivot on various unique characteristics and attributes (e.g., imphash, vthash, pdb string, etc...) to discover related samples.\u003C\/p\u003E\n\u003Cp\u003EEven without access to the sample, we can also use YARA to mine for similar malware samples. One such source to mine is using the \u003Ca href=\u0022http:\/\/mquery.net\/\u0022\u003Emquery\u003C\/a\u003E tool and their datasets offered via CERT.PL. To fast track the creation of a YARA rule, we leverage the FIN11 YARA rule provided within the \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/advantage.mandiant.com\/reports\/20-00011864\u0022\u003EFIN11 Mandiant Advantage report\u003C\/a\u003E. Simply copy and paste the YARA rule into mquery page and select “Query” to perform the search (Figure 17). It may take some time, so be sure to check back later (here are the \u003Ca adhocenable=\u0022false\u0022 href=\u0022http:\/\/mquery.net\/query\/4SVL0NIHJH6B\u0022\u003Eresults\u003C\/a\u003E).\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture20.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 17: mquery YARA rule hunting search for FIN11 malware\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWithin our mquery search, we find a generic signature hit on Win32_Spoonbeard_1_beta for the MD5 hash 3c43d080b5badfdde7aff732c066d1b2. We associate this MD5 hash with another sandbox, app.any.run, at the following URL:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003Ehttps:\/\/app.any.run\/tasks\/19ac204b-9381-4127-a5ac-d6b68e0ee92c\/\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EAs seen in Figure 18, this sample was first uploaded on May 2, 2019, with an associated infection chain intact.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture21.png\u0022 alt=\u0022\u0022\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cspan class=\u0022type-XS\u0022\u003EFigure 18: AppAnyRun Execution Report on 3c43d080b5badfdde7aff732c066d1b2\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EWe now have a confident signature hit, but with different named detections on the malware family. This is a common challenge for threat analysts and researchers. However we have gained interesting information about the malware itself such as its execution behavior, encryption methods, dropped files, timelines and command and control server and beacon information. This is more than enough for us to pivot across our own datasets to hunt for previously seen activities and prepare to finalize our report.\u003C\/p\u003E\n\u003Cp\u003EOnce we are confident in our analysis, we can start to model and attribute the malware characteristics. We can leverage other threat exchange communities and intelligence sources to further enrich the information we collected on the sample. Enrichment allows the analysts to greater extrapolate context such as timings, malware similarity, associated infrastructures, and prior targeting information. We will briefly add our content into our MISP instance and apply tags to finalize our review.\u003C\/p\u003E\n\u003Cp\u003EWe may wish to add MITRE ATT\u0026amp;CK tags (Figure 19) relevant across the malware infection chain for our sample as they could be useful from a modelling standpoint.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/threatpursuit\/picture22.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 19: MITRE ATT\u0026amp;CK tags for the malware sample\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EFinal Thoughts\u003C\/h4\u003E\n\u003Cp\u003EWe hope you enjoyed this basic malware triage workflow use-case using ThreatPursuit VM. There are so many more tools and capabilities within the included toolset such as Machine learning (ML) and ML algorithms, that also assist threat hunters by analyzing large volumes of data quickly. Check out some of FireEye’s ML blog posts here.\u003C\/p\u003E\n\u003Cp\u003EFor a complete list of tools please see the \u003Ca href=\u0022https:\/\/github.com\/fireeye\/ThreatPursuit-VM\u0022\u003EThreatPursuit VM GitHub repository\u003C\/a\u003E. We look forward to releasing more blog posts, content and playbooks as our user base grows.\u003C\/p\u003E\n\u003Cp\u003EAnd finally, here are some related articles that might be of interest.\u003C\/p\u003E\n\u003Ch4\u003EMalware Analysis\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/09\/open-sourcing-stringsifter.html\u0022 adhocenable=\u0022false\u0022\u003EOpen Sourcing StringSifter\u003C\/a\u003E\u003Cu\u003E\u003C\/u\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/07\/capa-automatically-identify-malware-capabilities.html\u0022 adhocenable=\u0022false\u0022\u003Ecapa: Automatically Identify Malware Capabilities\u003C\/a\u003E\u003Cu\u003E\u003C\/u\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/05\/learning-to-rank-strings-output-for-speedier-malware-analysis.html\u0022 adhocenable=\u0022false\u0022\u003ELearning to Rank Strings Output for Speedier Malware Analysis\u003C\/a\u003E\u003Cu\u003E\u003C\/u\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/05\/analyzing-dark-crystal-rat-backdoor.html\u0022\u003EAnalyzing Dark Crystal RAT, a C# Backdoor\u003C\/a\u003E\u003Cu\u003E\u003C\/u\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/05\/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html\u0022\u003ENavigating the Maze:\u0026nbsp;Tactics, Techniques and Procedures Associated With MAZE Ransomware Incidents\u003C\/a\u003E\u003Cu\u003E\u003C\/u\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EDigital Forensics\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/05\/using-real-time-events-in-investigations.html\u0022 adhocenable=\u0022false\u0022\u003EUsing Real-Time Events in Investigations\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/09\/dfur-ent-perspective-on-threat-modeling-and-application-log-forensic-analysis.html\u0022 adhocenable=\u0022false\u0022\u003EA \u0026quot;DFUR-ent\u0026quot; Perspective on Threat Modeling and Application Log Forensic Analysis\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/07\/scandalous-external-detection-using-network-scan-data-and-automation.html\u0022 adhocenable=\u0022false\u0022\u003ESCANdalous! (External Detection Using Network Scan Data and Automation)\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EIntelligence Analysis and Assessments\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/02\/managed-defense-the-analytical-mindset.html\u0022 adhocenable=\u0022false\u0022\u003EManaged Defense: The Analytical Mindset\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/executive-perspective\/2020\/08\/strategic-intelligence-helps-organizations-make-sense-of-threat-landscape.html\u0022 adhocenable=\u0022false\u0022\u003EHow Strategic Intelligence Helps Organizations Make Sense of the Threat Landscape\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/limited-shifts-in-cyber-threat-landscape-driven-by-covid-19.html\u0022 adhocenable=\u0022false\u0022\u003ELimited Shifts in the Cyber Threat Landscape Driven by COVID-19\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/03\/they-come-in-the-night-ransomware-deployment-trends.html\u0022 adhocenable=\u0022false\u0022\u003EThey Come in the Night: Ransomware Deployment Trends\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n",
        "jcr:lastModified": "Tue Oct 27 2020 23:32:18 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EThreatPursuit VM is a fully customizable, open-sourced Windows-based distribution focused on threat intelligence analysis and hunting.\u003C\/p\u003E\n",
      "jcr:lastModified": "Tue Oct 27 2020 21:44:07 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Wed Oct 28 2020 15:34:35 GMT+0000",
      "imageRotate": "0"
    }
  }
}
