{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Mon Nov 23 2020 01:25:33 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Election Cyber Threats in the Asia-Pacific Region",
    "jcr:versionHistory": "fc10d934-d0aa-4016-a39d-3123f03f1ee8",
    "author": "Yihao Lim",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "97f95f19-21af-43ae-85de-6d9db150c18c"
    ],
    "jcr:created": "Mon Nov 23 2020 01:25:33 GMT+0000",
    "cq:lastModified": "Mon Nov 23 2020 00:52:56 GMT+0000",
    "jcr:baseVersion": "97f95f19-21af-43ae-85de-6d9db150c18c",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:yihao-lim",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:asia-pacific",
      "fireeye-blog-tags:elections",
      "fireeye-blog-tags:china",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:threat-intelligence"
    ],
    "jcr:uuid": "2a70f4fd-b235-4ca0-a15c-33d443156c12",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Sun Nov 22 2020 18:00:00 GMT-0500",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003EIn democratic societies, elections are the mechanism for choosing heads of state and policymakers. There are strong incentives for adversary nations to understand the intentions and preferences of the people and parties that will shape a country\u0027s future path and to reduce uncertainty about likely winners. Mandiant \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/mandiant\/threat-intelligence.html\u0022\u003EThreat Intelligence\u003C\/a\u003E regularly observes cyber espionage operations we believe to be seeking election-related information targeting governments, civil society, media, and technology organizations around the globe. We have also seen disruptive and destructive cyber attacks and propaganda campaigns seeking to undermine targeted governments and influence the outcomes of electoral contests.\u003C\/p\u003E\n\u003Cp\u003EThe 2020 U.S. elections are currently drawing attention to election cyber risks, but 2020 has already hosted dozens of elections worldwide, with more to come. In the Asia-Pacific region these included elections in Taiwan, India, South Korea, and Singapore to name a few, with regional elections scheduled for Indonesia in December.\u003C\/p\u003E\n\u003Cp\u003EGiven the prevalence of such activity worldwide and Mandiant\u0027s unique visibility into threat actor activity, we believe it is worthwhile to examine trends in adversary targeting of elections in a variety of regional contexts because the tactics, techniques, and procedures (TTPs) used in one region today may soon be deployed or mimicked in other regions.\u003C\/p\u003E\n\u003Ch4\u003ENotable Electoral Targeting in Asia-Pacific Region\u003C\/h4\u003E\n\u003Cp\u003EMandiant Threat Intelligence tracked numerous elections-related incidents in the Asia-Pacific region in recent years. During this time, the most prolific regional actor was China, which we observed in more than 20 elections-related campaigns most frequently affecting Hong Kong and Taiwan. We believe that China\u0027s primary motives for elections targeting includes monitoring political developments, internal stability, and supporting Belt and Road Initiative (BRI) investments.\u003C\/p\u003E\n\u003Cp\u003EExamples of Chinese cyber espionage targeting electoral support organizations include:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003ETargeting candidates and related staff associated with the November 2019 Hong Kong District Council elections with a malicious macro document.\u003C\/li\u003E\n\u003Cli\u003ETargeting the Australian Parliament in February 2019, three months before the country\u0027s general elections.\u003C\/li\u003E\n\u003Cli\u003ECompromising Cambodia\u0027s National Election Commission in mid-2018 based on the use of AIRBREAK malware by APT40, possibly looking to understand the impact of the election outcome on Belt and Road Initiative (BRI) plans. See our \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2018\/07\/chinese-espionage-group-targets-cambodia-ahead-of-elections.html\u0022\u003Eblog post\u003C\/a\u003E\u0026nbsp;for more details about this campaign.\u003C\/li\u003E\n\u003Cli\u003EA spear phishing campaign targeting multiple government agencies in Southeast Asia in the spring of 2018 to deliver FIREPIT payloads. The nature of the lure material and targeting indicate the activity was potentially an effort to monitor an upcoming election in the affected country.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003ESpecifically, Mandiant has observed multiple instances in which organizations such as electoral boards and commissions that support or help administer elections have been targeted. Both Russian and Chinese cyber espionage operations have targeted election administrators and government officials since at least 2014. Observed TTPs include phishing and strategic website compromise (SWC), also known as watering hole attacks.\u003C\/p\u003E\n\u003Cp\u003EFor example, in the November 2019 activity targeting Hong Kong (previously referenced), Mandiant Threat Intelligence believes that candidates or related staff associated with the Hong Kong District Council elections were targeted with a malicious macro document just prior to the elections based on geolocation information, the spear-phishing lure, and other data.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/asia-pacific-election-threats\/picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Decoy content from phishing email\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EElections Ecosystem\u003C\/h4\u003E\n\u003Cp\u003EAs our readers will know, Mandiant takes a specific approach to deconstructing attacks against elections, which we detailed in a \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2019\/05\/framing-the-problem-cyber-threats-and-elections.html\u0022\u003Eprevious blog post\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003EOur approach examines threats through the lens of risk posed at various levels of the elections ecosystem. We break the elections threat landscape into distinct attack surfaces to better allow our customers and partners to take action. These include the following:\u003C\/p\u003E\n\u003Cul\u003E\n\u003Cli\u003EElectoral Platforms Affecting Public Opinion\u003C\/li\u003E\n\u003Cli\u003EElectoral Process Support Organizations\u003C\/li\u003E\n\u003Cli\u003ECore Electoral Process Systems\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/asia-pacific-election-threats\/picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Attack surfaces associated with the electoral process\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ETop Target of Election Cyber Threat Activity: Public Opinion\u003C\/h4\u003E\n\u003Cp\u003EUsing our ecosystem taxonomy, based on activity observed from 2016 to 2019, Mandiant Threat Intelligence assesses that actors concentrated on \u0026quot;platforms affecting public opinion\u0026quot; much more often than \u0026quot;core election systems\u0026quot; such as voting machines, or \u0026quot;electoral support organizations\u0026quot; such as election commissions.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/asia-pacific-election-threats\/picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Electoral platforms affecting public opinions are most frequently targeted\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EGlobally, we assess that actors continue to deploy disinformation in the form of fabricated news and hoaxes spread primarily via social media and counterfeit websites designed to mimic legitimate news organizations, which may be picked up by legitimate news organizations. In the last several years, we have seen influence operations use increasingly creative methods to blend their inauthentic messaging with legitimate speech (e.g., by interviewing, impersonating, and hiring legitimate journalists or experts, and sending letters to the editor to real publications).\u003C\/p\u003E\n\u003Cp\u003EMalicious actors create and spread disinformation with the intent to mislead an electorate by causing reputational damage to an individual or political party, or by casting doubt regarding a particular issue or political process. Influence campaigns also seek to exacerbate existing societal divisions.\u003C\/p\u003E\n\u003Cp\u003EIn the Asia-Pacific region, Mandiant Threat Intelligence observed pro-China threat actors spoof Taiwanese media outlet TVBS (官方網站) to promote narratives in line with the People\u0027s Republic of China\u0027s (PRC\u0027s) political interests in a coordinated, inauthentic manner.\u0026nbsp;The accounts use a variety of tactics in order to pose as Western media outlets, including the use of identical or near-identical usernames, display names, and profile photos as the accounts of the outlets they imitate.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/asia-pacific-election-threats\/picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: @TVSBnews quote-tweets People\u0027s Daily video citing alleged U.S. interference in foreign elections\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EPublic exposure of high-profile information operations, such as Russia\u0027s interference in the 2016 U.S. presidential election, has strengthened perceptions that such operations are effective. It also demonstrates the difficulty that open societies face in countering this threat, encouraging current and aspiring information operation sponsors to grow their efforts. We anticipate that influence operations conducted in support of the political interests of nation-states will increase in sophistication, volume, and diversity of actors through 2020 and beyond.\u003C\/p\u003E\n\u003Cp\u003EIn the last 12 months, Mandiant Threat Intelligence observed and reported on information operations conducted in support of the political interests of numerous countries. During Singapore\u0027s 2020 general elections, the country\u0027s first \u0026quot;digital\u0026quot; election, Mandiant Threat Intelligence identified multiple inauthentic accounts. These accounts did not, however, appear to be acting in a coordinated manner.\u003C\/p\u003E\n\u003Ch4\u003EOutlook and Implications\u003C\/h4\u003E\n\u003Cp\u003EWe expect that threat actors will continue to target entities associated with elections worldwide for the foreseeable future and may expand the scope of this activity as long as the potential rewards of these operations outweigh the risks.\u0026nbsp;State-sponsored actors almost certainly view targeting the electoral process as an effective means of projecting power and collecting intelligence.\u003C\/p\u003E\n\u003Cp\u003EFurthermore, the continuous expansion of the social media landscape will likely encourage various actors to pursue information operations by promoting preferred narratives, including the use of propagating inauthentic or deceptive information. We have already seen tactics evolve to avoid detection and incorporate emerging technologies, such as \u0026quot;deepfake\u0026quot; or multimedia manipulation technology, to advance more believable and impactful information operations, and we expect these innovations to continue. Lower tech methods, such as outsourcing propaganda activities to real people hired specifically to spread false and misleading content, can hinder attribution efforts and potentially increase the effectiveness of operations if those people have a more specialized understanding of the information environment.\u003C\/p\u003E\n\u003Cp\u003ETo battle election threats, there is an urgent need to increase public awareness of the threat and inculcate behaviors that reduce the risk of compromise or disruption. These include everything from rigorously securing email to implementing policy around notification of cyber incidents in the supply chain. In addition, governments can consider mandating digital imprint requirements for election campaigning, increasing fines for electoral fraud, and increasing transparency around digital political advertisements. Investment in news verification and screening methodologies on search and social media platforms as well as public education efforts equipping voters and students to distinguish trustworthy information from suspicions may also reduce the impact of influence operations.\u003C\/p\u003E\n",
        "jcr:lastModified": "Mon Nov 23 2020 00:49:29 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EMandiant Threat Intelligence tracked numerous elections-related incidents in the Asia-Pacific region in recent years.\u003C\/p\u003E\n",
      "jcr:lastModified": "Mon Nov 23 2020 00:51:02 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon Nov 23 2020 00:52:56 GMT+0000",
      "imageRotate": "0"
    }
  }
}
