{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "fireeye_global_admin",
  "jcr:created": "Mon Apr 27 2020 12:30:47 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "fireeye_global_admin",
    "jcr:title": "Putting the Model to Work: Enabling Defenders With Vulnerability Intelligence — Intelligence for Vulnerability Management, Part Four",
    "jcr:versionHistory": "8917064e-1979-4fed-ab37-a0957f8a03bb",
    "author": "Katie Bowen",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "a50e8b9d-047f-46c7-88d6-c1afe1786e6d"
    ],
    "jcr:created": "Mon Apr 27 2020 15:04:46 GMT+0000",
    "cq:lastModified": "Mon Apr 27 2020 15:04:37 GMT+0000",
    "jcr:baseVersion": "a50e8b9d-047f-46c7-88d6-c1afe1786e6d",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-authors:katie-bowen",
      "fireeye-blog-authors:stu-reynolds",
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:vulnerabilities",
      "fireeye-blog-tags:threat-intelligence",
      "fireeye-blog-tags:patches"
    ],
    "jcr:uuid": "c6d5bedf-0a3f-483c-b07d-f299b678fa61",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Mon Apr 27 2020 08:30:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Cp\u003E\u003Ci\u003EOne of the critical strategic and tactical roles that cyber threat intelligence (CTI) plays is in the tracking, analysis, and prioritization of software vulnerabilities that could potentially put an organization’s data, employees and customers at risk. In this four-part blog series, FireEye Mandiant Threat Intelligence highlights the value of CTI in enabling vulnerability management, and unveils new research into the latest threats, trends and recommendations.\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EOrganizations often have to make difficult choices when it comes to patch prioritization. Many are faced with securing complex network infrastructure with thousands of systems, different operating systems, and disparate geographical locations. Even when armed with a simplified \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/how-mandiant-intelligence-rates-vulnerabilities.html\u0022 adhocenable=\u0022false\u0022\u003Evulnerability rating system\u003C\/a\u003E, it can be hard to know where to start. This problem is compounded by the ever-changing threat landscape and \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/zero-day-exploitation-demonstrates-access-to-money-not-skill.html\u0022 adhocenable=\u0022false\u0022\u003Eincreased access to zero-days\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003EAt FireEye, we apply the rich body of knowledge accumulated over years of global intelligence collection, incident response investigations, and device detections, to help our customers defend their networks. This understanding helps us to discern between hundreds of newly disclosed vulnerabilities to provide ratings and assessments that empower network defenders to focus on the most significant threats and effectively mitigate risk to their organizations.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003EIn this blog post, we’ll demonstrate how we apply intelligence to help organizations assess risk and make informed decisions about vulnerability management and patching in their environments.\u003C\/p\u003E\n\u003Ch4\u003EFunctions of Vulnerability Intelligence\u003C\/h4\u003E\n\u003Cp\u003EVulnerability intelligence helps clients to protect their organizations, assets, and users in three main ways:\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnintel\/Picture1.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 1: Vulnerability intelligence can help with risk assessment and informed decision making\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003ETailoring Vulnerability Prioritization\u003C\/h4\u003E\n\u003Cp\u003EWe believe it is important for organizations to build a defensive strategy that prioritizes the types of threats that are most likely to impact their environment, and the threats that could cause the most damage. When organizations have a clear picture of the spectrum of threat actors, malware families, campaigns, and tactics that are most relevant to their organization, they can make more nuanced prioritization decisions when those threats are linked to exploitation of vulnerabilities. A lower risk vulnerability that is actively being exploited in the wild against your organization or similar organizations likely has a greater potential impact to you than a vulnerability with a higher rating that is not actively being exploited.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnintel\/Picture2.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 2: Patch Prioritization Philosophy\u003C\/span\u003E\u003C\/p\u003E\n\u003Ch4\u003EIntegration of Vulnerability Intelligence in Internal Workflows\u003C\/h4\u003E\n\u003Cp\u003EBased on our experience assisting organizations globally with enacting intelligence-led security, we outline three use cases for integrating vulnerability intelligence into internal workflows.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnintel\/Picture3.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 3: Integration of vulnerability intelligence into internal workflows\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003ETools and Use Cases for Operationalizing Vulnerability Intelligence\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003E1. Automate Processes by Fusing Intelligence with Internal Data\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAutomation is valuable to security teams with limited resources.\u0026nbsp;Similar to\u0026nbsp;automated detecting and blocking of indicator data, vulnerability threat intelligence can be automated by merging data from internal vulnerability scans with threat intelligence (via systems like the Mandiant \u003Ca href=\u0022https:\/\/www.fireeye.com\/solutions\/cyber-threat-intelligence\/threat-intelligence-subscriptions\/intelligence-api.html\u0022\u003EIntelligence API\u003C\/a\u003E) and\u0026nbsp;aggregated\u0026nbsp;into\u0026nbsp;a SIEM, Threat Intelligence Platform, and\/or ticketing system. This enhances visibility into various sources of both internal and external data with vulnerability intelligence providing risk ratings and indicating which\u0026nbsp;vulnerabilities\u0026nbsp;are being actively exploited. FireEye also offers a custom tool called FireEye Intelligence Vulnerability Explorer (“FIVE”), described in more detail below for quickly correlating vulnerabilities found in logs and scans with Mandiant ratings.\u003C\/p\u003E\n\u003Cp\u003ESecurity teams can similarly automate communication and workflow tracking processes using threat intelligence by defining rules for auto-generating tickets based on certain combinations of Mandiant risk and exploitation ratings; for example, internal\u0026nbsp;service-level-agreements (SLAs)\u0026nbsp;could state that ‘high’ risk vulnerabilities\u0026nbsp;that have an exploitation rating of ‘available,’ ‘confirmed,’ or ‘wide’ must be patched within a set number of\u0026nbsp;days. Of course,\u0026nbsp;the SLA will depend on the company’s operational needs, the capability of the team that is advising the patch process, and executive buy-in to the SLA process.\u0026nbsp;Similarly, there may be an SLA defined for patching vulnerabilities that are of a certain age.\u0026nbsp;Threat intelligence tells us that adversaries continue to use older vulnerabilities as long as they remain effective. For example, as recently as January 2020, we observed a Chinese cyber espionage group use an exploit for CVE-2012-0158, a Microsoft Office stack-based buffer overflow vulnerability originally released in 2012, in malicious email attachments to target organizations in Southeast Asia.\u0026nbsp;Automating the\u0026nbsp;vulnerability-scan-to-vulnerability-intelligence correlation\u0026nbsp;process can\u0026nbsp;help bring this type of issue to light.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003EAnother potential use case employing automation would be incorporating vulnerability intelligence as security teams are testing updates or new hardware and software prior to introduction into the production environment.\u0026nbsp;This could\u0026nbsp;dramatically reduce the number of vulnerabilities\u0026nbsp;that need to be patched in production and help prioritize those\u0026nbsp;vulnerabilities\u0026nbsp;that need to be patched first based on your organization’s unique threat profile and business operations.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003E2. Communicating with Internal Stakeholders\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ETeams can leverage vulnerability reporting to send internal messaging, such as flash-style notifications, to alert other teams when Mandiant rates a vulnerability known to impact your systems high or critical. These are the vulnerabilities that should take priority in patching and should be patched outside of the regular cycle.\u003C\/p\u003E\n\u003Cp\u003EData-informed intelligence analysis may help convince stakeholders outside of the security organization the importance of patching quickly, even when this is inconvenient to business operations. Threat Intelligence can inform an organization’s appropriate use of resources for security given the potential business impact of security incidents.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003E3. Threat Modeling\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EOrganizations can leverage vulnerability threat intelligence to inform their threat modeling to gain insight into the most likely threats to their organization, and better prepare to address threats in the mid to long term. Knowledge of which adversaries pose the greatest threat to your organization, and then knowledge of which vulnerabilities those threat groups are exploiting in their operations, can enable your organization to build out security controls and monitoring based on those specific CVEs.\u003C\/p\u003E\n\u003Ch4\u003EExamples\u003C\/h4\u003E\n\u003Cp\u003EThe following examples illustrate workflows supported by vulnerability threat intelligence to demonstrate how organizations can operationalize threat intelligence in their existing security teams to automate processes and increase efficiency given limited resources.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EExample 1: Using FIVE for Ad-hoc Vulnerability Prioritization\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EThe FireEye Intelligence Vulnerability Explorer (“FIVE”) tool is available for customers \u003Ca href=\u0022https:\/\/fireeye.market\/apps?query=five\u0022\u003Ehere\u003C\/a\u003E. It is available for MacOS and Windows, requires a valid subscription for Mandiant Vulnerability Intelligence, and is driven from an API integration.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnintel\/Picture4.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 4: FIVE Tool for Windows and MacOS\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EIn this scenario, an organization’s intelligence team was asked to quickly identify any vulnerability that required patching from a server vulnerability scan after that server was rebuilt from a backup image. The intelligence team was presented with a text file containing a list of CVE numbers. Users can drag-and-drop a text readable file (CSV, TEXT, JSON, etc.) into the FIVE tool and the CVE numbers will be discovered from the file using regex. As shown in Figure 6 (below), in this example, the following vulnerabilities were found in the file and presented to the user.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnintel\/Picture5.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 5: FIVE tool startup screen waiting for file input\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnintel\/Picture6.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 6: FIVE tool after successfully regexing the CVE-IDs from the file\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EAfter selecting all CVE-IDs, the user clicked the “Fetch Vulnerabilities” button, causing the application to make the necessary two-stage API call to the Intelligence API.\u003C\/p\u003E\n\u003Cp\u003EThe output depicted in Figure 7 shows the user which vulnerabilities should be prioritized based on FireEye’s risk and exploitation ratings. The red and maroon boxes indicate vulnerabilities that require attention, while the yellow indicate vulnerabilities that should be reviewed for possible action. Details of the vulnerabilities are displayed below, with associated intelligence report links providing further context.\u003C\/p\u003E\n\u003Cp\u003E\u003Cimg src=\u0022\/content\/dam\/fireeye-www\/blog\/images\/vulnintel\/Picture7.png\u0022 alt=\u0022\u0022\u003E\u003Cbr\u003E\n\u003Cspan class=\u0022type-XS\u0022\u003EFigure 7: FIVE tool with meta-data, CVE-IDs, and links to related Intelligence Reports\u003C\/span\u003E\u003C\/p\u003E\n\u003Cp\u003EFIVE can also facilitate other use cases for vulnerability intelligence. For example, this chart can be attached in messaging to other internal stakeholders or executives for review, as part of a status update to provide visibility on the organization’s vulnerability management program.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EExample 2: Vulnerability Prioritization, Internal Communications, Threat Modeling\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003ECVE-2019-19781 is a vulnerability affecting Citrix that Mandiant Threat Intelligence rated critical. Mandiant discussed early \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/products-and-services\/2020\/01\/rough-patch-promise-it-will-be-200-ok.html\u0022\u003Eexploitation of this vulnerability\u003C\/a\u003E in a January 2020 blog post. We continued to monitor for additional exploitation, and informed our clients when we observed exploitation by ransomware operators and Chinese espionage group, \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/03\/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html\u0022 adhocenable=\u0022false\u0022\u003EAPT41\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003EIn cases like these, threat intelligence can help impacted organizations find the “signal” in the “noise” and prioritize patching using knowledge of exploitation and the motives and targeting patterns of threat actors behind the exploitation. Enterprises can use intelligence to inform internal stakeholders of the potential risk and provide context as to the potential business and financial impact of a ransomware infection or an intrusion by a highly resourced state sponsored group. This support the immediate patch prioritization decision while simultaneously emphasizing the value of a holistically informed security organization.\u003C\/p\u003E\n\u003Cp\u003E\u003Ci\u003EExample 3: Intelligence Reduces Unnecessary Resource Expenditure — Automating Vulnerability Prioritization and Communications\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003EAnother common application for vulnerability intelligence is informing security teams and stakeholders when to stand down. When a vulnerability is reported in the media, organizations often spin up resources to patch as quickly as possible. Leveraging threat intelligence in security processes help an organization discern when it is necessary to respond in an all-hands-on-deck manner.\u003C\/p\u003E\n\u003Cp\u003ETake the case of the \u003Ca href=\u0022https:\/\/cve.mitre.org\/cgi-bin\/cvename.cgi?name=CVE-2019-12650\u0022\u003ECVE-2019-12650\u003C\/a\u003E, originally disclosed on Sept. 25, 2019 with an NVD rating of “High.” Without further information, an organization relying on this score to determine prioritization may include this vulnerability in the same patch cycle along with numerous other vulnerabilities rated High or Critical. As previously discussed, we have experts \u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/how-mandiant-intelligence-rates-vulnerabilities.html\u0022\u003Ereview the vulnerability and determine\u003C\/a\u003E that it required the highest level of privileges available to successfully exploit, and there was no evidence of exploitation in the wild.\u003C\/p\u003E\n\u003Cp\u003EThis is a case where threat intelligence reporting as well as automation can effectively minimize the need to unnecessarily spin up resources. Although the public NVD score rated this vulnerability high, Mandiant Intelligence rated it as “low” risk due to the high level of privileges needed to use it and lack of exploitation in the wild. Based on this assessment, organizations may decide that this vulnerability could be patched in the regular cycle and does not necessitate use of additional resources to patch out-of-band. When Mandiant ratings are automatically integrated into the patching ticket generation process, this can support efficient prioritization. Furthermore, an organization could use the analysis to issue an internal communication informing stakeholders of the reasoning behind lowering the prioritization.\u003C\/p\u003E\n\u003Ch4\u003EVulnerabilities: Managed\u003C\/h4\u003E\n\u003Cp\u003EBecause we have been closely monitoring vulnerability exploitation trends for years, we were\u0026nbsp;able to distinguish when attacker use of \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/zero-day-exploitation-demonstrates-access-to-money-not-skill.html\u0022 adhocenable=\u0022false\u0022\u003Ezero-days\u003C\/a\u003E evolved from use by a select class\u0026nbsp;of highly skilled attackers, to becoming accessible to less skilled groups with enough money to burn. Our observations consistently underscore the \u003Ca href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/time-between-disclosure-patch-release-and-vulnerability-exploitation.html\u0022 adhocenable=\u0022false\u0022\u003Espeed\u003C\/a\u003E with which attackers exploit useful vulnerabilities, and the lack of exploitation for vulnerabilities that are hard to use or do not help attackers fulfill their objectives.\u0026nbsp;Our understanding of the threat landscape helps us to discern between hundreds of newly disclosed vulnerabilities to provide ratings and assessments that empower network defenders to focus on the most significant threats and effectively mitigate risk to their organizations.\u003C\/p\u003E\n\u003Cp\u003EMandiant Threat Intelligence enables organizations to implement a defense-in-depth approach to holistically mitigate risk by taking all feasible steps—not just patching—to prevent, detect, and stymie attackers at every stage of the attack lifecycle with both technology and human solutions.\u003C\/p\u003E\n\u003Cp\u003ERegister today\u0026nbsp;to hear FireEye Mandiant Threat Intelligence experts discuss the latest in\u0026nbsp;\u003Ca href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/392772\u0022\u003Evulnerability threats, trends and recommendations\u003C\/a\u003E\u0026nbsp;in our upcoming April 30 webinar.\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EAdditional Resources\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/zero-day-exploitation-demonstrates-access-to-money-not-skill.html\u0022\u003EZero-Day Exploitation Increasingly Demonstrates Access to Money, Rather than Skill — Intelligence for Vulnerability Management, Part One\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/time-between-disclosure-patch-release-and-vulnerability-exploitation.html\u0022\u003EThink Fast: Time Between Disclosure, Patch Release and Vulnerability Exploitation — Intelligence for Vulnerability Management, Part Two\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Ca adhocenable=\u0022false\u0022 href=\u0022\/content\/fireeye-www\/en_US\/blog\/threat-research\/2020\/04\/how-mandiant-intelligence-rates-vulnerabilities.html\u0022\u003ESeparating the Signal from the Noise: How Mandiant Intelligence Rates Vulnerabilities — Intelligence for Vulnerability Management, Part Three\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003EMandiant offers \u003Ca href=\u0022https:\/\/www.fireeye.com\/solutions\/cyber-threat-intelligence.html\u0022\u003EIntelligence Capability Development (ICD) services\u003C\/a\u003E to help organizations optimize their ability to consume, analyze and apply threat intelligence.\u003C\/p\u003E\n\u003Cp\u003EThe\u0026nbsp;\u003Ca href=\u0022https:\/\/fireeye.market\/apps?query=five\u0022\u003EFIVE tool is available on the FireEye Market\u003C\/a\u003E. It requires a valid subscription for Mandiant Vulnerability Intelligence, and is driven from an API integration. Please contact your Intelligence Enablement Manager or FireEye Support to obtain API keys.\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003EMandiant\u0027s OT Asset Vulnerability Assessment Service informs customers of relevant vulnerabilities by matching\u0026nbsp;a customer\u0027s asset list against\u0026nbsp;vulnerabilities and advisories. Relevant vulnerabilities and advisories are delivered in\u0026nbsp;a report\u0026nbsp;from as little as once a year, to as often as once a\u0026nbsp;week. Additional add-on services such as asset inventory development and\u0026nbsp;deep dive analysis of critical assets are available. Please contact your Intelligence Enablement Manager for more information.\u003C\/p\u003E\n",
        "jcr:lastModified": "Sun Apr 26 2020 23:44:51 GMT+0000",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003EWe demonstrate how we apply intelligence to help organizations assess risk and make informed decisions about vulnerability management and patching.\u003C\/p\u003E\n",
      "jcr:lastModified": "Sun Apr 26 2020 22:45:30 GMT+0000",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon Apr 27 2020 15:04:37 GMT+0000",
      "imageRotate": "0"
    }
  }
}
