{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Fri Mar 16 2018 00:00:22 GMT-0400",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Suspected Chinese Cyber Espionage Group (TEMP.Periscope) Targeting U.S. Engineering and Maritime Industries",
    "cq:lastReplicationAction": "Activate",
    "jcr:versionHistory": "15dffd01-c168-467b-8bbf-61feaf9c59f0",
    "author": "FireEye",
    "cq:template": "\/apps\/fireeye-blog\/templates\/page_blogpost",
    "cq:lastReplicatedBy": "adam.greenberg@fireeye.com",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "fb5b9f21-d2b0-4326-b205-cd6f044d4426"
    ],
    "jcr:created": "Fri Mar 16 2018 00:00:22 GMT-0400",
    "cq:lastReplicated": "Fri Mar 16 2018 00:00:17 GMT-0400",
    "cq:lastModified": "Thu Mar 15 2018 23:48:25 GMT-0400",
    "jcr:baseVersion": "fb5b9f21-d2b0-4326-b205-cd6f044d4426",
    "jcr:isCheckedOut": true,
    "cq:tags": [
      "fireeye-blog-threat-research:threat-research",
      "fireeye-blog-tags:china",
      "fireeye-blog-tags:homepage-carousel",
      "fireeye-blog-tags:latest",
      "fireeye-blog-tags:targeted-attacks",
      "fireeye-blog-authors:cap-fireeye"
    ],
    "jcr:uuid": "bfb5e4e3-72bd-4c3c-a199-1867daf66796",
    "sling:resourceType": "social\/blog\/components\/page",
    "published": "Fri Mar 16 2018 00:00:00 GMT-0400",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "entry": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "text": "\u003Ch4\u003EIntrusions Focus on the Engineering and Maritime Sector\u003C\/h4\u003E\n\u003Cp\u003ESince early 2018, FireEye (including our FireEye as a Service (FaaS), Mandiant Consulting, and iSIGHT Intelligence teams) has been tracking an ongoing wave of intrusions targeting engineering and maritime entities, especially those connected to South China Sea issues. The campaign is linked to a group of suspected Chinese cyber espionage actors we have tracked since 2013, dubbed TEMP.Periscope. The group has also been reported as “\u003Ca href=\u0022https:\/\/www.proofpoint.com\/us\/threat-insight\/post\/leviathan-espionage-actor-spearphishes-maritime-and-defense-targets\u0022\u003ELeviathan\u003C\/a\u003E” by other security firms. \u003C\/p\u003E\n\u003Cp\u003EThe current campaign is a sharp escalation of detected activity since summer 2017. Like multiple other Chinese cyber espionage actors, TEMP.Periscope has recently re-emerged and has been observed conducting operations with a revised toolkit. Known targets of this group have been involved in the maritime industry, as well as engineering-focused entities, and include research institutes, academic organizations, and private firms in the United States. FireEye products have robust detection for the malware used in this campaign.\u003C\/p\u003E\n\u003Ch4\u003ETEMP.Periscope Background\u003C\/h4\u003E\n\u003Cp\u003EActive since at least 2013, TEMP.Periscope has primarily focused on maritime-related targets across multiple verticals, including engineering firms, shipping and transportation, manufacturing, defense, government offices, and research universities. However, the group has also targeted professional\/consulting services, high-tech industry, healthcare, and media\/publishing. Identified victims were mostly found in the United States, although organizations in Europe and at least one in Hong Kong have also been affected. TEMP.Periscope overlaps in targeting, as well as tactics, techniques, and procedures (TTPs), with TEMP.Jumper, a group that also overlaps significantly with public reporting on “NanHaiShu.”\u003C\/p\u003E\n\u003Ch4\u003ETTPs and Malware Used\u003C\/h4\u003E\n\u003Cp\u003EIn their recent spike in activity, TEMP.Periscope has leveraged a relatively large library of malware shared with multiple other suspected Chinese groups. These tools include:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EAIRBREAK: a JavaScript-based backdoor also reported as “Orz” that retrieves commands from hidden strings in compromised webpages and actor controlled profiles on legitimate services.\u003C\/li\u003E\n\u003Cli\u003EBADFLICK: a backdoor that is capable of modifying the file system, generating a reverse shell, and modifying its command and control (C2) configuration.\u003C\/li\u003E\n\u003Cli\u003EPHOTO: a DLL backdoor also reported publicly as “Derusbi”, capable of obtaining directory, file, and drive listing; creating a reverse shell; performing screen captures; recording video and audio; listing, terminating, and creating processes; enumerating, starting, and deleting registry keys and values; logging keystrokes, returning usernames and passwords from protected storage; and renaming, deleting, copying, moving, reading, and writing to files.\u003C\/li\u003E\n\u003Cli\u003EHOMEFRY: a 64-bit Windows password dumper\/cracker that has previously been used in conjunction with AIRBREAK and BADFLICK backdoors. Some strings are obfuscated with XOR x56. The malware accepts up to two arguments at the command line: one to display cleartext credentials for each login session, and a second to display cleartext credentials, NTLM hashes, and malware version for each login session.\u003C\/li\u003E\n\u003Cli\u003ELUNCHMONEY: an uploader that can exfiltrate files to Dropbox.\u003C\/li\u003E\n\u003Cli\u003EMURKYTOP: a command-line reconnaissance tool. It can be used to execute files as a different user, move, and delete files locally, schedule remote AT jobs, perform host discovery on connected networks, scan for open ports on hosts in a connected network, and retrieve information about the OS, users, groups, and shares on remote hosts.\u003C\/li\u003E\n\u003Cli\u003EChina Chopper: a simple code injection webshell that executes Microsoft .NET code within HTTP POST commands. This allows the shell to upload and download files, execute applications with web server account permissions, list directory contents, access Active Directory, access databases, and any other action allowed by the .NET runtime.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EThe following are tools that TEMP.Periscope has leveraged in past operations and could use again, though these have not been seen in the current wave of activity:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003EBeacon: a backdoor that is commercially available as part of the Cobalt Strike software platform, commonly used for pen-testing network environments. The malware supports several capabilities, such as injecting and executing arbitrary code, uploading and downloading files, and executing shell commands.\u003C\/li\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/threat-research\/2015\/05\/hiding_in_plain_sigh.html\u0022\u003EBLACKCOFFEE\u003C\/a\u003E: a backdoor that obfuscates its communications as normal traffic to legitimate websites such as Github and Microsoft\u0026#39;s Technet portal. Used by \u003Ca adhocenable=\u0022false\u0022 href=\u0022https:\/\/www2.fireeye.com\/WEB-2015RPTAPT17.html\u0022\u003EAPT17\u003C\/a\u003E and other Chinese cyber espionage operators.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Cp\u003EAdditional identifying TTPs include:\u003C\/p\u003E\n\u003Cul style=\u0022list-style-position: inside;\u0022\u003E\n\u003Cli\u003ESpear phishing, including the use of probably compromised email accounts.\u003C\/li\u003E\n\u003Cli\u003ELure documents using CVE-2017-11882 to drop malware.\u003C\/li\u003E\n\u003Cli\u003EStolen code signing certificates used to sign malware.\u003C\/li\u003E\n\u003Cli\u003EUse of bitsadmin.exe to download additional tools.\u003C\/li\u003E\n\u003Cli\u003EUse of PowerShell to download additional tools.\u003C\/li\u003E\n\u003Cli\u003EUsing C:\\Windows\\Debug and C:\\Perflogs as staging directories.\u003C\/li\u003E\n\u003Cli\u003ELeveraging Hyperhost VPS and Proton VPN exit nodes to access webshells on internet-facing systems.\u003C\/li\u003E\n\u003Cli\u003EUsing Windows Management Instrumentation (\u003Ca href=\u0022https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/global\/en\/current-threats\/pdfs\/wp-windows-management-instrumentation.pdf\u0022\u003EWMI) for persistence\u003C\/a\u003E.\u003C\/li\u003E\n\u003Cli\u003EUsing Windows Shortcut files (.lnk) in the Startup folder that invoke the Windows Scripting Host (wscript.exe) to execute a Jscript backdoor for persistence.\u003C\/li\u003E\n\u003Cli\u003EReceiving C2 instructions from user profiles created by the adversary on legitimate websites\/forums such as Github and Microsoft\u0026#39;s TechNet portal.\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EImplications\u003C\/h4\u003E\n\u003Cp\u003EThe current wave of identified intrusions is consistent with TEMP.Periscope and likely reflects a concerted effort to target sectors that may yield information that could provide an economic advantage, research and development data, intellectual property, or an edge in commercial negotiations.\u003C\/p\u003E\n\u003Cp\u003EAs we continue to investigate this activity, we may identify additional data leading to greater analytical confidence linking the operation to TEMP.Periscope or other known threat actors, as well as previously unknown campaigns.\u003C\/p\u003E\n\u003Ch4\u003EIndicators\u003C\/h4\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022696\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u002289\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ci\u003EFile\u003C\/i\u003E\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ci\u003EHash\u003C\/i\u003E\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022357\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ci\u003EDescription\u003C\/i\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002289\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ex.js\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E3fefa55daeb167931975c22df3eca20a\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022357\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EHOMEFRY, a 64-bit Windows password dumper\/cracker\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002289\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Emt.exe\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E40528e368d323db0ac5c3f5e1efe4889\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022357\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EMURKYTOP, a command-line reconnaissance tool\u0026nbsp;\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002289\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ecom4.js\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ea68bf5fce22e7f1d6f999b7a580ae477\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022357\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAIRBREAK, a JavaScript-based backdoor which retrieves commands from hidden strings in compromised webpages\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n\u003Ch4\u003EHistorical Indicators\u003C\/h4\u003E\n\u003Ctable border=\u00221\u0022 cellspacing=\u00220\u0022 cellpadding=\u00220\u0022 width=\u0022696\u0022\u003E\n\u003Ctbody\u003E\u003Ctr\u003E\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ci\u003EFile\u003C\/i\u003E\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ci\u003EHash\u003C\/i\u003E\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022351\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E\u003Ci\u003EDescription\u003C\/i\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Egreen.ddd\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E3eb6f85ac046a96204096ab65bbd3e7e\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022351\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EAIRBREAK, a JavaScript-based backdoor which retrieves commands from hidden strings in compromised webpages\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EBGij\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E6e843ef4856336fe3ef4ed27a4c792b1\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022351\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EBeacon, a commercially available backdoor\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Emsresamn.ttf\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ea9e7539c1ebe857bae6efceefaa9dd16\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022351\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EPHOTO, also reported as Derusbi\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003Ctr\u003E\u003Ctd width=\u002294\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003E1024-aa6a121f98330df2edee6c4391df21ff43a33604\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022250\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003Ebd9e4c82bf12c4e7a58221fc52fed705\u003C\/p\u003E\n\u003C\/td\u003E\n\u003Ctd width=\u0022351\u0022 valign=\u0022top\u0022\u003E\u003Cp\u003EBADFLICK, backdoor that is capable of modifying the file system, generating a reverse shell, and modifying its command-and-control configuration\u003C\/p\u003E\n\u003C\/td\u003E\n\u003C\/tr\u003E\u003C\/tbody\u003E\u003C\/table\u003E\n",
        "jcr:lastModified": "Thu Mar 15 2018 13:46:39 GMT-0400",
        "sling:resourceType": "social\/blog\/components\/entrytext"
      }
    },
    "summary": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "text": "\u003Cp\u003ESince early 2018, FireEye has been tracking an ongoing wave of intrusions targeting engineering and maritime entities, especially those connected to South China Sea issues.\u003C\/p\u003E\n",
      "jcr:lastModified": "Thu Mar 15 2018 10:29:35 GMT-0400",
      "sling:resourceType": "social\/blog\/components\/entrytextteaser"
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Thu Mar 15 2018 23:48:25 GMT-0400",
      "imageRotate": "0"
    }
  }
}
