{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Tue Apr 13 2021 09:00:07 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Annual FireEye Mandiant M-Trends Report Reveals Global Statistics and Insights from Hundreds of Diverse Intrusions",
    "jcr:versionHistory": "5f36e9a3-970e-4030-943b-8d5066d7e406",
    "cq:template": "\/apps\/fireeye-www\/fdc\/templates\/press-release",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "b8676f4c-a430-491c-b833-289e530c802b"
    ],
    "jcr:created": "Mon Apr 19 2021 14:40:51 GMT+0000",
    "cq:lastModified": "Mon Apr 19 2021 14:40:48 GMT+0000",
    "jcr:baseVersion": "b8676f4c-a430-491c-b833-289e530c802b",
    "jcr:isCheckedOut": true,
    "pagedate": "Tue Apr 13 2021 02:00:00 GMT-0700",
    "cq:tags": [
      "company:en-US\/press-releases",
      "company:en-US\/press-releases\/2021",
      "company:en-US\/press-releases\/latest"
    ],
    "jcr:uuid": "66c62c1e-b8cd-440e-9721-a89be594b68d",
    "sling:resourceType": "fireeye-www\/fdc\/components\/page\/press-release",
    "cq:designPath": "\/etc\/designs\/fireeye-www",
    "cq:lastModifiedBy": "lynda.hall@fireeye.com",
    "content-par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "grid_100_full": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:createdBy": "adam.greenberg@fireeye.com",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "jcr:created": "Mon Apr 12 2021 15:40:01 GMT+0000",
        "jcr:lastModified": "Mon Apr 12 2021 15:40:01 GMT+0000",
        "sling:resourceType": "fireeye-www\/fdc\/components\/grids\/grid-100-full",
        "grid-100-mid": {
          "jcr:primaryType": "nt:unstructured",
          "sling:resourceType": "fireeye-www\/fdc\/components\/grids\/grid-parsys\/parsys-100-full\/parsys",
          "text": {
            "jcr:primaryType": "nt:unstructured",
            "jcr:createdBy": "adam.greenberg@fireeye.com",
            "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
            "jcr:created": "Mon Apr 12 2021 15:40:07 GMT+0000",
            "text": "\u003Cp style=\u0022text-align: center;\u0022\u003E\u003Ci\u003EGlobal median dwell time drops below one month – detection capabilities improve, but ransomware surges on\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EMILPITAS, Calif. – April 13, 2021\u003C\/b\u003E – \u003Ca href=\u0022https:\/\/www.fireeye.com\/\u0022\u003EFireEye, Inc.\u0026nbsp;\u003C\/a\u003E(NASDAQ: FEYE), the intelligence-led security company, today released the \u003Ca href=\u0022https:\/\/www.fireeye.com\/mtrends\u0022\u003EFireEye® Mandiant® M-Trends® 2021 report.\u003C\/a\u003E Now in its 12\u003Csup\u003Eth\u003C\/sup\u003E year, M-Trends brings together the best of cybersecurity expertise and threat intelligence with statistics and insights gleaned from recent frontline Mandiant investigations around the globe (Report metrics are based on Mandiant investigations of targeted attack activity conducted between October 1, 2019 through September 30, 2020).\u003C\/p\u003E\n\u003Cp\u003EThis year’s report outlines critical details on trending attacker techniques and malware, the proliferation of multifaceted extortion and ransomware, preparing for expected \u003Ca href=\u0022https:\/\/content.fireeye.com\/fireeye-chat\/video-fireeye-chat-episode-9\u0022\u003EUNC2452 \/ SUNBURST\u003C\/a\u003E copycat threat actors, growing insider threats, plus pandemic and industry targeting trends. Additional findings are summarized below.\u003C\/p\u003E\n\u003Ch4\u003EGlobal Median Dwell Time Drops Below One Month for First Time\u003C\/h4\u003E\n\u003Cp\u003EOver the past decade, Mandiant has observed a trending reduction in global median dwell time (defined as the duration between the start of a cyber intrusion and when it is identified). This measure went from over one year in 2011 to just 24 days in 2020 – that’s more than twice as quickly identified in comparison to last year’s report with a median dwell time of 56 days. Mandiant attributes this reduction to continued development and improvement of organizational detection and response capabilities, along with the surge of multifaceted extortion and ransomware intrusions.\u003C\/p\u003E\n\u003Cp\u003EMedian dwell time trends varied by region.\u003Cb\u003E \u003C\/b\u003EThe Americas continued to decrease. The Americas median dwell time for incidents discovered internally improved the most – dropping from 32 days down to only nine days – marking the first time a region has dipped into single digits. Conversely, APAC and EMEA experienced an overall increase in median dwell time, which Mandiant experts believe to be influenced by a greater number of intrusions with dwell times extending beyond three years, as compared to the Americas.\u003C\/p\u003E\n\u003Ch4\u003EInternal Detections on the Rise\u003C\/h4\u003E\n\u003Cp\u003EWhile last year’s report noted a drop in internal detections of intrusions compared to the previous year, Mandiant experts observed a return of organizations independently detecting most of their own incidents. Internal incident detection rose to 59% in 2020 – a 12-point increase compared to 2019. This return to organizations detecting the majority of intrusions within their environments is in line with the overall trend observed over the last five years.\u003C\/p\u003E\n\u003Cp\u003ENotably, internal detection was on the rise across all regions year-over-year. Organizations located in the Americas led the internal detection trendline at 61%, followed by EMEA and APAC closely aligned at 53% and 52%, respectively. In comparison, APAC and EMEA organizations received more notifications of compromise from external entities, versus organizations in the Americas.\u003Cb\u003E\u003C\/b\u003E\u003C\/p\u003E\n\u003Ch4\u003EAttackers Narrow Sights on Retail \u0026amp; Hospitality and Healthcare\u003C\/h4\u003E\n\u003Cp\u003EThe top five most targeted industries, in order, are Business and Professional Services, Retail and Hospitality, Financial, Healthcare and High Technology.\u003C\/p\u003E\n\u003Cp\u003EMandiant experts observed that organizations in the Retail and Hospitality industry were targeted more heavily in 2020 – coming in as the second most targeted industry compared to 11\u003Csup\u003Eth\u003C\/sup\u003E in last year’s report. Healthcare also rose significantly, becoming the third most targeted industry in 2020, compared to eighth in last year’s report. This increased focus by threat actors can most likely be explained by the vital role the healthcare sector played during the global pandemic.\u003C\/p\u003E\n\u003Ch4\u003EExecutive Quotes\u003C\/h4\u003E\n\u003Cp\u003E“While organizations continue to improve their ability to discover compromises within their environments, containing adversaries today comes with unique challenges. The consequences of a global pandemic forced companies to rethink how they operate and move to a remote workforce. This change resulted in VPN infrastructure, video conferencing, collaboration and knowledge sharing platforms becoming business-critical systems and changing the attack surface of organizations. In many cases, regular employees became responsible for connectivity and cybersecurity. While Business and Professional Services has been in the top five most targeted industries since 2016, we believe the sudden boost in business services necessary for remote working has made this industry the most targeted in 2020 by cybercriminals and state-sponsored threat actors.” – \u003Cb\u003EJurgen Kutscher, Executive Vice President, Service Delivery, Mandiant\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E“Multifaceted extortion and ransomware are the most prevalent threats to organizations. In this year’s report, direct financial gain was the likely motive for at least 36% of the intrusions we investigated. Data theft and reselling of unauthorized access to victim organizations remain high as multifaceted extortion and ransomware actors have trended away from purely opportunistic campaigns in favor of targeting organizations that are more likely to pay large extortion demands. Given this surge, organizations must take proactive action to mitigate the potential impact.”\u003Cb\u003E \u003C\/b\u003E–\u003Cb\u003E Charles Carmakal, Senior Vice President and Chief Technology Officer, Mandiant\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E“UNC2452, the threat actor responsible for the SolarWinds supply chain attack, reminds us that a highly-disciplined and patient actor cannot be underestimated. This actor’s attention paid to operational security, counter forensics, and even counterintelligence set it apart from its peers. Defense against this actor will not be easy, but it is not impossible. We have learned a great deal about UNC2452 in recent months, and we believe that intelligence will be our advantage in future encounters.” – \u003Cb\u003ESandra Joyce, Executive Vice President, Global Threat Intelligence, Mandiant\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E“This year’s M-Trends report identified the three most frequently used initial vectors of compromise as exploits (29%), phishing emails (23%) and stolen credentials or brute-force (19%). While phishing remains a preferred vector by cyber threat actors, we saw more actors leveraging exploits to compromise victims. The increase in exploit usage should remind organizations to have a more robust plan for patching product vulnerabilities. One of the challenges here is identifying what sources and information are available to make better risk-based decisions when prioritizing what systems and applications to patch now and what to patch at a later stage based on current knowledge about exploitation and targeting by threat actors.” – \u003Cb\u003EJurgen Kutscher, Executive Vice President, Service Delivery, Mandiant\u003C\/b\u003E\u003C\/p\u003E\n\u003Cp\u003E“We have continued to see a ‘wolf in sheep’s clothing’ trend where threat groups and cyber criminals rely on publicly available tools introduced in different stages of a compromise. The usage of public or commercially available tools, often used by red teams and penetration testers, allows the threat actor to blend in with security testing. It also makes attribution more complex. In this year’s report, 24% of the intrusions analyzed involved BEACON usage, which is a commercial tool, part of the Cobalt Strike software platform, commonly used for pentesting network environments. We have observed BEACON being used by a wide range of named threat groups, including APT19, APT32, APT40, APT41, FIN6, FIN7, FIN9 and FIN11, as well as nearly 300 uncategorized clusters of threat activity.” –\u003Cb\u003E Charles Carmakal, Senior Vice President and Chief Technology Officer, Mandiant\u003C\/b\u003E\u003C\/p\u003E\n\u003Ch4\u003EReport Resources\u003C\/h4\u003E\n\u003Cul\u003E\n\u003Cli\u003EFull report: \u003Ca href=\u0022https:\/\/www.fireeye.com\/mtrends\u0022\u003Ehttps:\/\/www.fireeye.com\/mtrends\u003C\/a\u003E\u003C\/li\u003E\n\u003Cli\u003EM-Trends 2021 First Look webinar on April 13: Hear firsthand analysis from Mandiant experts about this year’s report numbers, ransomware trends, and activity they continue to see:\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/472530\u0022\u003Ehttps:\/\/www.brighttalk.com\/webcast\/7451\/472530\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003Cli\u003EM-Trends 2021 By The Numbers webinar on April 15: A deep dive into this year’s report numbers along with mitigation solutions organizations should be inclined to implement:\u003Cul\u003E\n\u003Cli\u003E\u003Ca href=\u0022https:\/\/www.brighttalk.com\/webcast\/7451\/476778\u0022\u003Ehttps:\/\/www.brighttalk.com\/webcast\/7451\/476778\u003C\/a\u003E\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003C\/li\u003E\n\u003C\/ul\u003E\n\u003Ch4\u003EAbout Mandiant\u003Cb\u003E\u003C\/b\u003E\u003C\/h4\u003E\n\u003Cp\u003EMandiant, a part of FireEye, brings together the world’s leading threat intelligence and frontline expertise with continuous security validation to arm organizations with the tools needed to increase security effectiveness and reduce organizational risk.\u003C\/p\u003E\n\u003Ch4\u003EAbout FireEye, Inc.\u003Cb\u003E\u003C\/b\u003E\u003C\/h4\u003E\n\u003Cp\u003EFireEye is the intelligence-led security company. Working as a seamless, scalable extension of customer security operations, FireEye offers a single platform that blends innovative security technologies, nation-state grade threat intelligence, and world-renowned Mandiant consulting. With this approach, FireEye eliminates the complexity and burden of cyber security for organizations struggling to prepare for, prevent, and respond to cyber attacks. FireEye has over 9,900 customers across 103 countries, including more than 50 percent of the Forbes Global 2000.\u003C\/p\u003E\n\u003Cp\u003E© 2021 FireEye, Inc. All rights reserved. FireEye, Mandiant and M-Trends are registered trademarks or trademarks of FireEye, Inc. in the United States and other countries. All other brands, products, or service names are or may be trademarks or service marks of their respective owners.\u003C\/p\u003E\n\u003Ch4\u003EContacts\u003C\/h4\u003E\n\u003Cp\u003E\u003Cb\u003EMedia\u003C\/b\u003E\u003Cbr\u003E\n\u003Ca href=\u0022mailto:Media.Relations@FireEye.com\u0022\u003EMedia.Relations@FireEye.com\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EInvestors\u003C\/b\u003E\u003Cbr\u003E\n\u003Ca href=\u0022mailto:Investor.Relations@FireEye.com\u0022\u003EInvestor.Relations@FireEye.com\u003C\/a\u003E\u003C\/p\u003E\n",
            "jcr:lastModified": "Mon Apr 12 2021 15:45:04 GMT+0000",
            "sling:resourceType": "fireeye-www\/fdc\/components\/text\/text",
            "textIsRich": "true"
          }
        }
      }
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "lynda.hall@fireeye.com",
      "jcr:lastModified": "Mon Apr 19 2021 14:40:48 GMT+0000",
      "imageRotate": "0"
    }
  }
}
