{
  "jcr:primaryType": "cq:Page",
  "jcr:createdBy": "admin",
  "jcr:created": "Mon May 03 2021 13:08:02 GMT+0000",
  "jcr:content": {
    "jcr:primaryType": "cq:PageContent",
    "jcr:mixinTypes": [
      "mix:versionable"
    ],
    "jcr:createdBy": "admin",
    "jcr:title": "Mandiant Introduces New Managed Detection and Response Service for Microsoft Defender for Endpoint",
    "jcr:versionHistory": "cf56ec5f-ed5b-4286-8369-6357dd99fb5d",
    "cq:template": "\/apps\/fireeye-www\/fdc\/templates\/press-release",
    "jcr:language": "en_us",
    "jcr:predecessors": [
      "8c595018-05e5-489f-9f9c-267679be3dd2"
    ],
    "jcr:created": "Mon May 03 2021 13:08:02 GMT+0000",
    "cq:lastModified": "Mon May 03 2021 13:07:30 GMT+0000",
    "jcr:baseVersion": "8c595018-05e5-489f-9f9c-267679be3dd2",
    "jcr:isCheckedOut": true,
    "pagedate": "Mon May 03 2021 09:00:00 GMT-0400",
    "cq:tags": [
      "company:en-US\/press-releases",
      "company:en-US\/press-releases\/2021",
      "company:en-US\/press-releases\/latest",
      "fireeye-doctypes:press-releases"
    ],
    "jcr:uuid": "828da5b2-e682-41cf-a745-d42a518edbd5",
    "sling:resourceType": "fireeye-www\/fdc\/components\/page\/press-release",
    "cq:designPath": "\/etc\/designs\/fireeye-www",
    "cq:lastModifiedBy": "adam.greenberg@fireeye.com",
    "content-par": {
      "jcr:primaryType": "nt:unstructured",
      "sling:resourceType": "foundation\/components\/parsys",
      "grid_100_full": {
        "jcr:primaryType": "nt:unstructured",
        "jcr:createdBy": "adam.greenberg@fireeye.com",
        "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
        "jcr:created": "Mon May 03 2021 13:04:02 GMT+0000",
        "jcr:lastModified": "Mon May 03 2021 13:04:02 GMT+0000",
        "sling:resourceType": "fireeye-www\/fdc\/components\/grids\/grid-100-full",
        "grid-100-mid": {
          "jcr:primaryType": "nt:unstructured",
          "sling:resourceType": "fireeye-www\/fdc\/components\/grids\/grid-parsys\/parsys-100-full\/parsys",
          "text": {
            "jcr:primaryType": "nt:unstructured",
            "jcr:createdBy": "adam.greenberg@fireeye.com",
            "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
            "jcr:created": "Mon May 03 2021 13:04:06 GMT+0000",
            "text": "\u003Cp style=\u0022text-align: center;\u0022\u003E\u003Ci\u003EMandiant Managed Defense adds support for Microsoft Defender for Endpoint amplifying technology investments with unparalleled front-line expertise and market-leading intelligence\u003C\/i\u003E\u003C\/p\u003E\n\u003Cp\u003E\u003Cb\u003EMILPITAS, Calif., April 21, 2021\u003C\/b\u003E – \u003Ca href=\u0022https:\/\/www.fireeye.com\/\u0022\u003EFireEye, Inc.\u0026nbsp;\u003C\/a\u003E(NASDAQ: FEYE), the intelligence-led security company, today announced that Mandiant® Managed Defense, Mandiant’s managed detection and response service, now supports Microsoft Defender for Endpoint.\u003C\/p\u003E\n\u003Cp\u003EThis integration reflects the Mandiant strategy to augment security teams with actionable intelligence from the frontlines, regardless of security controls to maximize technology investments. Together, Mandiant and Microsoft customers can quickly and effectively investigate the most impactful events leveraging proven response tactics to direct swift, decisive action in security operations.\u003C\/p\u003E\n\u003Cp\u003E“With threat conditions changing constantly, companies require trusted expertise with powerful analytical capabilities to ensure accurate and decisive execution - this is where Mandiant shines,” said Marshall Heilman, Executive Vice President, Managed Defense and Advanced Practices, FireEye. “Working with Microsoft to integrate the expertise and intelligence from Mandiant into Microsoft Defender for Endpoint provides significantly enhanced security value to our joint customers. We are committed to delivering solutions that help customers respond faster to cyber threats, mitigating impact.”\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003E\u0026quot;Combining Microsoft security technology with Mandiant intelligence and expertise helps give our customers an increased ability to prevent, detect and respond to cyber threats in the ever evolving and complex threat landscape,\u0026quot; said Ann Johnson, CVP Security, Compliance, and Identity Business Development, Microsoft.\u003C\/p\u003E\n\u003Cp\u003EManaged Defense expertise is available to maximize effectiveness for customers regardless of endpoint – currently that means either FireEye Endpoint Security, Microsoft Defender for Endpoint, or both. Mandiant Managed Defense leverages Mandiant’s cutting-edge frontline detections as well as its leading incident response expertise. Mandiant’s speed at integrating frontline intelligence and findings from advanced threat hunting to protect customers at scale is what sets Managed Defense apart.\u0026nbsp;\u0026nbsp;\u003C\/p\u003E\n\u003Cp\u003ELearn more about Managed Defense for Microsoft Defender for Endpoint today in the \u003Ca href=\u0022https:\/\/azuremarketplace.microsoft.com\/en-us\/marketplace\/apps\/fireeye.managed-defense?tab=Overview\u0022\u003EMicrosoft Azure Marketplace\u003C\/a\u003E.\u003C\/p\u003E\n\u003Cp\u003EMandiant Managed Defense now supports Microsoft Defender for Endpoint\u0026nbsp;– blog post: \u003Ca href=\u0022https:\/\/www.fireeye.com\/blog\/products-and-services\/2021\/05\/managed-defense-now-supports-microsoft-defender-for-endpoint.html\u0022\u003Ehttps:\/\/www.fireeye.com\/blog\/products-and-services\/2021\/05\/managed-defense-now-supports-microsoft-defender-for-endpoint.html\u003C\/a\u003E\u003C\/p\u003E\n\u003Ch4\u003EAbout Mandiant\u003C\/h4\u003E\n\u003Cp\u003EMandiant, a part of FireEye, brings together the world’s leading threat intelligence and frontline expertise with continuous security validation to arm organizations with the tools needed to increase security effectiveness and reduce organizational risk.\u003C\/p\u003E\n\u003Ch4\u003EAbout FireEye, Inc.\u003C\/h4\u003E\n\u003Cp\u003EFireEye is the intelligence-led security company. Working as a seamless, scalable extension of customer security operations, FireEye offers a single platform that blends innovative security technologies, nation-state grade threat intelligence, and world-renowned Mandiant consulting. With this approach, FireEye eliminates the complexity and burden of cyber security for organizations struggling to prepare for, prevent, and respond to cyber attacks. FireEye has over 10,100 customers across 103 countries, including more than 50 percent of the Forbes Global 2000.\u003C\/p\u003E\n\u003Cp\u003E© 2021 FireEye, Inc. All rights reserved. FireEye and Mandiant are registered trademarks or trademarks of FireEye, Inc. in the United States and other countries. All other brands, products, or service names are or may be trademarks or service marks of their respective owners.\u003C\/p\u003E\n\u003Ch4\u003EContacts\u003C\/h4\u003E\n\u003Cp\u003EMedia\u003Cbr\u003E\n\u003Ca href=\u0022mailto:Media.Relations@FireEye.com\u0022\u003EMedia.Relations@FireEye.com\u003C\/a\u003E\u003C\/p\u003E\n\u003Cp\u003EInvestors\u003Cbr\u003E\n\u003Ca href=\u0022mailto:Investor.Relations@FireEye.com\u0022\u003EInvestor.Relations@FireEye.com\u003C\/a\u003E\u003C\/p\u003E\n",
            "jcr:lastModified": "Mon May 03 2021 13:06:17 GMT+0000",
            "sling:resourceType": "fireeye-www\/fdc\/components\/text\/text",
            "textIsRich": "true"
          }
        }
      }
    },
    "image": {
      "jcr:primaryType": "nt:unstructured",
      "jcr:lastModifiedBy": "adam.greenberg@fireeye.com",
      "jcr:lastModified": "Mon May 03 2021 13:07:30 GMT+0000",
      "imageRotate": "0"
    }
  }
}
